///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Предназначена для внесения изменений в форму Обслуживание обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура ОбслуживаниеПриСозданииНаСервере(Форма) Экспорт
	
	// БольничнаяАптека
	
	ЭлементыФормы = Форма.Элементы;
	
	// ОбработкаСверткаИнформационнойБазыОткрыть
	ГруппаФормы = ЭлементыФормы.Добавить("ГруппаСверткаИнформационнойБазы", Тип("ГруппаФормы"), ЭлементыФормы.ГруппаРегламентныеОперации);
	ГруппаФормы.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФормы.Отображение         = ОтображениеОбычнойГруппы.Нет;
	ГруппаФормы.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаФормы.ОтображатьЗаголовок = Ложь;
	
	// ОбработкаСверткаИнформационнойБазыОткрыть1
	Гиперссылка_СверткаИБ = СтрШаблон("e1cib/app/Обработка.%1", Метаданные.Обработки.СверткаИнформационнойБазы.Имя);
	ЭлементФормы = ЭлементыФормы.Добавить("ОбработкаСверткаИнформационнойБазыОткрыть", Тип("ДекорацияФормы"), ГруппаФормы);
	ЭлементФормы.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru = 'Свертка информационной базы'"),,,, Гиперссылка_СверткаИБ);
	ЭлементФормы.Подсказка = НСтр("ru = 'Сокращение объема данных за счет удаления неиспользуемых документов за прошлый период.'");
	ЭлементФормы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	
	// ДокументКорректировкаРегистровКорректировкаРегистров
	Гиперссылка_КорректировкаРегистров = СтрШаблон("e1cib/command/%1", Метаданные.Документы.КорректировкаРегистров.Команды.КорректировкаРегистров.ПолноеИмя());
	ЭлементФормы = ЭлементыФормы.Добавить("ДокументКорректировкаРегистровКорректировкаРегистров", Тип("ДекорацияФормы"), ЭлементыФормы.ГруппаПоискИУдалениеДублей);
	ЭлементФормы.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru = 'Корректировка регистров'"),,,, Гиперссылка_КорректировкаРегистров);
	ЭлементФормы.Подсказка = НСтр("ru = 'Ручная корректировка записей регистров накопления и регистров сведений.'");
	ЭлементФормы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	
	// Конец БольничнаяАптека
	
КонецПроцедуры

// Предназначена для внесения изменений в форму ОбщиеНастройки обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура ОбщиеНастройкиПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму Обслуживание обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура НастройкиПользователейИПравПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму ИнтернетПоддержкаИСервисы обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура ИнтернетПоддержкаИСервисыПриСозданииНаСервере(Форма) Экспорт
	
	// БольничнаяАптека
	Если Форма.ИмяФормы = Метаданные.Обработки.ПанельАдминистрированияБСП.Формы.ИнтернетПоддержкаИСервисы.ПолноеИмя() Тогда
		
		Элементы = Форма.Элементы;
		
		// Отключение видимости настроек подсистемы БИП ОнлайнОплаты.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БИПГруппаОнлайнОплаты", "Видимость", Ложь);
		
		// Отключение видимости настроек подсистемы БИП ИнтеграцияСПлатежнымиСистемами.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БИПГруппаИнтеграцияСПлатежнымиСистемами", "Видимость", Ложь);
		
	КонецЕсли;
	// Конец БольничнаяАптека
	
КонецПроцедуры

// Предназначена для внесения изменений в форму Органайзер обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура ОрганайзерПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму СинхронизацияДанных обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура СинхронизацияДанныхПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму НастройкиРаботыСФайлами обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура НастройкиРаботыСФайламиПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму ПечатныеФормыОтчетыИОбработки обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура ПечатныеФормыОтчетыИОбработкиПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти