
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область СлужебныйПрограммныйИнтерфейс

Функция СтруктураОтбораДляВыбораДокументаПоступления(Знач ОтборИлиЗначенияПолей, Знач ЗапрашиваемыеПоля = Неопределено) Экспорт
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ОтборИлиЗначенияПолей)) Тогда
		Отбор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтборИлиЗначенияПолей, ЗапрашиваемыеПоля);
	Иначе
		Отбор = ОтборИлиЗначенияПолей;
	КонецЕсли;
	
	Запрос = Новый Запрос(ИнтеграцияМДЛПБольничнаяАптека.ТекстЗапросаДокументовПоступленийДляУведомлений(ТипЗнч(Отбор.Ссылка)));
	
	Для Каждого КлючЗначение Из Отбор Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Если Не Отбор.Свойство("МестоДеятельностиГрузоотправителя") Тогда
		Запрос.УстановитьПараметр("МестоДеятельностиГрузоотправителя", Неопределено);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПустоеМестоДеятельности", Справочники.МестаДеятельностиМДЛП.ПустаяСсылка());
	
	НовыйОтбор = Новый Структура;
	НовыйОтбор.Вставить("Ссылка", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат НовыйОтбор;
	
КонецФункции

Процедура ЗарегистрироватьGTIN(ДанныеGTIN, Перезаписывать = Ложь) Экспорт
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ЗарегистрироватьШтрихкоды(ДанныеGTIN, Перезаписывать);
	
КонецПроцедуры

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
