#Область ПрограммныйИнтерфейс

#Область РаботаСФормами

// Возвращает структуру для передачи в процедуру ОткрытьФормуВыбораКлассификацииМИПоВидам.
//
// Возвращаемое значение:
//  ВозвращаемоеЗначение - Структура - структура со свойствами
//    * РазделИзделия - СправочникСсылка.РазделыНоменклатурнойКлассификацииМедицинскихИзделийПоВидам - значение для позиционирования в форме выбора.
//    * ВидИзделия - СправочникСсылка.НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам - значение для позиционирования в форме выбора.
//    * ВернутьВидИРазделИзделия - Булево - признак необходимости возврата результата в виде структуры со значениями выбора раздела и вида медицинского изделия.
//                                 Важно! Требуется реализовать событие элемента формы ОбработкаВыбора, для Владельца открываемой формы выбора,
//                                 в котором получить результат выбора в виде структуры со свойствами:
//        ** РазделИзделия - СправочникСсылка.РазделыНоменклатурнойКлассификацииМедицинскихИзделийПоВидам - выбранный раздел.
//        ** ВидИзделия    - СправочникСсылка.НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам - выбранный вид изделия.
//
&НаКлиенте
Функция ПараметрыОткрытияФормыВыбораКлассификацииМИПоВидам() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РазделИзделия"           , Неопределено);
	ВозвращаемоеЗначение.Вставить("ВидИзделия"              , Неопределено);
	ВозвращаемоеЗначение.Вставить("ВернутьВидИРазделИзделия", Ложь);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Открывает форму справочника НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам с указанными параметрами.
//
// Параметры:
//  ПараметрыФормы       - Структура - см. функцию ПараметрыОткрытияФормыВыбораКлассификацииМИПоВидам.
//  Владелец             - владелец формы - форма или элемент управления другой формы.
//  СтандартнаяОбработка - Булево - (выходной параметр) признак выполнения стандартной (системной) обработки события.
//                                  Устанавливается в значение Ложь.
//
&НаКлиенте
Процедура ОткрытьФормуВыбораКлассификацииМИПоВидам(ПараметрыФормы, Владелец, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам.Форма.ФормаВыбора", ПараметрыФормы, Владелец);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти