
#Область СлужебныйПрограммныйИнтерфейс

#Область ИнтеграцияЕИС

// См. ЭлектронноеАктированиеЕИСПереопределяемый.РаспаковыватьПроектыТитуловПоставщикаПриПолученииЗаказчиком.
Процедура РаспаковыватьПроектыТитуловПоставщикаПриПолученииЗаказчиком(РаспаковыватьПроекты) Экспорт
	
	РаспаковыватьПроекты = Ложь;
	
КонецПроцедуры

// См. ЭлектронноеАктированиеЕИСПереопределяемый.РазрешаетсяИспользоватьЭлектронноеАктированиеДляЗаказчиков.
Процедура РазрешаетсяИспользоватьЭлектронноеАктированиеДляЗаказчиков(ИспользованиеРазрешено) Экспорт
	
	ИспользованиеРазрешено = Истина;
	
КонецПроцедуры

// См. ЭлектронноеАктированиеЕИСПереопределяемый.РазрешаетсяИспользоватьЭлектронноеАктированиеДляПоставщиков.
Процедура РазрешаетсяИспользоватьЭлектронноеАктированиеДляПоставщиков(ИспользованиеРазрешено) Экспорт
	
	ИспользованиеРазрешено = Ложь;
	
КонецПроцедуры

// См. ЭлектронноеАктированиеЕИСПереопределяемый.ВерсияПриложения.
Процедура ВерсияПриложения(Версия) Экспорт
	
	МетаданныеИмя = Метаданные.Имя;
	
	Если СтрНачинаетсяС(ВРег(МетаданныеИмя), ВРег("БольничнаяАптека")) Тогда
		ИмяПрограммы = НСтр("ru = 'Медицина. Больничная аптека'");
	Иначе
		ИмяПрограммы = МетаданныеИмя;
	КонецЕсли;
	
	Версия = ИмяПрограммы + " " + Метаданные.Версия;
	
КонецПроцедуры

// См. ЭлектронноеАктированиеЕИСПереопределяемый.МедицинскаяСпециализацияВключена.
Процедура МедицинскаяСпециализацияВключена(СпециализацияВключена) Экспорт
	
	СпециализацияВключена = Истина;
	
КонецПроцедуры

// См. ЭлектронноеАктированиеЕИСПереопределяемый.НайтиСоздатьКонтрагентаПоСведениямОЗаказчике.
Процедура НайтиСоздатьКонтрагентаПоСведениямОЗаказчике(ДанныеКонтрагента, Контрагент) Экспорт
	
	РеквизитыПоиска = Новый Структура("ИНН, КПП, Наименование");
	ЗаполнитьЗначенияСвойств(РеквизитыПоиска, ДанныеКонтрагента);
	
	РеквизитыПоиска.Наименование = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонтрагента, "СокращенноеНаименование");
	Если Не ЗначениеЗаполнено(РеквизитыПоиска.Наименование) Тогда
		РеквизитыПоиска.Наименование = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонтрагента, "ПолноеНаименование");
	КонецЕсли;
	
	Контрагент = ОбщегоНазначенияБЭД.НайтиСсылку("Контрагенты",, РеквизитыПоиска);
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Отказ = Ложь;
		ОбменСКонтрагентамиПереопределяемый.СоздатьКонтрагентаПоРеквизитам(РеквизитыПоиска, Контрагент, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ИнтеграцияЕИС

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
