
&НаСервереБезКонтекста
Процедура ОбработкаОповещенияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ЗаявкаНаЗакупку" и ЗначениеЗаполнено(Источник) Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ВЗакупкуНаСервере(СсылкаНаОбъект,Отказ=Ложь)

	сок_Сервер.ЗаявкаНаЗакупку_ПереверстивСостояние_ВЗакупку(СсылкаНаОбъект,Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ВЗакупку(Команда)                                 
	КС=Элементы.Список.ВыделенныеСтроки.Количество();
	НПП=1;
	Для Каждого Стр из Элементы.Список.ВыделенныеСтроки Цикл
		Состояние("Перевоу в закупку ",НПП/КС*100);
		НПП=НПП+1;
		ВЗакупкуНаСервере(Стр);
	КонецЦикла;	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ВернутьИзЗакупкиНаСервере(СсылкаНаОбъект,Отказ=ЛОжь)
	
	Элемент = СсылкаНаОбъект.ПолучитьОбъект();
	Если Ложь Тогда Элемент = Документы.ЗаявкаНаЗакупку.СоздатьДокумент(); КонецЕсли;
	
	Если НЕ Элемент.Статус=Перечисления.СтатусыЗаказовПоставщикам.Подтвержден Тогда
		Возврат;
	КонецЕсли;	
	сок_Сервер.ЗаявкаЗакупкуСодержитОшибки(СсылкаНаОбъект,Отказ,Истина);
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ "+СсылкаНаОбъект+" содержит ошибки. Перевод в состояние ""Новый"" не возможен.");
		Возврат;
	КонецЕсли;	
	
	
	НачатьТранзакцию();
	Элемент.Статус=Перечисления.СтатусыЗаказовПоставщикам.НеСогласован;
	Попытка
		Элемент.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстСообщения="Не удалось изменить статус в документе "+ССылкаНаОбъект;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ССылкаНаОбъект,,,Отказ);
		ОтменитьТранзакцию();
		Возврат;
	Конецпопытки;	
	
	Рег = РегистрыСведений.СостоянияТребованийОтделений.СоздатьНаборЗаписей();
	Рег2 = РегистрыСведений.сок_БуферДляЗакупки.СоздатьНаборЗаписей();
	
	Для Каждого Стр из Элемент.Товары Цикл
		
		Если Стр.АвтоЗаполнение Тогда
			Рег.Отбор.ИдентификаторСтроки.Установить(Стр.ИдентификаторСтроки);
			Рег.Отбор.КодСтроки.Установить(Стр.КодСтроки);
			Рег.Прочитать();
			Для Каждого СтрР из Рег Цикл
				СтрР.Состояние=Перечисления.СостоянияТребований.Требование;
				СтрР.ЗаявкаНаЗакупку=Документы.ЗаявкаНаЗакупку.ПустаяСсылка();
				СтрР.ЗаказПоставщику=Документы.ЗаказПоставщику.ПустаяСсылка();
				СтрР.ПриходнаяНакладная=Документы.ПоступлениеТоваров.ПустаяСсылка();
				СтрР.ДокументПередачиВОтделение=Документы.ОтпускТоваровВОтделение.ПустаяСсылка();
				СтрР.ДатаЗаказа='00010101';
			КонецЦикла;	
			Попытка
				Рег.Записать(Истина);
			Исключение
					ТекстСообщения="Не удалось изменить статус в регистре сведений ""Состояния требования "" Идентификатор: "+Стр.ИдентификаторСтроки+" Код строки: "+СТР.КодСтроки+" Документ: "+ССылкаНаОбъект;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ССылкаНаОбъект,,,Отказ);
					ОтменитьТранзакцию();
					Возврат;
			КонецПопытки;	
			
		Иначе 
			Рег.Отбор.ИдентификаторСтроки.Установить(Стр.ИдентификаторСтроки);
			Рег.Отбор.КодСтроки.Установить(Стр.КодСтроки);
			Попытка
				Рег.Записать(Истина);
			Исключение
					ТекстСообщения="Не удалосьудалить записи регистра сведений ""Состояния требования "" Идентификатор: "+Стр.ИдентификаторСтроки+" Код строки: "+СТР.КодСтроки+" Документ: "+ССылкаНаОбъект;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ССылкаНаОбъект,,,Отказ);
					ОтменитьТранзакцию();
					Возврат;
			КонецПопытки;	
			
		КонецЕсли;
		
		//Чистим буфер закупки
		Рег2.Отбор.ИдентификаторСтроки.Установить(Стр.ИдентификаторСтроки);
		Рег2.Отбор.КодСтроки.Установить(Стр.КодСтроки);
		Попытка
			Рег2.Записать(Истина);
		Исключение
			ТекстСообщения="Не удалось удалить данные в регистре сведений  ""Буфер закупок "" Идентификатор: "+Стр.ИдентификаторСтроки+" Код строки: "+СТР.КодСтроки+" Документ: "+ССылкаНаОбъект;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ССылкаНаОбъект,,,Отказ);
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;	
	КонецЦикла;
	
	Попытка
		ЗафиксироватьТранзакцию();
	Исключение
		ТекстСообщения="Не удалось зафиксировать.  Документ: "+ССылкаНаОбъект;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ССылкаНаОбъект,,,Отказ);
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьИзЗакупки(Команда)
	
	Для Каждого Стр из Элементы.Список.ВыделенныеСтроки Цикл
		ВернутьИзЗакупкиНаСервере(Стр);
	КонецЦикла;
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявкуНаЗакупкуНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаЗакупку(Команда)
	СоздатьЗаявкуНаЗакупкуНаСервере();
КонецПроцедуры
