/// Методы защищенного интерфейса должны вызываться только из общего модуля КешСеанса
#Область Защищенный_интерфес

/// Получение кешируемой обертки значения
//
// Параметры:
// Параметры:
//   ИмяФункцииВычисляющейЗначение - Строка -
//     Имя функции, вычисляющей кешируемое значение, если его нет в кеше.
//   Арг1 - Произвольный -
//     Необязательный первый аргумент функции, вычисляющей кешируемое значение.
//   Арг2 - Произвольный -
//     Необязательный второй аргумент функции, вычисляющей кешируемое значение.
//   Арг3 - Произвольный -
//     Необязательный третий аргумент функции, вычисляющей кешируемое значение.
//   Арг4 - Произвольный -
//     Необязательный четвертый аргумент функции, вычисляющей кешируемое значение.
//   Арг5 - Произвольный -
//     Необязательный пятый аргумент функции, вычисляющей кешируемое значение.
//
// Возвращаемое значение:
//   Структура - Обертка значения,
//               то есть, структура, возможно содержащая свойство с именем "Значение".
///
Функция ПолучитьОберткуЗначения(ИмяФункцииВычисляющейЗначение, Арг1 = '05710422152926', Арг2 = '05710422152926', Арг3 = '05710422152926', Арг4 = '05710422152926', Арг5 = '05710422152926') Экспорт
	
	Возврат Новый Структура;
	
КонецФункции

/// Ограничение на количество дочерник оберток
//
// При превышении этого значения, самые старые дочерние обертки очищаются.
//
// Возвращаемое значение:
//   Число - максимальное число дочерних оберток.
///
Функция МаксимальноеЧислоДочернихОберток() Экспорт
	
	Возврат 100;
	
КонецФункции

#КонецОбласти
