
#Область ПрограммныйИнтерфейс

// Позволяет дозаполнить предопределенный вид номенклатуры при его создании.
//
// Пармаетры:
//  ВидНоменклатурыОбъект - СправочникОбъект.ВидыНоменклатуры
//
Процедура ПриЗаполненииПредопределенногоВидаНоменклатуры(ВидНоменклатурыОбъект) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить получение группы бухгалтерского учета по умолчанию.
//
// Параметры:
//  ТипНоменклатуры- СправочникСсылка.ТипыНоменклатурыРасширенные
//  ГруппаБухгалтерскогоУчета - СправочникСсылка.ГруппыБухгалтерскогоУчета, Неопределено - (возвращаемое значение)
//
Процедура ПриПолученииПредопределеннойГруппыБухгалтерскогоУчета(ТипНоменклатуры, ГруппаБухгалтерскогоУчета) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
