#Область Защищенный_интерфейс

/// Построение документа DOM из стоки XML
//
// Функция кешируется на время вызова, чтобы можно было ее вызывать несколько раз
// без потери времени.
//
// Параметры:
//   СтрокаXML - Строка -
//     Строка XML, по которой нужно построить DOM.
//
// Возвращаемое значение:
//   ДокументDOM - Построенный по строке XML документ DOM.
///
Функция ПостроитьDOM(СтрокаXML) Экспорт
	
	ЧтениеXML_ = Новый ЧтениеXML;
	ЧтениеXML_.УстановитьСтроку(СтрокаXML);
	
	ПостроительDOM_ = Новый ПостроительDOM;
	ДокументDOM_ = ПостроительDOM_.Прочитать(ЧтениеXML_);
	
	Возврат ДокументDOM_;
	
КонецФункции

#КонецОбласти
