
Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.Автор=ПараметрыСеанса.ТекущийПользователь;
	ЭтотОбъект.Статус=Перечисления.сок_СостоянияНеформализованныхТребований.НеСогласован;
	ЭтотОбъект.Тема="Скопирован из "+ОбъектКопирования;
	Для Каждого Стр из Товары Цикл
		Стр.ИдентификаторСтроки="";
	КонецЦикла;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для Каждого Стр из Товары Цикл
		Если стр.ИдентификаторСтроки="" Тогда
			Стр.ИдентификаторСтроки=Новый УникальныйИдентификатор;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
