
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("КартаПациента", КартаПациента) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КартаПациента", КартаПациента,,, ЗначениеЗаполнено(КартаПациента));
		Параметры.Отбор.Удалить("КартаПациента");
		Элементы.КартаПациента.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КартаПациентаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КартаПациента", КартаПациента,,, ЗначениеЗаполнено(КартаПациента));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		КартаПациентаУдаляемыхДвижений = ТекущаяСтрока.КартаПациента;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Оповестить("Запись_ДвиженияПациентов",, КартаПациентаУдаляемыхДвижений);
	ОповеститьОбИзменении(КартаПациентаУдаляемыхДвижений);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы
