
&НаСервере
Процедура ЗагрузитьИсточникиФинансированияИзQMSНаСервере()
	бит_ИнтеграцияQMSСервер.ЗагрузитьИсточникиФинансированияИзQMS();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИсточникиФинансированияИзQMS(Команда)
	ЗагрузитьИсточникиФинансированияИзQMSНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьПодразделенияИзQMSНаСервере()
	бит_ИнтеграцияQMSСервер.ЗагрузитьПодразделенияИзQMS();
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьПодразделенияИзQMS(Команда)
	ЗагрузитьПодразделенияИзQMSНаСервере();
КонецПроцедуры

