
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Запись.Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Статус) Тогда
		Запись.Статус = Перечисления.СтатусыОчередиЗагрузкиШтрихкодовИзМобильногоПриложения.ПолученИзМобильногоПриложения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.КлючУпаковки) Тогда
		ТекущийОбъект.КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(ТекущийОбъект.НомерУпаковки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ШтрихкодBase64ПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ШтрихкодBase64) И Не ЗначениеЗаполнено(Запись.НомерУпаковки) Тогда
		Данные = ИнтеграцияМДЛПКлиентСервер.ДанныеШтрихкода(ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(Запись.ШтрихкодBase64)));
		Если Данные.Свойство("SGTIN") Тогда
			Запись.НомерУпаковки = Данные.SGTIN;
			Запись.КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(Запись.НомерУпаковки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
