// Описание дополнительных настроек отчета
// В данной процедуре можно задать описания вариантов отчетов, определить дополнительные варианты,
// определить дополнительные разделы варианта отчета
//
Процедура НастройкиОтчета(Настройки) Экспорт

    //Описание вариантов отчетов
    СхемаКомпоновки = Отчеты.ИмяОтчета.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    Для каждого ВариантНастройки Из СхемаКомпоновки.ВариантыНастроек Цикл
        ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, ВариантНастройки.Имя, "");
    КонецЦикла;
    
КонецПроцедуры    

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;

	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	МодульВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Ложь);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЖурналПК");
	НастройкиВарианта.Описание = НСтр("ru = 'Журнал приемочного контроля'");
	
КонецПроцедуры
