
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Попытка
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	Исключение
	КонецПопытки;
	Если МодульПодключаемыеКоманды <> Неопределено Тогда
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Подсистема Архивирование
	АрхивированиеСервер.ФормаСпискаПриСозданииНаСервере(ЭтотОбъект, "Список");
	// конец Подсистема Архивирование
	
	Попытка
		МодульОбщиеМеханизмыКлиент = ОбщегоНазначения.ОбщийМодуль("ОбщиеМеханизмыКлиент");
	Исключение
		Элементы.ФормаВыгрузитьВФайлы.Видимость = Ложь;
		Элементы.ФормаЗагрузитьИзФайлов.Видимость = Ложь;
	КонецПопытки;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область Архивирование

// Подсистема Архивирование
&НаКлиенте
Процедура Подключаемый_ПросмотрАрхивныхЭлементов(Команда) Экспорт
	
	Архивирование.КомандаПросмотрАрхивныхЭлементов(ЭтотОбъект, "Список", Команда);
	
КонецПроцедуры
// конец Подсистема Архивирование

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вызывается в ОписанииОповещения после закрытия формы загрузки из справочника
&НаКлиенте
Процедура ПослеЗагрузкиИзНСИ_Росминздрав(РезультатВызова, ПараметрыВызова) Экспорт

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗагрузитьССайтаМинздрава(Команда)
		
	ОповещениеОЗакрытии_ = Новый ОписаниеОповещения("ПослеЗагрузкиИзНСИ_Росминздрав", ЭтотОбъект);
	Параметры_ = Новый Структура;
	Параметры_.Вставить("ИмяОбъекта", "ТипыМДРегистрируемыхВРЭМД");
	Параметры_.Вставить("ЗаголовокФормы", "Загрузка типов регистрируемых документов в справочник"); 
	Параметры_.Вставить("ЗагружатьИзИнтернета", "Истина");
	ОткрытьФорму("ОбщаяФорма.ЗагрузкаНСИИзКлассификатора", Параметры_, Элементы.Список, , , , ОповещениеОЗакрытии_);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайлы(Команда)
	МассивСсылок_ = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока_ Из Элементы.Список.ВыделенныеСтроки Цикл
		МассивСсылок_.Добавить(ВыделеннаяСтрока_);
	КонецЦикла;
	
	Если МассивСсылок_.Количество() > 0 Тогда
		МодульОбщиеМеханизмыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщиеМеханизмыКлиент");
		МодульОбщиеМеханизмыКлиент.ВыгрузитьОбъектыВФайлы(МассивСсылок_);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлов(Команда)
	МодульОбщиеМеханизмыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщиеМеханизмыКлиент");
	МодульОбщиеМеханизмыКлиент.ЗагрузитьОбъектыИзФайлов("Справочник.ТипыМДРегистрируемыхВРЭМД");
КонецПроцедуры


#КонецОбласти
