
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ОтборНепривязанные = Параметры.Свойство("ОтборНеПривязанныеКНоменклатуре") И Параметры.ОтборНеПривязанныеКНоменклатуре;
	Если ОтборНепривязанные Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	РегистрЛекарственныхСредств.Ссылка КАК ССылка
		|ИЗ
		|	Справочник.РегистрЛекарственныхСредств КАК РегистрЛекарственныхСредств
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.Номенклатура КАК Номенклатура
		|		ПО
		|			РегистрЛекарственныхСредств.Ссылка = Номенклатура.ЭлементКАТ
		|ГДЕ
		|	(Номенклатура.Ссылка ЕСТЬ NULL
		|	ИЛИ Номенклатура.Ссылка = &Номенклатура)
		|";
		Запрос.УстановитьПараметр("Номенклатура", ?(Параметры.Свойство("Номенклатура"), Параметры.Номенклатура, Справочники.Номенклатура.ПустаяСсылка()));
		
		Параметры.Отбор.Вставить("Ссылка", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область СлужебныйПрограммныйИнтерфейс

// Заполняет описание препарата в регистре ОписанияЛекарственныхСредств
//
// Параметры
//  Препарат - СправочникСсылка.РегистрЛекарственныхСредств
//
Процедура ЗаполнитьУпаковкиПрепарата(Препарат) Экспорт
	
	ЗапрашиваемыеПоля = Новый Структура;
	ЗапрашиваемыеПоля.Вставить("Ссылка");
	ЗапрашиваемыеПоля.Вставить("Упаковка");
	
	ОписаниеПрепарата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Препарат, ЗапрашиваемыеПоля);
	
	Набор = РегистрыСведений.УпаковкиЛекарственныхСредств.СоздатьНаборЗаписей();
	Набор.Отбор.КАТ.Установить(ОписаниеПрепарата.Ссылка);
	
	ЗаполнитьУпаковкиПрепаратаРекурсивно(Набор, ОписаниеПрепарата, ОписаниеПрепарата.Упаковка);

	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьУпаковкиПрепаратаРекурсивно(Набор, ОписаниеПрепарата, Упаковка, НомерУпаковки = 1)
	
	Если Не ЗначениеЗаполнено(Упаковка) Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка, "Родитель");
	ЗаполнитьУпаковкиПрепаратаРекурсивно(Набор, ОписаниеПрепарата, Родитель, НомерУпаковки);
	
	СтрокаНабора = Набор.Добавить();
	СтрокаНабора.Упаковка       = Упаковка;
	СтрокаНабора.КАТ            = ОписаниеПрепарата.Ссылка;
	СтрокаНабора.НомерУпаковки  = НомерУпаковки;
	
	НомерУпаковки = НомерУпаковки + 1;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Команды формы
#Область КомандыФормы

// Заполняет список команд ввода на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - Таблица команд для вывода в подменю. Для изменения.
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании, НастройкиФормы) Экспорт
	
	ВводНаОснованииБольничнаяАптека.ДобавитьКомандыСозданияНаОсновании(ПустаяСсылка().Метаданные().ПолноеИмя(), КомандыСоздатьНаОсновании, НастройкиФормы);
	
КонецПроцедуры

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица команд для вывода в подменю. Для изменения.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, НастройкиФормы) Экспорт
	
	МенюОтчетыБольничнаяАптека.ДобавитьОбщиеКоманды(ПустаяСсылка().Метаданные().ПолноеИмя(), КомандыОтчетов, НастройкиФормы);
	
КонецПроцедуры

#КонецОбласти // КомандыФормы

#КонецОбласти // СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// СТАНДАРТНЫЕ ПОДСИСТЕМЫ
#Область СтандартныеПодсистемы

// Возвращает описание блокируемых реквизитов
//
// Возвращаемое значение:
//  Массив - имена блокируемых реквизитов
//   Элемент массива - Строка в формате:
//     ИмяРеквизита[;ИмяЭлементаФормы,...]
//      где
//       ИмяРеквизита     - имя реквизита объекта
//       ИмяЭлементаФормы - имя элемента формы, связанного с реквизитом
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("ДействующиеВеществаМНН");
	БлокируемыеРеквизиты.Добавить("ТорговоеНаименование");
	БлокируемыеРеквизиты.Добавить("ФормаВыпуска");
	БлокируемыеРеквизиты.Добавить("БазоваяЕдиницаИзмеренияКАТ");
	БлокируемыеРеквизиты.Добавить("Упаковка");
	
	БлокируемыеРеквизиты.Добавить("ГруппаПКУ");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти // СтандартныеПодсистемы

#КонецЕсли