//|                                                                                           |
//| ░██████╗░█████╗░██╗░░██╗░█████╗░██╗░░░░░░█████╗░██╗░░░██╗       ██╗░░░██╗░█████╗░███╗░░██╗|
//| ██╔════╝██╔══██╗██║░██╔╝██╔══██╗██║░░░░░██╔══██╗██║░░░██║       ╚██╗░██╔╝██╔══██╗████╗░██║|
//| ╚█████╗░██║░░██║█████═╝░██║░░██║██║░░░░░██║░░██║╚██╗░██╔╝       ░╚████╔╝░███████║██╔██╗██║|
//| ░╚═══██╗██║░░██║██╔═██╗░██║░░██║██║░░░░░██║░░██║░╚████╔╝░       ░░╚██╔╝░░██╔══██║██║╚████║|
//| ██████╔╝╚█████╔╝██║░╚██╗╚█████╔╝███████╗╚█████╔╝░░╚██╔╝░░       ░░░██║░░░██║░░██║██║░╚███║|
//| ╚═════╝░░╚════╝░╚═╝░░╚═╝░╚════╝░╚══════╝░╚════╝░░░░╚═╝░░░       ░░░╚═╝░░░╚═╝░░╚═╝╚═╝░░╚══╝|
//|                                                                                           |
//|_____________________________________lostcay@yandex.ru_____________________________________|
//|                                                                                           |
//|                     ░█████╗░░░██╗██╗░░░░██╗██████╗░░█████╗░██████╗░██████╗░               |
//|                     ██╔══██╗░██╔╝██║░░░██╔╝╚════██╗██╔══██╗╚════██╗╚════██╗               |
//|                     ██║░░██║██╔╝░██║░░██╔╝░░░███╔═╝██║░░██║░░███╔═╝░█████╔╝               |
//|                     ██║░░██║███████║░██╔╝░░██╔══╝░░██║░░██║██╔══╝░░░╚═══██╗               |
//|                     ╚█████╔╝╚════██║██╔╝░░░███████╗╚█████╔╝███████╗██████╔╝               |
//|                     ░╚════╝░░░░░░╚═╝╚═╝░░░░╚══════╝░╚════╝░╚══════╝╚═════╝░               |
//|___________________________________________________________________________________________|
#Область Интерфейс

Функция Сериализация_JSON(Структура) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет,"");
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, Структура);
		
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция Десериализация_JSON(ТекстJSON) Экспорт
	Если СокрЛП(ТекстJSON)="" Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Структура = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	Возврат Структура;
КонецФункции

#КонецОбласти













































