
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

// Возвращает признак использования подключаемого оборудования в форме
//
// Параметры
//	Форма - ФормаКлиентскогоПриложения
//
// Возвращаемое значение
//	Булево -Истина, если в форме возможно использование подключаемого оборудования
//
Функция ИспользоватьПодключаемоеОборудование(Форма) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ИспользоватьПодключаемоеОборудование") Тогда
		Возврат Форма.ИспользоватьПодключаемоеОборудование;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияБольничнаяАптекаВызовСервера.ИспользоватьПодключаемоеОборудование();
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
