#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

// Функция определяет банковский счет выбранной организации.
//
// Возвращает банковский счет организации, если найден один банковский счет.
// Возвращает Неопределено, если банковский счет не найден или счетов больше одного.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Ссылка на организацию
//
// Возвращаемое значение:
//	СправочникСсылка.БанковскиеСчетаОрганизаций - Найденный банковский счет организации
//
Функция ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Организация) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 2
	|	БанковскиеСчетаОрганизаций.Ссылка КАК БанковскийСчетОрганизации
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|ГДЕ
	|	НЕ БанковскиеСчетаОрганизаций.ПометкаУдаления
	|	И БанковскиеСчетаОрганизаций.Владелец = &Организация
	|");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1
	   И Выборка.Следующий() Тогда
		БанковскийСчетОрганизации = Выборка.БанковскийСчетОрганизации;
	Иначе
		БанковскийСчетОрганизации = Неопределено;
	КонецЕсли;
	
	Возврат БанковскийСчетОрганизации;

КонецФункции

// Функция определяет организацию и валюту выбранного банковского счета.
//
// Параметры:
//  БанковскийСчет - СправочникСсылка.БанковскиеСчетаОрганизаций - Ссылка на банковский счет
//
// Возвращаемое значение:
//	Структура - Организация и валюта банковского счета
//
Функция ПолучитьРеквизитыБанковскогоСчетаОрганизации(БанковскийСчет) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	БанковскиеСчета.Владелец               КАК Организация,
	|	БанковскиеСчета.ВалютаДенежныхСредств  КАК Валюта,
	|	БанковскиеСчета.НомерСчета             КАК НомерСчета,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанка
	|			ТОГДА БанковскиеСчета.НаименованиеБанка
	|		ИНАЧЕ БанковскиеСчета.Банк
	|	КОНЕЦ                                  КАК Банк,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанка
	|			ТОГДА БанковскиеСчета.НаименованиеБанка
	|		ИНАЧЕ БанковскиеСчета.Банк.Наименование
	|	КОНЕЦ                                  КАК НаименованиеБанка,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанка
	|			ТОГДА БанковскиеСчета.БИКБанка
	|		ИНАЧЕ БанковскиеСчета.Банк.Код
	|	КОНЕЦ                                  КАК БИК,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанка
	|			ТОГДА БанковскиеСчета.КоррСчетБанка
	|		ИНАЧЕ БанковскиеСчета.Банк.КоррСчет
	|	КОНЕЦ                                  КАК КоррСчет,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанка
	|			ТОГДА БанковскиеСчета.АдресБанка
	|		ИНАЧЕ БанковскиеСчета.Банк.Адрес
	|	КОНЕЦ                                  КАК АдресБанка,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА БанковскиеСчета.НаименованиеБанкаДляРасчетов
	|		ИНАЧЕ БанковскиеСчета.БанкДляРасчетов
	|	КОНЕЦ                                  КАК БанкДляРасчетов,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА БанковскиеСчета.НаименованиеБанкаДляРасчетов
	|		ИНАЧЕ БанковскиеСчета.БанкДляРасчетов.Наименование
	|	КОНЕЦ                                  КАК НаименованиеБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА БанковскиеСчета.БИКБанкаДляРасчетов
	|		ИНАЧЕ БанковскиеСчета.БанкДляРасчетов.Код
	|	КОНЕЦ                                  КАК БИКБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА БанковскиеСчета.КоррСчетБанкаДляРасчетов
	|		ИНАЧЕ БанковскиеСчета.БанкДляРасчетов.КоррСчет
	|	КОНЕЦ                                  КАК КоррСчетБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА БанковскиеСчета.АдресБанкаДляРасчетов
	|		ИНАЧЕ БанковскиеСчета.БанкДляРасчетов.Адрес
	|	КОНЕЦ                                  КАК АдресБанкаДляРасчетов
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Ссылка = &БанковскийСчет
	|");
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация                  = Выборка.Организация;
		Валюта                       = Выборка.Валюта;
		НомерСчета                   = Выборка.НомерСчета;
		Банк                         = Выборка.Банк;
		НаименованиеБанка            = Выборка.НаименованиеБанка;
		БИК                          = Выборка.БИК;
		КоррСчет                     = Выборка.КоррСчет;
		АдресБанка                   = Выборка.АдресБанка;
		БанкДляРасчетов              = Выборка.БанкДляРасчетов;
		НаименованиеБанкаДляРасчетов = Выборка.НаименованиеБанка;
		БИКБанкаДляРасчетов          = Выборка.БИКБанкаДляРасчетов;
		КоррСчетБанкаДляРасчетов     = Выборка.КоррСчетБанкаДляРасчетов;
		АдресБанкаДляРасчетов        = Выборка.АдресБанкаДляРасчетов;
	Иначе
		Организация                  = Неопределено;
		Валюта                       = Неопределено;
		НомерСчета                   = "";
		Банк                         = Неопределено;
		НаименованиеБанка            = "";
		БИК                          = "";
		КоррСчет                     = "";
		АдресБанка                   = "";
		БанкДляРасчетов              = Неопределено;
		НаименованиеБанкаДляРасчетов = "";
		БИКБанкаДляРасчетов          = "";
		КоррСчетБанкаДляРасчетов     = "";
		АдресБанкаДляРасчетов        = "";
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация"                 , Организация);
	СтруктураРеквизитов.Вставить("Валюта"                      , Валюта);
	СтруктураРеквизитов.Вставить("НомерСчета"                  , НомерСчета);
	СтруктураРеквизитов.Вставить("Банк"                        , Банк);
	СтруктураРеквизитов.Вставить("НаименованиеБанка"           , НаименованиеБанка);
	СтруктураРеквизитов.Вставить("БИК"                         , БИК);
	СтруктураРеквизитов.Вставить("КоррСчет"                    , КоррСчет);
	СтруктураРеквизитов.Вставить("АдресБанка"                  , АдресБанка);
	СтруктураРеквизитов.Вставить("БанкДляРасчетов"             , БанкДляРасчетов);
	СтруктураРеквизитов.Вставить("НаименованиеБанкаДляРасчетов", НаименованиеБанкаДляРасчетов);
	СтруктураРеквизитов.Вставить("БИКБанкаДляРасчетов"         , БИКБанкаДляРасчетов);
	СтруктураРеквизитов.Вставить("КоррСчетБанкаДляРасчетов"    , КоррСчетБанкаДляРасчетов);
	СтруктураРеквизитов.Вставить("АдресБанкаДляРасчетов"       , АдресБанкаДляРасчетов);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти // ПрограммныйИнтерфейс


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Команды формы
#Область КомандыФормы

// Заполняет список команд ввода на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - Таблица команд для вывода в подменю. Для изменения.
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании, НастройкиФормы) Экспорт
	
	ВводНаОснованииБольничнаяАптека.ДобавитьКомандыСозданияНаОсновании(ПустаяСсылка().Метаданные().ПолноеИмя(), КомандыСоздатьНаОсновании, НастройкиФормы);
	
КонецПроцедуры

#КонецОбласти // КомандыФормы

#КонецОбласти // СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// СТАНДАРТНЫЕ ПОДСИСТЕМЫ
#Область СтандартныеПодсистемы

// Возвращает описание блокируемых реквизитов
//
// Возвращаемое значение:
//  Массив - имена блокируемых реквизитов
//   Элемент массива - Строка в формате:
//     ИмяРеквизита[;ИмяЭлементаФормы,...]
//      где
//       ИмяРеквизита     - имя реквизита объекта
//       ИмяЭлементаФормы - имя элемента формы, связанного с реквизитом
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("ВалютаДенежныхСредств");
	Результат.Добавить("Владелец");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // СтандартныеПодсистемы

#КонецЕсли