#Область ПрограммныйИнтерфейс

// Кодирует строку в формат base64.
Функция КодироватьBase64(Строка) Экспорт

	Двоичные_ = СтрокаВДвоичныеДанные(Строка);
	Результат_ = Base64Строка(Двоичные_);
	
	Возврат Результат_;
КонецФункции

// Получает исходную строку из base64.
Функция ДекодироватьBase64(base64) Экспорт

	Двоичные_ = Base64Значение(base64);
	Результат_ = ДвоичныеДанныеВСтроку(Двоичные_);
	
	Возврат Результат_;
КонецФункции

// Преобразует строку в ДвоичныеДанные.
Функция СтрокаВДвоичныеДанные(Строка) Экспорт
	Поток_ = Новый ПотокВПамяти();
	ЗаписьДанных_ = Новый ЗаписьДанных(Поток_, , , "", "");
	
	ЗаписьДанных_.ЗаписатьСимволы(Строка);
	
	ЗаписьДанных_.Закрыть();
	Возврат Поток_.ЗакрытьИПолучитьДвоичныеДанные();
КонецФункции

// Преобразует ДвоичныеДанные содержащие текст в строку.
Функция ДвоичныеДанныеВСтроку(ДвоичныеДанныеТекст) Экспорт
	ЧтениеДанных_ = Новый ЧтениеДанных(ДвоичныеДанныеТекст, , , , "");
	
	Результат_ = ЧтениеДанных_.ПрочитатьСимволы();
	
	Возврат Результат_;
КонецФункции

#КонецОбласти



