&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаСервере
Функция ВозможноПереверстиВСостояниеВОбсуждение(СсылкаНаОбъект)
	
		Отказ=Ложь;
		
		Рег = РегистрыСведений.СостоянияТребованийОтделений.СоздатьНаборЗаписей();
		Рег.Отбор.Требование.Установить(СсылкаНаОбъект);
		Рег.Прочитать();
		Если Рег.Количество()>0 Тогда
			ТекстСообщения="По документу есть данные в регистре ""Состояния требований отделений."" это недопустимо. Исправьте данные.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,СсылкаНаОбъект,,,Отказ);
		КонецЕсли;	

		Рег = РегистрыСведений.сок_БуферНеформальныхТребований.СоздатьНаборЗаписей();
		Рег.Отбор.Требование.Установить(СсылкаНаОбъект);
		Рег.Прочитать();
		Если Рег.Количество()>0 Тогда
			ТекстСообщения="По документу есть данные в регистре ""Буфер не формальных требований."" это недопустимо. Исправьте данные.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,СсылкаНаОбъект,,,Отказ);
		КонецЕсли;	

		Рег = РегистрыСведений.сок_БуферДляЗакупки.СоздатьНаборЗаписей();
		Рег.Отбор.Требование.Установить(СсылкаНаОбъект);
		Рег.Прочитать();
		Если Рег.Количество()>0 Тогда
			ТекстСообщения="По документу есть данные в регистре ""Буфер для закупки."" это недопустимо. Исправьте данные.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,СсылкаНаОбъект,,,Отказ);
		КонецЕсли;	
		
		Возврат Не Отказ;
КонецФункции	
&НаСервере
Процедура ОтправитьВОбсуждениеНаСервере(СсылкаНаОбъект)
	Элемент = СсылкаНаОбъект.ПолучитьОбъект();
	Если Ложь Тогда Элемент = Документы.сок_НеФормализованноеТребованиеОтделения.СоздатьДокумент() КонецЕсли;
	
	Если Элемент.Статус=Перечисления.сок_СостоянияНеформализованныхТребований.НеСогласован Тогда
		Если ВозможноПереверстиВСостояниеВОбсуждение(СсылкаНаОбъект) Тогда
			НачатьТранзакцию();
			Элемент.Статус=Перечисления.сок_СостоянияНеформализованныхТребований.ВОбсуждении;
			Элемент.Записать(РежимЗаписиДокумента.Проведение);
			
			Рег = РегистрыСведений.СостоянияТребованийОтделений.СоздатьНаборЗаписей();
			Рег.Отбор.Требование.Установить(СсылкаНаОбъект);
			
			РегБ = РегистрыСведений.сок_БуферНеформальныхТребований.СоздатьНаборЗаписей();
			РегБ.Отбор.Требование.Установить(СсылкаНаОбъект);
			
			Для Каждого СтрР из Элемент.Товары Цикл
				Если НЕ СтрР.Отменено Тогда
					Движение = Рег.Добавить();
					Движение.ИдентификаторСтроки=СтрР.ИдентификаторСтроки;
					Движение.КодСтроки=0;
					Движение.Количество=СтрР.Количество;
					Движение.Номенклатура=СтрР.Номенклатура;
					Движение.НоменклатураЗаказа=СтрР.Описание;
					Движение.Требование=СсылкаНаОбъект;
					Движение.Состояние=Перечисления.СостоянияТребований.ТребованиеНеФормализованное;
					Движение.ДатаЗаказа=ТекущаяДата();
					
					ДвижениеБ=РегБ.Добавить();
					ДвижениеБ.ИдентификаторСтроки=СтрР.ИдентификаторСтроки;
					ДвижениеБ.КодСтроки=0;
					ДвижениеБ.Количество=СтрР.Количество;
					ДвижениеБ.Номенклатура=СтрР.Номенклатура;
					ДвижениеБ.НоменклатураЗаказа=СтрР.Описание;
					ДвижениеБ.Требование=СсылкаНаОбъект;
					ДвижениеБ.ДатаЗаказа=ТекущаяДата();
					
				КонецЕсли;
			КонецЦикла;	
			Рег.Записать(Истина);
			РегБ.Записать(Истина);
			ЗафиксироватьТранзакцию();
			ТекстОповещения=""+СсылкаНаОбъект+" переведено в состояние ""В обсуждение"" 
						    |Ссылка "+ ПолучитьНавигационнуюСсылку(СсылкаНаОбъект);
			Масс=Новый Массив;
			Спр = Справочники.сок_НеФормализованноеТребованиеОтделенияПрисоединенныеФайлы.Выбрать(,,Новый Структура("ВладелецФайла",СсылкаНаОбъект));
			Пока Спр.Следующий() Цикл
				Если НЕ Спр.ПометкаУдаления Тогда
					Масс.Добавить(Спр.Ссылка);
				КонецЕсли;	
			КонецЦикла;	
			сок_Сервер.ОтправитьОповещениеПоПочте(Элемент.ВидТребования.ПолучателиОповещенияПоПочте,ТекстОповещения,Масс);
		КонецЕсли;	
	Иначе     
		ТекстСообщения="Документ "+СсылкаНаОбъект+" на ходится в состоянии "+Элемент.Статус+", поэтому не может быть передан в обсуждение.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,СсылкаНаОбъект);
	КонецЕсли;	
КонецПроцедуры		

&НаКлиенте
Процедура ОтправитьВОбсуждение(Команда)           
	Для Каждого Стр из  Элементы.Список.ВыделенныеСтроки Цикл
		ОтправитьВОбсуждениеНаСервере(Стр);
	КонецЦикла;	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Функция МожноВернутьИзОбсуждения(СсылкаНаОбъект) 

		Отказ=Ложь;
		
		Рег = РегистрыСведений.СостоянияТребованийОтделений.СоздатьНаборЗаписей();
		Рег.Отбор.Требование.Установить(СсылкаНаОбъект);
		Рег.Прочитать();  
		Для Каждого СтрР из Рег Цикл
			Если НЕ СтрР.Состояние=Перечисления.СостоянияТребований.ТребованиеНеФормализованное Тогда
				ТекстСообщения="Строка "+СтрР.НомерСтроки+" в регистре ""Состояния требований отделений"" в состоянии "+СтрР.Состояние+", а должно быть ""Требование (не формализованное)"". Возврат не возможен. Исправьте данные";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,СсылкаНаОбъект,,,Отказ);
			КонецЕсли;	
		КонецЦикла;	

		Рег = РегистрыСведений.сок_БуферДляЗакупки.СоздатьНаборЗаписей();
		Рег.Отбор.Требование.Установить(СсылкаНаОбъект);
		Рег.Прочитать();
		Если Рег.Количество()>0 Тогда
			ТекстСообщения="По документу есть данные в регистре ""Буфер для закупки."" это недопустимо. Исправьте данные.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,СсылкаНаОбъект,,,Отказ);
		КонецЕсли;	
		
		Возврат Не Отказ;
	
КонецФункции	

&НаСервере
Процедура ВернутьИзОбсужденияНаСервере(СсылкаНаОбъект)
	Элемент = СсылкаНаОбъект.ПолучитьОбъект();
	Если Ложь Тогда Элемент = Документы.сок_НеФормализованноеТребованиеОтделения.СоздатьДокумент() КонецЕсли;
	
	
	Если Элемент.Статус=Перечисления.сок_СостоянияНеформализованныхТребований.ВОбсуждении Тогда
		Если МожноВернутьИзОбсуждения(СсылкаНаОбъект) Тогда
			НачатьТранзакцию();
			Элемент.Статус=Перечисления.сок_СостоянияНеформализованныхТребований.НеСогласован;
			Элемент.Записать(РежимЗаписиДокумента.Проведение);
			Рег = РегистрыСведений.СостоянияТребованийОтделений.СоздатьНаборЗаписей();
			Рег.Отбор.Требование.Установить(СсылкаНаОбъект);
			Рег.Записать(Истина);			
			Рег = РегистрыСведений.сок_БуферНеформальныхТребований.СоздатьНаборЗаписей();
			Рег.Отбор.Требование.Установить(СсылкаНаОбъект);
			Рег.Записать(Истина);			
			ЗафиксироватьТранзакцию();
		КонецЕсли;	
	Иначе     
		ТекстСообщения="Документ "+СсылкаНаОбъект+" на ходится в состоянии "+Элемент.Статус+", поэтому не может быть переведен состояние ""Не согласован"".";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,СсылкаНаОбъект);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьИзОбсуждения(Команда)
	Для Каждого Стр из  Элементы.Список.ВыделенныеСтроки Цикл
		ВернутьИзОбсужденияНаСервере(Стр);
	КонецЦикла;		
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьВсеВозможныеЗаказыНаСервере()
	сок_Проверки.ЗакрытьНеформализованноеТребованиеЕслиВозможно();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьВсеВозможныеЗаказы(Команда)
	ЗакрытьВсеВозможныеЗаказыНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьТекущееТребованиеЕслиВозможноНаСервере()
	Масс=Новый Массив;
	Для Каждого Стр из Элементы.Список.ВыделенныеСтроки Цикл
		Масс.Добавить(Стр);
	КонецЦикла;	
	сок_Проверки.ЗакрытьНеформализованноеТребованиеЕслиВозможно(Масс);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьТекущееТребованиеЕслиВозможно(Команда)
	ЗакрытьТекущееТребованиеЕслиВозможноНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры
