
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Ответственный=ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура РасшифровкаПлатежаПередУдалением(Элемент, Отказ)
	Отказ=Истина;
	ТекущиеДанные=Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если НЕ ТекущиеДанные=Неопределено Тогда
		ТекущиеДанные.Отменено=НЕ ТекущиеДанные.Отменено;
	Конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
КонецПроцедуры
