
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВалютаДокумента=Константы.ВалютаРегламентированногоУчета.Получить();
		Объект.Автор=ПараметрыСеанса.ТекущийПользователь;
		Если Объект.Ответственный.Пустая() Тогда
			Объект.Ответственный=ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;	
		Если Объект.СостояниеЗаявки="" Тогда
			Объект.СостояниеЗаявки="Черновик";
		КонецЕсли;	
	КонецЕсли;	
	СуммаОплаты=Объект.Оплаты.Итог("Сумма");
	//Элементы.Заявка.ТолькоПросмотр=Объект.Отправлена;
КонецПроцедуры

