
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

// Получает данные мобильного приложения из очереди.
//
// Параметры:
//  Свойства          - Строка - (необязательный) набор свойств, перечисленных через запятую, которые нужно получить из очереди.
//  Пользователь      - СправочникСсылка.Пользователи - (необязательный) пользователь, от имени которого были сформированы данные.
//                      Если не установлен, будут получены данные текущего пользователя.
//
// Возвращаемое значение:
//  Массив - состоящий из структур с элементами переданных свойств.
//
Функция ПолучитьДанныеМобильногоПриложенияИзОчереди(Знач Свойства = "", Знач Пользователь = Неопределено) Экспорт
	
	Возврат ИнтеграцияСМобильнымПриложением.ПолучитьДанныеМобильногоПриложенияИзОчереди(Свойства, Пользователь);
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
