
&НаСервере
Процедура СнятьПризнакОтправленаНаСервере(СсылкаНаОбъект)
	Элемент = СсылкаНаОбъект.ПолучитьОбъект();
	Если Ложь Тогда Элемент=Документы.сок_ЗаявкаНаРасходованиеДенежныхСредств.СоздатьДокумент() КонецЕсли;
	Элемент.Отправлена=Ложь;
	Элемент.ДатаОтправки='00010101';                  
	Элемент.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПризнакОтправлена(Команда)
	СнятьПризнакОтправленаНаСервере(Элементы.Список.ТекущаяСтрока);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОтправитьЗаявкуВБитФинансНаСервере()
	Масс=Новый Массив;
	Для Каждого Стр из Элементы.Список.ВыделенныеСтроки Цикл
		Масс.Добавить(Стр);
	КонецЦикла;	
	Если Масс.Количество()>0 Тогда
		Сок_Веб.ОтправитьМассивЗаявокНаРасходованиеДенежныхСредств(Масс);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаявкуВБитФинанс(Команда)
	
	ОтправитьЗаявкуВБитФинансНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОтправитьТолькоПрисоединенныеФайлыНаСервере()
	Масс=Новый Массив;
	Для Каждого Стр из Элементы.Список.ВыделенныеСтроки Цикл
		Масс.Добавить(Стр);
	КонецЦикла;	
	Если Масс.Количество()>0 Тогда
		Сок_Веб.ОтправитьМассивПрикрепленныхФайловПоМассивуЗаявок(Масс);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьТолькоПрисоединенныеФайлы(Команда)
	ОтправитьТолькоПрисоединенныеФайлыНаСервере();
КонецПроцедуры
