///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет список модулей библиотек и конфигурации, которые предоставляют
// основные сведения о себе: имя, версия, список обработчиков обновления
// а также зависимости от других библиотек.
//
// Состав обязательных процедур такого модуля см. в общем модуле ОбновлениеИнформационнойБазыБСП
// (область ПрограммныйИнтерфейс).
// При этом сам модуль Библиотеки стандартных подсистем ОбновлениеИнформационнойБазыБСП
// не требуется явно добавлять в массив МодулиПодсистем.
//
// Параметры:
//  МодулиПодсистем - Массив - имена серверных общих модулей библиотек и конфигурации.
//                             Например: "ОбновлениеИнформационнойБазыБРО" - библиотека,
//                                       "ОбновлениеИнформационнойБазыБП"  - конфигурация.
//                    
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	
	// ПодключаемоеОборудование
	МодулиПодсистем.Добавить(Метаданные.ОбщиеМодули.ОбновлениеИнформационнойБазыБПО.Имя);
	// Конец ПодключаемоеОборудование
	
	// ИнтеграцияС1СДокументооборотом
	МодулиПодсистем.Добавить(Метаданные.ОбщиеМодули.ОбновлениеИнформационнойБазыБИД.Имя);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияМДЛП
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыМДЛП");
	// Конец ИнтеграцияМДЛП
	
	// ЭлектронноеВзаимодействие
	МодулиПодсистем.Добавить(Метаданные.ОбщиеМодули.ОбновлениеИнформационнойБазыБЭД.Имя);
	// Конец ЭлектронноеВзаимодействие
	
	// ИнтеграцияРЭМД
	МодулиПодсистем.Добавить("ПодсистемаБиблиотекаИнтеграцииРЭМД");
	// Конец ИнтеграцияРЭМД
	
	// БольничнаяАптека
	МодулиПодсистем.Добавить(Метаданные.ОбщиеМодули.ОбновлениеИнформационнойБазыБольничнаяАптека.Имя);
	// Конец БольничнаяАптека
	
КонецПроцедуры

#КонецОбласти
