
// Настройки подключения для МИС qMS
//  
// Возвращаемое значение:
//  Структура - Данные подключения:
//   * АдресСервера 
//   * ИмяПользователя 
//   * Пароль  
//
Функция НастройкиПодключения() Экспорт  
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НастройкиИнтеграцииQMS.ИмяПредопределенныхДанных КАК Ключ,
		|	бит_НастройкиИнтеграцииQMS.Значение КАК Значение
		|ИЗ
		|	Справочник.бит_НастройкиИнтеграцииQMS КАК бит_НастройкиИнтеграцииQMS
		|ГДЕ
		|	бит_НастройкиИнтеграцииQMS.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Справочники.бит_НастройкиИнтеграцииQMS.НастройкиПодключения);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ключ,Выборка.Значение);		
	КонецЦикла;  

	Возврат Результат;
		
КонецФункции