#Область ОбработчикиСоыбтийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.ТекстСЭМД = Параметры.ТекстСЭМД;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ТекстСЭМД) Тогда
		Попытка
			РезультатПреобразования_ = ВизуализаторCDA.CDA2ТабличныйДокумент(
					ЭтотОбъект.ТекстСЭМД
				);
			Если РезультатПреобразования_ <> Неопределено Тогда
				ЭтотОбъект.ТабличныйПредставление.Вывести(РезультатПреобразования_);
			КонецЕсли;
		Исключение
			Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти