Функция ПолучитьКодОбъекта(Объект) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СоответствияОбъектовУчетаQMS.Код КАК Код
		|ИЗ
		|	РегистрСведений.бит_СоответствияОбъектовУчетаQMS КАК бит_СоответствияОбъектовУчетаQMS
		|ГДЕ
		|	бит_СоответствияОбъектовУчетаQMS.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Код
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции