#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКИ СОБЫТИЙ
#Область ОбработкиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КодСлужебный = "";
	Для Каждого ЧастьКода Из СтрРазделить(Код, ".") Цикл
		КодСлужебный = КодСлужебный + ?(ПустаяСтрока(КодСлужебный), "", "_") + Прав("00" + ЧастьКода, 2);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ОбработкиСобытий

#КонецЕсли
