
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

// Возвращает логин служебного пользователя для обмена с мобильным приложением.
//
Функция ЛогинПользователяОбменаСМобильнымПриложением() Экспорт
	
	Возврат "exchange.user";
	
КонецФункции

// Возвращает описание подключаемой на формы команды,
// запускающей загрузку данных из мобильного приложения.
//
Функция СвойстваКомандыЗагрузкиШтрихкодовИзМобильногоПриложения() Экспорт
	
	СвойстваКоманды = Новый Структура;
	СвойстваКоманды.Вставить("Имя"        , "ЗагрузитьШтрихкодыИзМобильногоПриложения");
	СвойстваКоманды.Вставить("Заголовок"  , НСтр("ru = 'Загрузить из мобильного приложения'"));
	СвойстваКоманды.Вставить("Подсказка"  , НСтр("ru = 'Загрузить из мобильного приложения'"));
	СвойстваКоманды.Вставить("Отображение", ОтображениеКнопки.Картинка);
	СвойстваКоманды.Вставить("Картинка"   , БиблиотекаКартинок.МобильноеПриложение);
	СвойстваКоманды.Вставить("Действие"   , "Подключаемый_ВыполнитьПереопределяемуюКоманду");
	
	Возврат СвойстваКоманды;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
