
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если СтрДлина(Имя) <= 1 Или СтрДлина(Фамилия) <= 1 Тогда
		ОбщегоНазначения.СообщитьПользователю("Необходимо указать Имя и Фамилию полностью. Ввод инициалов не допускается");
		
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

//+Чиков А.В. 04.09.2023 г.
Процедура ПередЗаписью(Отказ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пациенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.яя_Пациенты КАК Пациенты
		|ГДЕ
		|	Пациенты.Имя = &Имя
		|	И Пациенты.Фамилия = &Фамилия
		|	И Пациенты.Отчество = &Отчество
		|	И Пациенты.ДатаРождения = &ДатаРождения";
	
	Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
	Запрос.УстановитьПараметр("Имя", СокрЛП(Имя));
	Запрос.УстановитьПараметр("Отчество", СокрЛП(Отчество));
	Запрос.УстановитьПараметр("Фамилия", СокрЛП(Фамилия));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Такой пациент уже заведён в базе", , , , Отказ);
	КонецЕсли;
		
КонецПроцедуры
//-Чиков А.В.
