
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

Функция ВыполнитьHTTPЗапрос(Знач ТранспортныйМодуль, Знач ДанныеЗапроса) Экспорт
	
	Возврат ОбменССервисомМинздраваРФКлиентСервер.ВыполнитьHTTPЗапрос(ТранспортныйМодуль, ДанныеЗапроса);
	
КонецФункции

Процедура ЗаписатьОшибкуВЖурналРегистрации(Знач ТекстОшибки, Знач Событие = "", Знач Данные = Неопределено) Экспорт
	
	ОбменССервисомМинздраваРФ.ЗаписатьСобытиеВЖурналРегистрации(ТекстОшибки, Событие, Данные, УровеньЖурналаРегистрации.Ошибка);
	
КонецПроцедуры

Процедура ЗаписатьСобытиеВЖурналРегистрации(Знач Комментарий, Знач Событие = "", Знач Данные = Неопределено, Знач Уровень = Неопределено) Экспорт
	
	ОбменССервисомМинздраваРФ.ЗаписатьСобытиеВЖурналРегистрации(Комментарий, Событие, Данные, Уровень);
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс


