#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБНОВЛЕНИЕ ИНФОРМАЦИОННОЙ БАЗЫ
#Область ОбновлениеИнформационнойБазы

// Выполняет первоначальное заполнение справочника
//
Процедура СоздатьСтатусыОбъектовПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Справочник.СтатусыОбъектовДляИнвентаризации КАК СтатусыОбъектовДляИнвентаризации
	|");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		// Материальные запасы
		Статус = Справочники.СтатусыОбъектовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Ненадлежащего качества'");
		Статус.Записать();
		
		Статус = Справочники.СтатусыОбъектовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Поврежден'");
		Статус.Записать();
		
		Статус = Справочники.СтатусыОбъектовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Истек срок хранения'");
		Статус.Записать();
		
		Статус = Справочники.СтатусыОбъектовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'В запасе (для использования)'");
		Статус.Записать();
		
		Статус = Справочники.СтатусыОбъектовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'В запасе (на хранении)'");
		Статус.Записать();
		
		// Основные средства
		Статус = Справочники.СтатусыОбъектовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'В эксплуатации'");
		Статус.Записать();
		
		Статус = Справочники.СтатусыОбъектовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Требуется ремонт'");
		Статус.Записать();
		
		Статус = Справочники.СтатусыОбъектовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Находится на консервации'");
		Статус.Записать();
		
		Статус = Справочники.СтатусыОбъектовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Не соответствует требованиям эксплуатации'");
		Статус.Записать();
		
		Статус = Справочники.СтатусыОбъектовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Не введен в эксплуатацию'");
		Статус.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбновлениеИнформационнойБазы

#КонецЕсли
