//Функция ПолучитьГенераторQRкода()
//	лМакетКомпоненты=ПолучитьМакет("КомпонентаПечатиQRКода");
//	лАдрес=ПоместитьВоВременноеХранилище(лМакетКомпоненты);
//	ГенераторQRкода=Неопределено;
//	Попытка
//		Если ПодключитьВнешнююКомпоненту(лАдрес,"QR") тогда
//			ГенераторQRкода=новый("AddIn.QR.QRCodeExtension");
//		Иначе
//			Сообщить("Не удалось подключить компоненту генерации QR кода");		
//		КонецЕсли;
//	Исключение
//		Сообщить(ОписаниеОшибки());	
//	КонецПопытки;
//	Возврат ГенераторQRкода;
//КонецФункции

//Функция ПолучитьQRкод(QRСтрока, УровеньКоррекции, Размер) Экспорт
//	УстановитьОтключениеБезопасногоРежима(Истина);
//	ГенераторQRКода = ПолучитьГенераторQRкода();
//	Если ГенераторQRКода = Неопределено Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	Попытка
//		ДвоичныеДанныеКартинки = ГенераторQRКода.GenerateQRCode(QRСтрока, УровеньКоррекции, Размер);
//	Исключение
//		Сообщить(ОписаниеОшибки());
//	КонецПопытки;
//	
//	Возврат ДвоичныеДанныеКартинки;
//	
//КонецФункции