
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.Дата = ВыбратьЗаполненное(Параметры.Дата, ТекущаяДатаСеанса());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КалендарьВыбор(Элемент, ВыбраннаяДата)
	ЭтотОбъект.Закрыть(ВыбраннаяДата);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ЭтотОбъект.Закрыть(ЭтотОбъект.Дата);
КонецПроцедуры

#КонецОбласти

