#Область ПрограммныйИнтерфейс

// Проверка наличия подсистем БСП.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПараметрыИспользования() Экспорт
	
	Возврат РассылкаЭлектронныхЧеков.ПараметрыИспользования();
	
КонецФункции // ПараметрыИспользования()

// Процедура отправляет электронное сообщение на электронную почта и абонентский номер.
//
// Параметры:
//  ПараметрыЧека - Структура
//  ТекстСообщения - Строка - Текст письма или сообщения
//  ПокупательEmail - Строка - адрес электронной почты покупателя
//  ПокупательНомер - Строка - Номер телефона покупателя
//
Процедура НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер) Экспорт
	
	Если ЗначениеЗаполнено(ПокупательEmail) Тогда
		
		ПараметрыПисьма = Новый Структура;
		
		КомуСтруктура = Новый Структура("Адрес, Представление");
		КомуСтруктура.Адрес = ПокупательEmail;
		
		Кому = Новый Массив;
		Кому.Добавить(КомуСтруктура);
		
		ПараметрыПисьма.Вставить("Кому", Кому);
		Тема  = НСтр("ru = 'Пробит чек №%1'");
		Тема = СтрЗаменить(Тема, "%1", ПараметрыЧека.НомерЧекаККТ);
		
		ПараметрыПисьма.Вставить("Тема", Тема);
		ПараметрыПисьма.Вставить("Тело", ТекстСообщения);
		ПараметрыПисьма.Вставить("ИдентификаторФискальнойЗаписи", ПараметрыЧека.ИдентификаторФискальнойЗаписи);
		
		РассылкаЭлектронныхЧеков.НачатьОтправкуЭлектронногоЧека(ПокупательEmail,
													Перечисления.ТипыРассылкиЭлектронныхЧеков.ЭлектронноеПисьмо,
													ПараметрыПисьма);
		
	ИначеЕсли ЗначениеЗаполнено(ПокупательНомер) Тогда
		
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("НомерПолучателя", ПокупательНомер);
		ПараметрыПисьма.Вставить("ТекстСообщения" , ТекстСообщения);
		ПараметрыПисьма.Вставить("ИдентификаторФискальнойЗаписи", ПараметрыЧека.ИдентификаторФискальнойЗаписи);
		
		РассылкаЭлектронныхЧеков.НачатьОтправкуЭлектронногоЧека(ПокупательНомер,
													Перечисления.ТипыРассылкиЭлектронныхЧеков.СообщениеSMS,
													ПараметрыПисьма);
		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти
