// Функции этого модуля вызываются если в функцию ВизуализаторCDA.CDA2ТабличныйДокумент передана ссылка на документ, а
// не только текст СЭМД
#Область ПрограммныйИнтерфейс

// Возвращает Булево, если Ложь на печатной форме будет показана информация о том что документ еще не завершен.
// Вызывается если соответствующий параметр о готовности не был передан в CDA2ТабличныйДокумент.
Функция ОпределитьГотовностьДокумента(ДокументИнформационнойБазы) Экспорт
	Возврат Истина;
КонецФункции

// Возвращает строку содержащую СЭМД (xml) который требуется визуализировать. Вызывается если текст СЭМД не был передан в CDA2ТабличныйДокумент.
Функция ПолучитьСЭМД(ДокументИнформационнойБазы) Экспорт
	Возврат Неопределено;
КонецФункции

// Возвращает строку, содержащую СЭМД (xml), который требуется визуализировать. Вызывается, если текст СЭМД не был передан в CDA2ТабличныйДокумент.
Функция ПолучитьТелоМД(ФайлCDA) Экспорт
	Возврат Неопределено;
КонецФункции

// Возвращает Истина если документ подписан ЭЦП.
Функция ДокументИмеетЭЦП(ДокументИнформационнойБазы) Экспорт
	Возврат Ложь;
КонецФункции

// Возвращает объект Картинка с эмблемой для штампа.
Функция ПолучитьКартинкуЭмблемаОрганизацииДляШтампаЭлектроннойПодписи(ДокументИнформационнойБазы) Экспорт
	Возврат Новый Картинка;
КонецФункции

// Возвращет массив структур с полями "ДатаПодписи,Сертификат" из регистра РегистрСведений.ЭлектронныеПодписи
// (поле Сертификат - хранилище значения с двоичными данными сертификата) или иного источника для подписанного объекта.
Функция ПолучитьИнформациюОбЭЦП(ДокументИнформационнойБазы) Экспорт
	Возврат Новый Массив;
КонецФункции

// Возвращает ссылку на справочник Организации.
Функция ПолучитьОрганизациюДокумента(ДокументИнформационнойБазы) Экспорт
	Возврат Неопределено;
КонецФункции

Функция ПолучитьТабличныйДокументИзКеша(СсылкаМД, ФайлCDA, ИмпортируемыйВизуализатор, ТелоДокумента, ПолныйДокумент, ВыводитьШапку, OutМакет) Экспорт
	Возврат Неопределено;
КонецФункции

// Функция - Получить табличный документ из кеша
//
// Параметры:
//  ТабличныйДокументФайл	 - СправочникСсылка.МедицинскийДокументПрисоединенныеФайлы	 - ссылка на файл, содержащий mxl представление мед. документа.
// 
// Возвращаемое значение:
// ТабличныйДокумент	  -  табличный документ для мед. документа.
//
Функция ПрочитатьТабличныйДокументИзКеша(ТабличныйДокументФайл) Экспорт
	Возврат Неопределено;
КонецФункции

// Процедура - Записать табличный документ в кеш
//
// Параметры:
//  СсылкаМД		 - 	ДокументСсылка.МедицинскийДокумент - ссылка на медицинский документ.
//  ФайлCDA			 - 	СправочникСсылка.Файлы - ссылка на файл с CDA-документом.
//  Визуализатор	 - 	СправочникСсылка.Визуализатор - ссылка на визуализатор, которым должнен быть отображен документ.
//  ТабДок			 - 	ТабличныйДокумент - сформированный визуализатором табличный документ.
//  ПолныйДокумент	 - 	Булево - признак отображения полного или усеченного документа.
//  ВыводитьШапку	 - 	Булево - признак отображения шапки документ.
//
Процедура ЗаписатьТабличныйДокументВКеш(СсылкаМД, ФайлCDA, ИмпортируемыйВизуализатор, СтандартныйВизуализатор, ТабДок, ПолныйДокумент, ВыводитьШапку) Экспорт
КонецПроцедуры

#КонецОбласти