
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриСозданииЧтенииНаСервере();
	Иначе
		УстановитьЗаголовокФормы();
	КонецЕсли;
	
	НастроитьПараметрыКонтрагента();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если РаботаСПрочтениямиВызовСервера.УстановитьСвойствоПрочтен(Объект.Ссылка, Истина) Тогда	
			ОповеститьОПрочтении = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ВыбранныйФайл") Тогда 
		ДобавитьВложениеИзФайлаНаСервере(Параметры.ВыбранныйФайл, Параметры.АдресВХранилище); 
	КонецЕсли;
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	КонтекстныеПодсказкиБЭД.КонтекстныеПодсказки_ПриСозданииНаСервере(ЭтотОбъект, 
		Элементы.ПанельКонтекстныхНовостей, 
		Элементы.ГруппаКонтекстныхПодсказок);
	
	СформироватьКонтекст();
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект);
	
	ПриСозданииЧтенииНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОжидатьФормированияПредставленияДокумента();
	
	Если ОповеститьОПрочтении Тогда
		Оповестить("ПрочтениеОбновитьСписок", Объект.Ссылка);
	КонецЕсли;
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	КонтекстныеПодсказкиБЭДКлиент.КонтекстныеНовости_ПриОткрытии(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ЭтоНовыйДокумент") И ПараметрыЗаписи.ЭтоНовыйДокумент Тогда
		УстановитьНовыйНомерДокумента(ТекущийОбъект);
		ОписаниеСообщения = ОписаниеСообщения(ПараметрыЗаписи.ЭлементСхемыРегламента);
		ПараметрыЗаписи.Вставить("ОписаниеСообщения", ОписаниеСообщения);
		ЭлектронныеДокументыЭДО.ПередЗаписьюНовогоДокумента(ТекущийОбъект, ОписаниеСообщения)
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ЭтоНовыйДокумент") И ПараметрыЗаписи.ЭтоНовыйДокумент Тогда
		ЭлектронныеДокументыЭДО.ПриЗаписиНовогоДокумента(ТекущийОбъект,
			ПараметрыЗаписи.ОписаниеСообщения, ПараметрыЗаписи.КонтекстДиагностики, Основания.ВыгрузитьЗначения());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	Если ПараметрыЗаписи.Свойство("ЭтоНовыйДокумент") И ПараметрыЗаписи.ЭтоНовыйДокумент Тогда
		ЭлектронныеДокументыЭДО.ПослеЗаписиНовогоДокумента(ТекущийОбъект, КонтекстДиагностики);
	КонецЕсли;
	
	УстановитьЗаголовокФормы();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ОбработатьОповещение = Истина;
		
		Если Параметр = Неопределено Тогда
			ОбновитьДанныеЭлектронногоДокументаНаСервере();
			Возврат;
		КонецЕсли;
		
		ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
		
		ДанныеПроверки = ИнтерфейсДокументовЭДОКлиент.НовыеДанныеПроверкиОповещения();
		Если ЗначениеЗаполнено(ЭлементСхемы.Сообщение) Тогда
			ДанныеПроверки.Сообщение = ЭлементСхемы.Сообщение;
		Иначе
			ДанныеПроверки.Сообщение = ИнтерфейсДокументовЭДОВызовСервера.СообщениеОтправителя(Объект.Ссылка);
		КонецЕсли;
		ДанныеПроверки.ЭлектронныйДокумент = Объект.Ссылка;

		ИнтерфейсДокументовЭДОКлиент.ПриОбработкеОповещенияФормыПросмотраЭД(ДанныеПроверки, Параметр, ОбработатьОповещение);
		
		Если Не ОбработатьОповещение Тогда
			Возврат;
		КонецЕсли;

		ОбновитьДанныеЭлектронногоДокументаНаСервере();
		
	ИначеЕсли ИмяСобытия = "ЭлектронныйДокументИсходящий_ПодборДокументаУчета" И Параметр = Объект.Ссылка Тогда
		
		ОбновитьДанныеЭлектронногоДокументаНаСервере();
		
	ИначеЕсли ИмяСобытия = "ДобавлениеДокументаВПакет" Тогда
		Если Не ЗначениеЗаполнено(ИдентификаторПакета) Тогда
			ИдентификаторПакета = Источник;
		КонецЕсли;
		УстановитьТекущийДокументПакета(Параметр[0]);
		
	ИначеЕсли ИмяСобытия = "ВыборТекущегоДокументаПакета" И Источник = ИдентификаторПакета Тогда
		УстановитьТекущийДокументПакета(Параметр);
		
	ИначеЕсли ИмяСобытия = "УдалениеДокументаИзПакета" И Источник = ИдентификаторПакета Тогда
		ЗначениеКУдалению = СоставПакета.НайтиПоЗначению(Параметр);
		СоставПакета.Удалить(ЗначениеКУдалению);
		УстановитьТекущийДокументПакета(СоставПакета[0].Значение);
		
	ИначеЕсли ИмяСобытия = "Запись_файл" Тогда 	
		ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
		Если ЭлементСхемы.ПрисоединенныйФайл = Источник Тогда
			ПодготовитьПредставлениеФайлаНаСервере();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ЗакрытьФормуДлительнойОперации" Тогда
		ИнтерфейсДокументовЭДОКлиентСервер.РазблокироватьЗаблокированныеЭлементыФормы(ЭтотОбъект, ЭтотОбъект.ЗаблокированныеЭлементыФормы);
	КонецЕсли;
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	КонтекстныеПодсказкиБЭДКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОчиститьДоговорПослеВыбораОрганизации(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПриИзмененииКлючевыхРеквизитов();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Контрагент", Объект.Контрагент);
	
	Оповещение = Новый ОписаниеОповещения("ДоговорОбработкаВыбора", ЭтотОбъект);
		
	ИнтеграцияЭДОКлиент.ОткрытьФормуВыбораДоговора(ПараметрыФормы, Элемент, Оповещение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорОбработкаВыбора(ВыбранноеЗначение, Контекст = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ПриИзмененииКлючевыхРеквизитов();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	ПриИзмененииКлючевыхРеквизитов();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НомерДокументаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокументаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НадписьИмяФайлаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФайлВложения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Сертификаты = Новый Массив;
	Для каждого СтрокаТаблицы Из Подписи Цикл
		Сертификаты.Добавить(СтрокаТаблицы.Отпечаток);
	КонецЦикла;
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	
	КонтекстДиагностики.ЗаголовокОперации = НСтр("ru = 'При проверке подписей'");
	
	ПараметрыОбработкиОшибок = ОбработкаНеисправностейБЭДКлиент.НовыеПараметрыОбработкиОшибок();
	ПараметрыОбработкиОшибок.ГруппаПредупреждения = Элементы.ГруппаПредупрежденияЭлектронныеПодписи;
	ПараметрыОбработкиОшибок.Отбор.Вставить("Сертификат", Сертификаты);
	КонтекстДиагностики.ОшибкиОбработаны = Ложь;
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики, ПараметрыОбработкиОшибок);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОшибкаФормированияПредставленияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьЖурналРегистрации" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОтборЖурналаРегистрации = Новый Структура;
		ОтборЖурналаРегистрации.Вставить("Данные", "ЭлектронныеДокументыЭДО.ПредставлениеДанныхДокумента");
		ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ОтборЖурналаРегистрации, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	ИнтерфейсДокументовЭДОКлиент.ПросмотрЭлектронногоДокументаОбработкаНавигационнойСсылки(
		ЭтотОбъект, Элемент, НавигационнаяСсылка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СоставПакета_ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	РезультатОбработки = СоставПакета_ОбработкаНавигационнойСсылкиНаСервере(НавигационнаяСсылка);
	
	ПакетыДокументовЭДОКлиент.ЭлементУправленияПакета_ОбработкаНавигационнойСсылки(
		ЭтотОбъект, Элемент, НавигационнаяСсылка, СтандартнаяОбработка, РезультатОбработки);
	
	Если РаботаСПрочтениямиВызовСервера.УстановитьСвойствоПрочтен(Объект.Ссылка, Истина) Тогда	
		Оповестить("ПрочтениеОбновитьСписок", Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СоставПакета_Нажатие(Элемент, СтандартнаяОбработка)
	
	ПакетыДокументовЭДОКлиент.ЭлементУправленияПакета_Нажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСхемаРегламента

&НаКлиенте
Процедура СхемаРегламентаПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("СхемаРегламентаПослеАктивизацииСтроки",0.1,Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодписи

&НаКлиенте
Процедура ПодписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные <> Неопределено
		И Элемент.ТекущиеДанные.Сертификат <> Неопределено Тогда
		
		Если Поле = Элементы.ПодписиДоверенностьПредставление Тогда
			РезультатПроверки  = Элемент.ТекущиеДанные.РезультатПроверкиПоМЧД;
			Если ЗначениеЗаполнено(РезультатПроверки) Тогда
				Если ЗначениеЗаполнено(РезультатПроверки.Доверенность) Тогда
					ПоказатьЗначение( , РезультатПроверки.Доверенность);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Поле = Элементы.ПодписиПодписьВернаПредставление Тогда 
						
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("СвойстваПодписи", Элемент.ТекущиеДанные.СвойстваПодписи); 
			ПараметрыФормы.Вставить("СвойстваДоверенности", Элемент.ТекущиеДанные.СвойстваДоверенности); 
			ПараметрыФормы.Вставить("РезультатПроверки", Элемент.ТекущиеДанные.РезультатПроверкиПоМЧД);			
						
			ПараметрыОткрытия = ОбщегоНазначенияБЭДКлиент.НовыеПараметрыОткрытияФормы();
			
			Если Элемент.ТекущиеДанные.ЭтоПодписьПоДоверенности Тогда
				
				ПараметрыФормы.Вставить("ЭлектронныйДокумент", Объект.Ссылка);
				ПараметрыФормы.Вставить("ПредставлениеДокумента", ТабличныйДокументИнформацияОтправителя);
				ПараметрыФормы.Вставить("ПодписанныйОбъект", Элемент.ТекущиеДанные.ПодписанныйОбъект);
				ПараметрыФормы.Вставить("СообщениеЭДО", Элемент.ТекущиеДанные.СообщениеЭДО);
				
				ПараметрыОбработкиПолномочий = Новый Структура("ДанныеСтроки", Элемент.ТекущиеДанные);
				ОповещениеОПроверке = Новый ОписаниеОповещения(
					"ОбработкаРезультатаПроверки", ЭтотОбъект, ПараметрыОбработкиПолномочий);
				ПараметрыОткрытия.ОписаниеОповещенияОЗакрытии = ОповещениеОПроверке;
				
			КонецЕсли;
			
			ПараметрыОткрытия.Владелец = ЭтотОбъект;
			ПараметрыОткрытия.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			
			МашиночитаемыеДоверенностиКлиент.ОткрытьРезультатыПроверкиПодписи(ПараметрыФормы, ПараметрыОткрытия);
			
		Иначе		
			АдресДанныхСертификата = АдресДанныхСертификата(Элемент.ТекущиеДанные.НомерСтроки);
			
			Если АдресДанныхСертификата <> Неопределено Тогда
				ИнтеграцияБСПБЭДКлиент.ПоказатьСертификат(АдресДанныхСертификата);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометкаУдаления(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьПометкуУдаленияВопрос", ЭтотОбъект);
	ОбщегоНазначенияБЭДКлиент.ЗадатьВопросНаУстановкуПометкиУдаления(Объект.ПометкаУдаления, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЭлектронныйДокумент(Команда)
	
	ЗаписатьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент()
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеНаКлиенте(Отказ);
	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияЗаписиДокумента", ЭтотОбъект);
	НачатьЗаписьДокумента(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеНаКлиенте(Отказ)
	
	ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(ЭлементСхемы.АдресОписанияСообщения) 
		И Не ЗначениеЗаполнено(ЭлементСхемы.АдресФайла) 
		И Не ЗначениеЗаполнено(ЭлементСхемы.ПрисоединенныйФайл) Тогда
		ТекстОшибки = НСтр("ru = 'Необходимо приложить файл.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "КартинкаФайла");
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПанельРегламента(Команда)
	
	ОтключитьВыводСхемыРегламента = Не ОтключитьВыводСхемыРегламента;
	Элементы.ОтображатьСхемуРегламента.Пометка = Не ОтключитьВыводСхемыРегламента;
	Элементы.СхемаРегламента.Видимость = Не ОтключитьВыводСхемыРегламента;
	
	СохранитьНастройкиОтображения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложениеИзПрисоединенныхФайлов(Команда)
	
	Если Основания.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьВложениеИзФайлаОснования", ЭтотОбъект);
		РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(Основания[0].Значение, ЭтотОбъект,, ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложениеИзФайлаНаДиске(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьВложениеИзФайлаНаДискеЗавершить", ЭтотОбъект);
	ПараметрыДиалогаПомещенияФайлов = Новый ПараметрыДиалогаПомещенияФайлов;
	Если ЭтоДоговорнойДокумент(Объект.ВидДокумента) Тогда
		ПараметрыДиалогаПомещенияФайлов.Фильтр = НСтр("ru = 'Файл PDF'") + " (*.pdf)|*.pdf";
	КонецЕсли;
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ПараметрыДиалогаПомещенияФайлов, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьФайл(Команда)
	
	ОткрытьФайлВложения(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеФайла(Команда)
	
	ЗакончитьРедактированиеФайла(Новый ОписаниеОповещения);
	ПодготовитьПредставлениеФайлаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРедактированиеФайла(Команда)
	
	ОсвободитьФайл(Новый ОписаниеОповещения);
	ПодготовитьПредставлениеФайлаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьОбластьКопияВерна(Команда)
	
	ОтключитьВыводКопияВерна = Не ОтключитьВыводКопияВерна;
	Элементы.ОтображатьОбластьКопияВерна.Пометка = Не ОтключитьВыводКопияВерна;	
	
	СохранитьНастройкиОтображения();
	ОбновитьПредставлениеЭлектронногоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьДополнительнуюИнформацию(Команда)
	
	ОтключитьВыводДопДанных = Не ОтключитьВыводДопДанных;
	Элементы.ОтображатьДополнительнуюИнформацию.Пометка = Не ОтключитьВыводДопДанных;
	
	СохранитьНастройкиОтображения();
	ОбновитьПредставлениеЭлектронногоДокумента();	
		
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьБанковскиеРеквизиты(Команда)
	
	ВыводитьБанковскиеРеквизиты = Не ВыводитьБанковскиеРеквизиты;
	Элементы.ОтображатьБанковскиеРеквизиты.Пометка = ВыводитьБанковскиеРеквизиты;
	
	СохранитьНастройкиОтображения();
	ОбновитьПредставлениеЭлектронногоДокумента();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналСобытийЭДО(Команда)
	
	ЭлектронныеДокументыЭДОКлиент.ОткрытьЖурналДействийПоЭДО(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Перенаправить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстОшибки = НСтр("ru = 'Электронный документ не сформирован. Работа с ним невозможна.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ИдентификаторПакета) И СостоянияПакетаОднородно Тогда
		ЭлектронныеДокументы = ПакетыДокументовЭДОВызовСервера.ДокументыПакета(ИдентификаторПакета);
	Иначе
		ЭлектронныеДокументы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОКлиент.ПеренаправитьЭлектронныеДокументы(ЭлектронныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТранслитироватьИмяФайла(Команда)
	
	ОтключитьТранслитерацию = Не ОтключитьТранслитерацию;
	Элементы.ТранслитироватьИмяФайла.Пометка = Не ОтключитьТранслитерацию;
	Элементы.НадписьТранслитерация.Видимость = Не ОтключитьТранслитерацию;
	
	СохранитьНастройкиОтображения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСертификат(Команда)

	ТекущиеДанные =  Элементы.Подписи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		АдресДанныхСертификата = АдресДанныхСертификата(ТекущиеДанные.НомерСтроки);
	
		Если АдресДанныхСертификата <> Неопределено Тогда
			ИнтеграцияБСПБЭДКлиент.ПоказатьСертификат(АдресДанныхСертификата);
		Иначе
			ОчиститьСообщения();
			ТекстОшибки = НСтр("ru = 'Отсутствует сертификат.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	
	Иначе
		ОчиститьСообщения();
		ТекстОшибки = НСтр("ru = 'Выберите сертификат в списке установленных подписей.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодписи(Команда)
	
	СообщениеЭДО = Неопределено;
	ЭлементСхемыИнформацияПолучателя = Неопределено;
	
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
	
	Если ЭлементСхемы <> Неопределено Тогда
		СообщениеЭДО = ЭлементСхемы.Сообщение;
		ЭлементСхемыИнформацияПолучателя = ИнтерфейсДокументовЭДОКлиентСервер.НайтиЭлементСхемыИнформацияПолучателя(ЭлементСхемы);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеПроверкиПодписейДокумента", ЭтотОбъект);
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	
	Если ЗначениеЗаполнено(СообщениеЭДО) И ЭлементСхемыИнформацияПолучателя = Неопределено Тогда
		ЭлектронныеДокументыЭДОКлиент.ПроверитьПодписиСообщения(Оповещение, СообщениеЭДО, КонтекстДиагностики);
	Иначе
		ЭлектронныеДокументыЭДОКлиент.ПроверитьПодписиДокумента(Оповещение, Объект.Ссылка, КонтекстДиагностики);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПроизвольныйДокумент(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьНовыйПроизвольныйЭлектронныйДокументНаОсновании(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыУчетаЭлектронногоДокументаПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)

	Если НавигационнаяСсылка = "ПредставлениеДокументовУчетаЭлектронногоДокументаНажатие" Тогда
		СтандартнаяОбработка = Ложь;
		ПредставлениеДокументовУчетаЭлектронногоДокументаНажатие();
	ИначеЕсли НавигационнаяСсылка = "ОткрытьФормуПодбораДокументовУчетаНажатие" Тогда
		СтандартнаяОбработка = Ложь;
		ПередОткрытиемФормыПодбораОбъектовУчета();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеДокументовУчетаЭлектронногоДокументаНажатие()
		
	Если Основания.Количество() = 1 Тогда
		ПоказатьЗначение(, Основания[0].Значение);
	Иначе		
		ПередОткрытиемФормыПодбораОбъектовУчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередОткрытиемФормыПодбораОбъектовУчета()
	
	Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Описание = Новый ОписаниеОповещения("ОткрытьФормуПодбораОбъектовУчетаПослеВопроса", ЭтотОбъект);

		Текст = НСтр("ru = 'Для выполнения операции необходимо сохранить документ. Продолжить?'");
		ПоказатьВопрос(Описание, Текст, РежимДиалогаВопрос.ДаНет);
		Возврат;
	Иначе
		ОткрытьПодборОбъектовУчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораОбъектовУчетаПослеВопроса(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьДокумент();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПодборОбъектовУчета();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборОбъектовУчета()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭлектронныйДокумент", Объект.Ссылка);
	ПараметрыФормы.Вставить("ВидДокумента", Объект.ВидДокумента);
	ПараметрыФормы.Вставить("ДокументРаспознан", ЭлементСхемыИнформацияОтправителя(ЭтотОбъект).Распознан);
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьПодборОбъектовУчетаЭлектронногоДокумента(ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура НапечататьЭлектронныеДокументы(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для печати необходимо сохранить электронный документ'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыВизуализации = ИнтерфейсДокументовЭДОВызовСервера.НовыеПараметрыВизуализацииДокумента();
	ПараметрыВизуализации.ВыводитьБанковскиеРеквизиты = ВыводитьБанковскиеРеквизиты;
	ПараметрыВизуализации.ВыводитьДопДанные = Не ОтключитьВыводДопДанных;
	ПараметрыВизуализации.ВыводитьКопияВерна = Не ОтключитьВыводКопияВерна;
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьФормуПечатиЭлектронныхДокументов(Объект.Ссылка, ПараметрыВизуализации);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЭлектронныеДокументыВФорматеPDF(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для выгрузки необходимо сохранить электронный документ'"));
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	ИнтерфейсДокументовЭДОКлиент.ВыгрузитьЭлектронныеДокументыВФорматеPDF(ЭлектронныеДокументы, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЭлектронныеДокументыДляФНС(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для выгрузки необходимо сохранить электронный документ'"));
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	ИнтерфейсДокументовЭДОКлиент.ВыгрузитьЭлектронныеДокументыДляФНС(ЭлектронныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДокументооборотЦеликом(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для выгрузки необходимо сохранить электронный документ'"));
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	ИнтерфейсДокументовЭДОКлиент.ВыгрузитьДокументооборотЦеликом(ЭлектронныеДокументы, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКомментарийСостояния(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(КомментарийСостояния, ЭтотОбъект);
	
КонецПроцедуры

#Область ДействияПоЭДО

&НаКлиенте
Процедура ВыполнитьОтправкуПолучениеЭД(Элемент)
	
	Элементы.ОбновитьСостояниеЭД.Картинка = БиблиотекаКартинок.СинхронизацияДанныхДлительнаяОперация;
	
	Оповещение = Новый ОписаниеОповещения("ОтправкаПолучениеЭДЗавершение", ЭтотОбъект);
	ИнтерфейсДокументовЭДОКлиент.НачатьОтправкуПолучениеДокументов(ЭтотОбъект, Оповещение);	

КонецПроцедуры

&НаКлиенте
Процедура ПодписатьОтправить(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ЗаблокироватьЭлементФормы(ЭтотОбъект, ЗаблокированныеЭлементыФормы,
		Элементы.ПодписатьОтправить);
	ИнтерфейсДокументовЭДОКлиент.ЗаблокироватьЭлементФормы(ЭтотОбъект, ЗаблокированныеЭлементыФормы,
		Элементы.ЗаписатьДокумент);
	
	Если СтрНайти(Команда.Имя, "Документ") = 0 Тогда
		ПодключитьОбработчикОжидания("ПодписатьИОтправитьОбработка", 0.1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ПодписатьИОтправитьОбработкаДокумента", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправитьОбработка()
	
	ПакетнаяОбработка = СостоянияПакетаОднородно;
	
	Оповещение = Новый ОписаниеОповещения("ПодписатьОтправитьПослеЗаписи", ЭтотОбъект, ПакетнаяОбработка);
		
	ПроверитьЗаписьДокументаПередПодписанием(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправитьОбработкаДокумента()
	
	ПакетнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПодписатьОтправитьПослеЗаписи", ЭтотОбъект, ПакетнаяОбработка);
		
	ПроверитьЗаписьДокументаПередПодписанием(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПодписатьОтправитьПослеЗаписи(Результат, ПакетнаяОбработка) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	НаборДействий = Новый Соответствие;
	
	Если СформироватьИзвещение Тогда
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.СформироватьИзвещение"));
	КонецЕсли;
	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить"));
	
	ВыполнитьДействияПоЭДО(НаборДействий, ПакетнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура Подписать(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ЗаблокироватьЭлементФормы(ЭтотОбъект, ЗаблокированныеЭлементыФормы,
		Элементы.Подписать);
	ИнтерфейсДокументовЭДОКлиент.ЗаблокироватьЭлементФормы(ЭтотОбъект, ЗаблокированныеЭлементыФормы,
		Элементы.ЗаписатьДокумент);
	
	Если СтрНайти(Команда.Имя, "Документ") = 0 Тогда
		ПодключитьОбработчикОжидания("ПодписатьОбработка", 0.1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ПодписатьОбработкаДокумента", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПодписатьОбработка()
	
	ПакетнаяОбработка = СостоянияПакетаОднородно;
	
	Оповещение = Новый ОписаниеОповещения("ПодписатьПослеЗаписи", ЭтотОбъект, ПакетнаяОбработка);
		
	ПроверитьЗаписьДокументаПередПодписанием(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПодписатьОбработкаДокумента()
	
	ПакетнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПодписатьПослеЗаписи", ЭтотОбъект, ПакетнаяОбработка);
		
	ПроверитьЗаписьДокументаПередПодписанием(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаписьДокументаПередПодписанием(Оповещение)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		
		Отказ = Ложь;
		
		ПроверитьЗаполнениеНаКлиенте(Отказ);
		
		Если Отказ = Истина Тогда
			ИнтерфейсДокументовЭДОКлиентСервер.РазблокироватьЗаблокированныеЭлементыФормы(
				ЭтотОбъект, ЭтотОбъект.ЗаблокированныеЭлементыФормы);
			
			ВыполнитьОбработкуОповещения(Оповещение, Ложь);
			Возврат;
		КонецЕсли;
		
		НачатьЗаписьДокумента(Оповещение);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодписатьПослеЗаписи(Результат, ПакетнаяОбработка) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать"));
	
	ВыполнитьДействияПоЭДО(НаборДействий, ПакетнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКоманда(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ЗаблокироватьЭлементФормы(ЭтотОбъект, ЗаблокированныеЭлементыФормы,
		Элементы.Отправить);
	
	Если СтрНайти(Команда.Имя, "Документ") = 0 Тогда
		ПодключитьОбработчикОжидания("ОтправитьОбработка", 0.1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ОтправитьОбработкаДокумента", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОбработка()

	ПакетнаяОбработка = СостоянияПакетаОднородно;
	ОтправитьДокументДействие(ПакетнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОбработкаДокумента()
	
	ПакетнаяОбработка = Ложь;
	ОтправитьДокументДействие(ПакетнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьДокументДействие(ПакетнаяОбработка)
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить"));
	
	ВыполнитьДействияПоЭДО(НаборДействий, ПакетнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьАннулирование(Команда)
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПринятьАннулирование"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить"));
	ПакетнаяОбработка = СостоянияПакетаОднородно И СтрНайти(Команда.Имя, "Документ") = 0;
	ВыполнитьДействияПоЭДО(НаборДействий, ПакетнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьПодписание(Команда)
	
	ПакетнаяОбработка = СостоянияПакетаОднородно И СтрНайти(Команда.Имя, "Документ") = 0;
	
	ДополнительныеПараметры = Новый Структура;
	Если ПакетнаяОбработка И ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторПакета));	
	Иначе
		ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
	КонецЕсли;
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтклонитьПодписание"));
	
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));
	
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.ОтклонитьПодписание"));
				
	Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки", ИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);
	
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причину отклонения документа'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Отклонить'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для отказа от подписания документа необходимо указать причину.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьАннулирование(Команда)
	
	ПакетнаяОбработка = СостоянияПакетаОднородно И СтрНайти(Команда.Имя, "Документ") = 0;
	
	ДополнительныеПараметры = Новый Структура;
	Если ПакетнаяОбработка И ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторПакета));	
	Иначе
		ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
	КонецЕсли;	
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтклонитьАннулирование"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить"));
	
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));
			
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.ОтклонитьАннулирование"));
				
	Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки", ИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);
	
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причины отклонения предложения об аннулировании'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Отклонить аннулирование'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для отклонения предложения об аннулировании документа необходимо указать причину.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	ПакетнаяОбработка = СостоянияПакетаОднородно И СтрНайти(Команда.Имя, "Документ") = 0;
	
	ОбъектыДействий = ЭлектронныеДокументыЭДОКлиентСервер.НовыеОбъектыДействийПоЭДО();
	Если ПакетнаяОбработка И ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ОбъектыДействий.ПакетыДокументов.Добавить(ИдентификаторПакета);
	Иначе
		ОбъектыДействий.ЭлектронныеДокументы.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, Новый Соответствие);
	ИнтерфейсДокументовЭДОКлиент.ОтклонитьОбъекты(ОбъектыДействий, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура Аннулировать(Команда)
	
	ПакетнаяОбработка = СостоянияПакетаОднородно И СтрНайти(Команда.Имя, "Документ") = 0;
	
	ДополнительныеПараметры = Новый Структура;
	Если ПакетнаяОбработка И ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторПакета));	
	Иначе
		ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
	КонецЕсли;
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Аннулировать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить"));
	
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));
		
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.Аннулировать"));	
	Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки", ИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);
	
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причины аннулирования документа'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Аннулировать'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для аннулирования документа необходимо указать причину.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
		
	ПакетнаяОбработка = СостоянияПакетаОднородно И СтрНайти(Команда.Имя, "Документ") = 0;
	
	ДополнительныеПараметры = Новый Структура;
	Если ПакетнаяОбработка И ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ДополнительныеПараметры.Вставить("ПакетыДокументов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторПакета));	
	Иначе
		ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
	КонецЕсли;
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ЗакрытьПринудительно"));
	
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));	
	
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);
	ДополнительныеПараметры.Вставить("ОсновноеДействие", ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.ЗакрытьПринудительно"));
				
	Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки", ИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);
	
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причины принудительного закрытия документа'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Закрыть принудительно'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для принудительного закрытия документа необходимо указать причину.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВАрхив(Команда)
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтправитьВАрхив"));
		
	ПакетнаяОбработка = СостоянияПакетаОднородно И СтрНайти(Команда.Имя, "Документ") = 0;
	ВыполнитьДействияПоЭДО(НаборДействий, ПакетнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьВРаботу(Команда)
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ВернутьВРаботу"));
	
	ПакетнаяОбработка = СостоянияПакетаОднородно И СтрНайти(Команда.Имя, "Документ") = 0;
	ВыполнитьДействияПоЭДО(НаборДействий, ПакетнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Переформировать(Команда)
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
	ПараметрыПереформирования = ИнтерфейсДокументовЭДОВызовСервера.ПараметрыПереформированияДокумента(ЭлементСхемы.Сообщение);
	ПараметрыПереформирования.Вставить("ИдентификаторПакета", ИдентификаторПакета);
	ПараметрыПереформирования.Вставить("ОбъектУчета", Основания[0].Значение);

	Оповещение = Новый ОписаниеОповещения("ПереформированиеЗавершениеФормированияЭлектронногоДокумента", ЭтотОбъект, ПараметрыПереформирования);
	ИнтерфейсДокументовЭДОКлиент.ПереформироватьДокумент(Оповещение, ПараметрыПереформирования);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПовторно(Команда)
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ОтправитьПовторно"));
		
	ПакетнаяОбработка = СостоянияПакетаОднородно И СтрНайти(Команда.Имя, "Документ") = 0;
	ВыполнитьДействияПоЭДО(НаборДействий, ПакетнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонтейнерДокумента(Команда)
	
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
	
	Если ЗначениеЗаполнено(ЭлементСхемы.Сообщение)
		И СостояниеЭДО <> ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписание")
		И СостояниеЭДО <> ПредопределенноеЗначение("Перечисление.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправке") Тогда
		СинхронизацияЭДОКлиент.ОткрытьТранспортныйКонтейнерСообщения(ЭлементСхемы.Сообщение);
	Иначе
		Сообщение = НСтр("ru='Нет данных для открытия транспортного контейнера электронного документа.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуЭлектронногоДокумента(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстВопроса = НСтр("ru = 'Открытие карточки возможно только после записи документа.
									|Записать документ?'");
		Оповещение = Новый ОписаниеОповещения("ОткрытьКарточкуПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

	Иначе
		ИнтерфейсДокументовЭДОКлиент.ОткрытьКарточкуЭлектронногоДокумента(Объект.Ссылка);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуПослеВопроса(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаписатьДокумент();
		ИнтерфейсДокументовЭДОКлиент.ОткрытьКарточкуЭлектронногоДокумента(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЭтоДоговорнойДокумент(ВидДокумента)
	
	Если ВидДокумента.ТипДокумента = Перечисления.ТипыДокументовЭДО.ДоговорнойДокумент Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаРезультатаПроверки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбновитьСтраницуПодписей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПометкуУдаленияВопрос(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено
		Или Ответ.Значение <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьПометкуУдаления();
	
	Оповестить(ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияТекущихДелЭДО(), , ВладелецФормы);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПометкуУдаления()
	
	Объект.ПометкаУдаления = Не Объект.ПометкаУдаления;
	Записать();
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтображения()
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(ИмяФормы, 
		"ОтключитьВыводДопДанных", ОтключитьВыводДопДанных);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(ИмяФормы, 
		"ОтключитьВыводКопияВерна", ОтключитьВыводКопияВерна);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(ИмяФормы, 
		"ВыводитьБанковскиеРеквизиты", ВыводитьБанковскиеРеквизиты);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(ИмяФормы, 
		"ОтключитьВыводСхемыРегламента", ОтключитьВыводСхемыРегламента);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(ИмяФормы, 
		"ОтключитьТранслитерацию", ОтключитьТранслитерацию);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиОтображения()
	
	ОтключитьВыводДопДанных = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, 
		"ОтключитьВыводДопДанных", Истина);	
	ОтключитьВыводКопияВерна = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, 
		"ОтключитьВыводКопияВерна", Истина);	
	ВыводитьБанковскиеРеквизиты = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, 
		"ВыводитьБанковскиеРеквизиты", Ложь);	
	ОтключитьВыводСхемыРегламента = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, 
		"ОтключитьВыводСхемыРегламента", Ложь);
	ОтключитьТранслитерацию = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, 
		"ОтключитьТранслитерацию", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодписиПодписьВернаПредставление.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подписи.ПодписьВерна");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СхемаРегламента.Имя);
	
	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СхемаРегламента.Ссылка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СхемаРегламента.Доступность");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СхемаРегламентаСтатус.Имя);
	
	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СхемаРегламента.Направление");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.НаправленияЭДО.Исходящий;
	
	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СхемаРегламента.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыСообщенийЭДО.Отправлен;
	
	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СхемаРегламента.Направление");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.НаправленияЭДО.Входящий;
	
	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СхемаРегламента.ТипЭлементаРегламента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
	
	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СхемаРегламента.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыСообщенийЭДО.Утвержден;
	
	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СхемаРегламента.Направление");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.НаправленияЭДО.Входящий;
	
	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СхемаРегламента.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыСообщенийЭДО.Получен;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Green);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СхемаРегламентаНаименование.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СхемаРегламентаСтатус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СхемаРегламента.ТипЭлементаРегламента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СхемаРегламента.Доступность");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ЖирныйШрифтБЭД,,,
		Истина, Ложь, Ложь, Ложь, ));
			
	МаршрутыПодписанияБЭД.УстановитьУсловноеОформлениеДереваМаршрута(ЭтотОбъект, "СхемаМаршрутаПодписания");	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ИспользуетсяНесколькоОрганизаций = ИнтеграцияЭДО.ИспользуетсяНесколькоОрганизаций();
		Если ИспользуетсяНесколькоОрганизаций Тогда
			Объект.Организация = ИнтеграцияЭДО.ОрганизацияПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ЕстьПравоВыполненияОбмена = СинхронизацияЭДО.ЕстьПравоВыполненияОбмена();
	
	ИспользуетсяОтложеннаяОтправка = НастройкиЭДО.ОтложеннаяОтправкаЭлектронныхДокументов();
	
	ЗаполнитьДанныеЭлектронногоДокумента();
	
	ПолучитьДанныеПакета();
	
	СформироватьПанельСоставаПакета();
	
	Если Параметры.Свойство("Сообщение") Тогда
		УстановитьИдентификаторТекущегоЭлемента(СхемаРегламента, Параметры.Сообщение);
	Иначе
		ИдентификаторТекущегоЭлемента = СхемаРегламента.ПолучитьЭлементы()[0].ПолучитьИдентификатор();
	КонецЕсли;
	
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
	
	РаспознатьДокумент(ЭлементСхемы);
	
	ЗаполнитьПодписи(ЭлементСхемы);
	
	НастроитьОформлениеФормы(ЭлементСхемы);
	
	УстановитьВидимостьДоверенности();
	
	УстановитьЗаголовокФормы();
	
	СформироватьПредупреждения();
	
	ВывестиПредставлениеДокументовУчета();
	
	ОбновитьОтображениеМаршрутаПодписания();
	
	ЗаполнитьТекстСопроводительнойЗаписки(ЭлементСхемы);
	
	УстановитьСвязиПараметровВыбораДоговорКонтрагента();
	
	ПоказатьПредставлениеДокумента(ЭлементСхемы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеЭлектронногоДокумента()
	
	НастройкиФормирования = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьДанныеТекущегоЭлектронногоДокумента();
	ИначеЕсли Параметры.Свойство("РезультатПодготовкиДанных")
		И Параметры.Свойство("НастройкиФормирования", НастройкиФормирования) Тогда
		
		Если НастройкиФормирования.Направление = Перечисления.НаправленияЭДО.Внутренний Тогда
			ЗаполнитьДанныеПредварительногоВнутреннегоДокумента(НастройкиФормирования.НастройкиВнутреннегоЭДО,
				Параметры.РезультатПодготовкиДанных);
		Иначе
			ЗаполнитьДанныеПредварительногоЭлектронногоДокумента(НастройкиФормирования.НастройкиОтправки,
				Параметры.РезультатПодготовкиДанных);
		КонецЕсли;
	Иначе
		Основание = Неопределено;
		ВидДокумента = Неопределено;
		Параметры.Свойство("Основание", Основание);
		Параметры.Свойство("ВидДокумента", ВидДокумента);
		Основание = Метаданные.ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО.Тип.ПривестиЗначение(Основание); 
		ЗаполнитьДанныеНовогоЭлектронногоДокумента(Основание, ВидДокумента);
		
		Если Параметры.Свойство("ТабличныйДокумент") Тогда
			НаименованиеФайла= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				Параметры, "НаименованиеФайла", Неопределено);
			
			ДобавитьВложениеИзТабличногоДокумента(Параметры.ТабличныйДокумент, НаименованиеФайла);
			
		КонецЕсли;
		
		Если Параметры.Свойство("ДвоичныеДанныеФайла") 
			 И Параметры.Свойство("НаименованиеФайла") 
			 И Параметры.Свойство("Расширение") Тогда
			
			ДобавитьВложениеИзДвоичныхДанных(Параметры.ДвоичныеДанныеФайла, 
				Параметры.НаименованиеФайла, Параметры.Расширение);
				
		КонецЕсли;
		
		Если Параметры.Свойство("АдресФайла") Тогда
			
			ДанныеФайла = ПолучитьИзВременногоХранилища(Параметры.АдресФайла);
			 
			ДобавитьВложениеИзДвоичныхДанных(ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла), 
				ДанныеФайла.Наименование, ДанныеФайла.Расширение);
				
		КонецЕсли;
		
		Если Параметры.Свойство("АдресОписанияФайла") Тогда
			
			ОписаниеФайла = ПолучитьИзВременногоХранилища(Параметры.АдресОписанияФайла); // См. РаботаСФайламиБЭДКлиентСервер.НовоеОписаниеФайла
			УдалитьИзВременногоХранилища(Параметры.АдресОписанияФайла);
			
			СтруктураФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ОписаниеФайла.ИмяФайла);
			РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(СтруктураФайла.Расширение);
			ДобавитьВложениеИзДвоичныхДанных(ОписаниеФайла.ДвоичныеДанные, СтруктураФайла.ИмяБезРасширения,
				РасширениеБезТочки);
			ЗаполнитьОбъектПоСодержаниюФайла(ОписаниеФайла);
			
		КонецЕсли;
		
	КонецЕсли;	
	
	ИнтерфейсДокументовЭДО.СоздатьРеквизитыИЭлементыДляПредставленияДокумента(
		ЭтотОбъект, ЭлементСхемыИнформацияОтправителя(ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПакета()
	
	КоличествоОтображаемыхДокументовПакета = 3;
	
	СоставПакета.ЗагрузитьЗначения(ПакетыДокументовЭДО.ДокументыПакета(ИдентификаторПакета));
	
	СостоянияДокументовПоЭДО = ПакетыДокументовЭДО.СостоянияДокументовПакета(ИдентификаторПакета);
	СостояниеПакета = ПакетыДокументовЭДО.СостояниеПакета(СостоянияДокументовПоЭДО);
	СостоянияПакетаОднородно = ЗначениеЗаполнено(СостояниеПакета);
	
	ДоступноИзменениеПакета = Истина;
	
	Если ЗначениеЗаполнено(СостоянияДокументовПоЭДО) Тогда
		ДоступноИзменениеПакета = ПакетыДокументовЭДО.ДоступноИзменениеПакета(СостоянияДокументовПоЭДО);
	Иначе
		СостоянияДокументовПоЭДО = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СостояниеЭДО);
		ДоступноИзменениеПакета = ПакетыДокументовЭДО.ДоступноИзменениеПакета(СостоянияДокументовПоЭДО);
	КонецЕсли;
	
	ТребуетсяОднородностьОтвета = СинхронизацияЭДО.ТребуетсяОднородностьОтвета(Объект.ИдентификаторКонтрагента);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПанельСоставаПакета()

	ПакетыДокументовЭДО.СформироватьПанельСоставаПакета(ЭтотОбъект, Элементы.ГруппаСоставПакета,
		КоличествоОтображаемыхДокументовПакета, Перечисления.НаправленияЭДО.Исходящий);

	ПакетыДокументовЭДО.ЗаполнитьПанельСоставаПакета(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТекущегоЭлектронногоДокумента()

	ДанныеЭлектронногоДокумента = ИнтерфейсДокументовЭДО.ДанныеФормыПросмотраЭлектронногоДокумента(Объект.Ссылка, Ложь);
	
	ВыборкаСостоянияЭДО = ДанныеЭлектронногоДокумента.ВыборкаСостоянияЭДО;
	Если ВыборкаСостоянияЭДО.Следующий() Тогда
		СостояниеЭДО = ВыборкаСостоянияЭДО.Состояние;
	КонецЕсли;
	
	Основания = Новый СписокЗначений;
	ВыборкаОбъектовУчета = ДанныеЭлектронногоДокумента.ВыборкаОбъектовУчета;
	Пока ВыборкаОбъектовУчета.Следующий() Цикл
		ОбъектУчета = ВыборкаОбъектовУчета.ОбъектУчета;
		Основания.Добавить(ОбъектУчета);
	КонецЦикла;
	
	Если СхемаРегламента.ПолучитьЭлементы().Количество() Тогда
		СхемаРегламента.ПолучитьЭлементы().Очистить();
	КонецЕсли;
	
	НастройкиСхемыРегламента = НастройкиСхемыРегламента();
	ИнтерфейсДокументовЭДО.ЗаполнитьСхемуРегламента(НастройкиСхемыРегламента,
		ДанныеЭлектронногоДокумента.ДанныеЭлементовСхемы, СхемаРегламента);
	
	Если Параметры.Свойство("ЭлектронныйДокумент") Тогда
		ИдентификаторТекущегоЭлемента = ИнтерфейсДокументовЭДО.ИдентификаторЭлементаСхемыРегламента(
			СхемаРегламента, Параметры.ЭлектронныйДокумент);
	КонецЕсли;
	
	ИдентификаторТекущегоЭлемента = СхемаРегламента.ПолучитьЭлементы()[0].ПолучитьИдентификатор();
		
	ИдентификаторПакета = ПакетыДокументовЭДО.ИдентификаторПакетаДокумента(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПредварительногоЭлектронногоДокумента(НастройкиОтправки, РезультатПодготовкиДанных)
	
	ОписаниеСообщения = ПолучитьИзВременногоХранилища(РезультатПодготовкиДанных.АдресОписанияСообщения);
	ДанныеСообщения = ОписаниеСообщения.Данные;
	СодержаниеСообщения = ДанныеСообщения.Содержание;
	
	Если ЭлектронныеДокументыЭДО.ПрикладныеВидыДокументов().Найти(НастройкиОтправки.ВидДокумента) <> Неопределено Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной;
		Объект.ВидДокумента = НастройкиОтправки.ВидДокумента;
	Иначе
		ТипДокумента = НастройкиОтправки.ВидДокумента.ТипДокумента;
		Объект.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(НастройкиОтправки.ВидДокумента.ТипДокумента);
	КонецЕсли;
	
	Объект.ИдентификаторДокументооборота = ЭлектронныеДокументыЭДО.НовыйИдентификаторДокументооборота();
	
	Если ЗначениеЗаполнено(СодержаниеСообщения) Тогда
		Объект.НомерДокумента = СодержаниеСообщения.НомерДокумента;
		Объект.ДатаДокумента = СодержаниеСообщения.ДатаДокумента;
		Объект.СуммаДокумента = СодержаниеСообщения.СуммаДокумента;
		Объект.ТипРегламента = СодержаниеСообщения.ТипРегламента;
	Иначе
		Объект.ТипРегламента = Перечисления.ТипыРегламентовЭДО.Неформализованный;
	КонецЕсли;
	
	Объект.ИдентификаторОрганизации = НастройкиОтправки.ИдентификаторОтправителя;
	Объект.ИдентификаторКонтрагента = НастройкиОтправки.ИдентификаторПолучателя;
	Объект.Организация = НастройкиОтправки.Отправитель;
	Объект.Контрагент  = НастройкиОтправки.Получатель;
	Объект.ДоговорКонтрагента = НастройкиОтправки.Договор;
	Объект.СпособОбмена = НастройкиОтправки.СпособОбмена;
	Объект.ОбменБезПодписи = НастройкиОтправки.ОбменБезПодписи;
	Объект.ТребуетсяИзвещение = НастройкиОтправки.ТребуетсяИзвещениеОПолучении;
	Объект.ТребуетсяПодтверждение = НастройкиОтправки.ТребуетсяОтветнаяПодпись;
	Объект.ВыгружатьДополнительныеСведения = НастройкиОтправки.ВыгружатьДополнительныеСведения;
	Объект.МаршрутПодписания = НастройкиОтправки.МаршрутПодписания;
	Объект.ВидПодписи = Перечисления.ВидыЭлектронныхПодписей.УсиленнаяКвалифицированная;
	Объект.ФорматОсновногоТитула = НастройкиОтправки.Формат;
	
	МаршрутРедактируетсяПриСоздании = НастройкиОтправки.МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутУказыватьПриСоздании();
	
	Если ЗначениеЗаполнено(РезультатПодготовкиДанных.СвязующийОбъектУчета) Тогда
		Объект.ИдентификаторСвязи = Строка(РезультатПодготовкиДанных.СвязующийОбъектУчета.УникальныйИдентификатор());
	КонецЕсли;
	
	Если Объект.МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутУказыватьПриСоздании() Тогда
		Объект.МаршрутПодписания = Неопределено;
	КонецЕсли;
	
	СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.НеСформирован;
	
	Основания.ЗагрузитьЗначения(РезультатПодготовкиДанных.Основания);
	ЭлектронныеДокументыЭДО.ЗагрузитьИдентификаторыСвязанныхОбъектовУчета(Объект,
		РезультатПодготовкиДанных.СвязанныеОбъектыУчета);
	
	НастройкиСхемыРегламента = НастройкиСхемыРегламента();
	ДанныеЭлементовСхемы = ИнтерфейсДокументовЭДО.НовыеДанныеЭлементовСхемы();
	ЗаполнитьДанныеЭлементаСхемыИнформацияОтправителя(ДанныеЭлементовСхемы, ТипДокумента,
		РезультатПодготовкиДанных.АдресОписанияСообщения);
	
	ИнтерфейсДокументовЭДО.ЗаполнитьСхемуРегламента(
		НастройкиСхемыРегламента, ДанныеЭлементовСхемы, СхемаРегламента);
	
	ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
	ЭлементСхемы.РаспознаниеВыполнено = Истина;
	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.ДоговорнойДокумент Тогда
		ЭлементСхемы.Распознан = Ложь;
		ДанныеДокумента = ДанныеСообщения.Документ;
		
		Если ДанныеДокумента.Свойство("ДвоичныеДанные") И ДанныеДокумента.Свойство("ИмяФайла") Тогда
			
			Расширение = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ДанныеДокумента.ИмяФайла);
			ДлинаРасширенияСТочкой = СтрДлина(Расширение) + 1;
			ИмяФайлаБезРасширения =
				Лев(ДанныеДокумента.ИмяФайла, СтрДлина(ДанныеДокумента.ИмяФайла) - ДлинаРасширенияСТочкой);
			
			ДобавитьВложениеИзДвоичныхДанных(ДанныеДокумента.ДвоичныеДанные, ИмяФайлаБезРасширения, Расширение);
			
		КонецЕсли;
		
	Иначе
		ЭлементСхемы.Распознан = Истина;
	КонецЕсли;
	ЭлементСхемы.ФормированиеПоОбъектуУчета = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПредварительногоВнутреннегоДокумента(НастройкиВнутреннегоЭДО, РезультатПодготовкиДанных)
	
	ОписаниеСообщения = ПолучитьИзВременногоХранилища(РезультатПодготовкиДанных.АдресОписанияСообщения);
	СодержаниеСообщения = ОписаниеСообщения.Данные.Содержание;
	
	Объект.ВидДокумента = НастройкиВнутреннегоЭДО.ВидДокумента;
	
	Объект.ИдентификаторДокументооборота = ЭлектронныеДокументыЭДО.НовыйИдентификаторДокументооборота();
	
	Объект.НомерДокумента = СодержаниеСообщения.НомерДокумента;
	Объект.ДатаДокумента = СодержаниеСообщения.ДатаДокумента;
	
	Объект.Организация = НастройкиВнутреннегоЭДО.Организация;
	Объект.ОбменБезПодписи = Ложь;
	Объект.ТипРегламента = СодержаниеСообщения.ТипРегламента;
	Объект.ТребуетсяИзвещение = Ложь;
	Объект.ТребуетсяПодтверждение = Ложь;
	Объект.ВыгружатьДополнительныеСведения = Ложь;
	Объект.МаршрутПодписания = НастройкиВнутреннегоЭДО.МаршрутПодписания;
	
	МаршрутРедактируетсяПриСоздании = НастройкиВнутреннегоЭДО.МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутУказыватьПриСоздании();
	
	Если Объект.МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутУказыватьПриСоздании() Тогда
		Объект.МаршрутПодписания = Неопределено;
	КонецЕсли;
	
	Объект.ВидПодписи = НастройкиВнутреннегоЭДО.ВидПодписи;
	Объект.СпособОбмена = Перечисления.СпособыОбменаЭД.Внутренний;
	
	СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.НеСформирован;
	
	Основания.ЗагрузитьЗначения(РезультатПодготовкиДанных.Основания);
	
	НастройкиСхемыРегламента = НастройкиСхемыРегламента();
	ДанныеЭлементовСхемы = ИнтерфейсДокументовЭДО.НовыеДанныеЭлементовСхемы();
	ЗаполнитьДанныеЭлементаСхемыИнформацияОтправителя(ДанныеЭлементовСхемы, Перечисления.ТипыДокументовЭДО.Внутренний,
		РезультатПодготовкиДанных.АдресОписанияСообщения);
	
	ИнтерфейсДокументовЭДО.ЗаполнитьСхемуРегламента(
		НастройкиСхемыРегламента, ДанныеЭлементовСхемы, СхемаРегламента);
	
	ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
	ЭлементСхемы.РаспознаниеВыполнено = Истина;
	ЭлементСхемы.Распознан = Истина;
	ЭлементСхемы.ФормированиеПоОбъектуУчета = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНовогоЭлектронногоДокумента(Основание, ВидДокумента)
	
	ТипДокумента = Перечисления.ТипыДокументовЭДО.Прочее;
	
	Если ЗначениеЗаполнено(Основание) Тогда
		Основания.Добавить(Основание);
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО")
			Или ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО") Тогда
			СвойстваДокумента = ЭлектронныеДокументыЭДО.СвойстваДокумента(Основание, "Организация, Контрагент, ДоговорКонтрагента");
			Объект.Организация = СвойстваДокумента.Организация;
			Объект.Контрагент = СвойстваДокумента.Контрагент;
			Объект.ДоговорКонтрагента = СвойстваДокумента.ДоговорКонтрагента;
		Иначе
			РеквизитыОснования = ИнтеграцияЭДО.ОписаниеОснованияЭлектронногоДокумента(Основание);
			Объект.Организация = РеквизитыОснования.Организация;
			Объект.Контрагент = РеквизитыОснования.Контрагент;
			Объект.НомерДокумента = РеквизитыОснования.Номер;
			Объект.ДатаДокумента = РеквизитыОснования.Дата;
			Объект.СуммаДокумента = РеквизитыОснования.СуммаДокумента;
			
			ОписаниеОбъектаУчета = ЭлектронныеДокументыЭДО.ОписаниеОбъектаУчета(Основание, ВидДокумента);
			ЗаполнитьПоОписаниюОбъектаУчета(ОписаниеОбъектаУчета, ТипДокумента);
		КонецЕсли;
		
	Иначе
		ЗаполнитьЗначенияПоУмолчанию();
	КонецЕсли;
	
	Если ЭлектронныеДокументыЭДО.ТипыДокументовПроизвольногоФормата().Найти(ТипДокумента) = Неопределено Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.Прочее;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
		Объект.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ТипДокумента);
	КонецЕсли;
	
	ПриИзмененииКлючевыхРеквизитов();
	
	Объект.ИдентификаторДокументооборота = ЭлектронныеДокументыЭДО.НовыйИдентификаторДокументооборота();
	
	Если ТипДокумента <> Перечисления.ТипыДокументовЭДО.МашиночитаемаяДоверенность Тогда
		СвязанныеОбъектыУчета = Новый Массив;
		Для Каждого ЭлементСпискаОснований Из Основания Цикл
			СвязанныеОбъектыУчета.Добавить(ЭлементСпискаОснований.Значение);
		КонецЦикла;
		ЭлектронныеДокументыЭДО.ЗагрузитьИдентификаторыСвязанныхОбъектовУчета(Объект, СвязанныеОбъектыУчета);
	КонецЕсли;
	
	Объект.ТипРегламента = Перечисления.ТипыРегламентовЭДО.Неформализованный;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаДокумента) Тогда
		Объект.ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.НеСформирован;
	
	НастройкиСхемыРегламента = НастройкиСхемыРегламента();
	ДанныеЭлементовСхемы = ИнтерфейсДокументовЭДО.НовыеДанныеЭлементовСхемы();
	ЗаполнитьДанныеЭлементаСхемыИнформацияОтправителя(ДанныеЭлементовСхемы, ТипДокумента);
	
	ИнтерфейсДокументовЭДО.ЗаполнитьСхемуРегламента(
		НастройкиСхемыРегламента, ДанныеЭлементовСхемы, СхемаРегламента);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОписаниюОбъектаУчета(ОписаниеОбъектаУчета, ТипДокумента)
	
	КоличествоДокументовЭДО = ОписаниеОбъектаУчета.Количество();
	
	Если КоличествоДокументовЭДО = 0 Тогда
		Возврат;
	ИначеЕсли КоличествоДокументовЭДО = 1 Тогда
		ОписаниеДокументаЭДО = ОписаниеОбъектаУчета[0];
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = ОписаниеДокументаЭДО.Организация;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Объект.Контрагент = ОписаниеДокументаЭДО.Контрагент;
		КонецЕсли;
		Объект.ДоговорКонтрагента = ОписаниеДокументаЭДО.Договор;
		ТипДокумента = ОписаниеДокументаЭДО.ТипДокумента;
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Организация", Объект.Организация);
	СтруктураПоиска.Вставить("Контрагент", Объект.Контрагент);
	НайденныеСтроки = ОписаниеОбъектаУчета.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() Тогда
		ДоговорыКонтрагентов = Новый Массив;
		Для каждого СтрокаОписания Из НайденныеСтроки Цикл
			ДоговорыКонтрагентов.Добавить(СтрокаОписания.Договор);
		КонецЦикла;
		ДоговорыКонтрагентов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДоговорыКонтрагентов);
		Если ДоговорыКонтрагентов.Количество() = 1 Тогда
			Объект.ДоговорКонтрагента = ДоговорыКонтрагентов[0];
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектПоСодержаниюФайла(ОписаниеФайла);
	
	Содержание = ФорматыЭДО.ПрочитатьСодержаниеДокумента(ОписаниеФайла);
	Если Не ЗначениеЗаполнено(Содержание) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НомерДокумента = Содержание.НомерДокумента;
	Объект.ДатаДокумента = Содержание.ДатаДокумента;
	Объект.СуммаДокумента = Содержание.СуммаДокумента;
	
КонецПроцедуры

&НаСервере
Функция НастройкиСхемыРегламента()
	
	НастройкиСхемы = РегламентыЭДО.НовыеНастройкиСхемыРегламента();
	НастройкиСхемы.ТипРегламента = Объект.ТипРегламента;
	НастройкиСхемы.СпособОбмена = Объект.СпособОбмена;
	НастройкиСхемы.ТребуетсяИзвещение = Объект.ТребуетсяИзвещение;
	НастройкиСхемы.ТребуетсяПодтверждение = Объект.ТребуетсяПодтверждение;

	Возврат НастройкиСхемы;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеЭлементаСхемыИнформацияОтправителя(ДанныеЭлементовСхемы, ТипДокумента, АдресОписанияСообщения="")
	
	ДанныеЭлемента = ДанныеЭлементовСхемы.Добавить();
	ДанныеЭлемента.ВидДокумента = Объект.ВидДокумента;
	ДанныеЭлемента.ТипДокумента = ТипДокумента;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСГИСЭПД") Тогда
		МодульОбменСГИСЭПД = ОбщегоНазначения.ОбщийМодуль("ОбменСГИСЭПД");
		Если МодульОбменСГИСЭПД.ЭтоДокументЭПД(ТипДокумента) Тогда
			ДанныеЭлемента.ТипЭлементаРегламента = МодульОбменСГИСЭПД.ПервыйТитулДокумента(ТипДокумента);
			ДанныеЭлемента.Наименование = МодульОбменСГИСЭПД.ПредставлениеИнформацииОтправителя(
				ТипДокумента, Объект.НомерДокумента, Объект.ДатаДокумента);	
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеЭлемента.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
	
	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.Внутренний Тогда
		ДанныеЭлемента.Направление = Перечисления.НаправленияЭДО.Внутренний;
	ИначеЕсли ЭлектронныеДокументыЭДО.ЭтоТипДокументаИнтеркампани(ТипДокумента) Тогда
		ДанныеЭлемента.Направление = Перечисления.НаправленияЭДО.Интеркампани;
	Иначе
		ДанныеЭлемента.Направление = Перечисления.НаправленияЭДО.Исходящий;
	КонецЕсли;
	
	ДанныеЭлемента.Статус = Перечисления.СтатусыСообщенийЭДО.НеСформирован;
	ДанныеЭлемента.АдресОписанияСообщения = АдресОписанияСообщения;
	
	ДанныеЭлемента.Наименование = ИнтерфейсДокументовЭДО.ПредставлениеИнформацииОтправителя(
		Объект.НомерДокумента, Объект.ДатаДокумента);
	
КонецПроцедуры

&НаСервере
Процедура РаспознатьДокумент(ЭлементСхемы)
	
	Если Объект.ПометкаУдаления Тогда
		Возврат;	
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеАктированиеЕИСПолучениеВходящих");
		МодульПодсистемы.ПриРаспознанииДокумента(ЭлементСхемы.ВидСообщения, ЭлементСхемы);
		Если ЭлементСхемы.Распознан = Истина Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСГИСЭПД") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("ОбменСГИСЭПД");
		МодульПодсистемы.ПриРаспознанииДокумента(ЭлементСхемы.ВидСообщения, ЭлементСхемы);
		Если ЭлементСхемы.Распознан = Истина Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭлементСхемы.РаспознаниеВыполнено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭлементСхемы.ТипДокумента = Перечисления.ТипыДокументовЭДО.ДоговорнойДокумент Тогда
		ЭлементСхемы.РаспознаниеВыполнено = Истина;
		ЭлементСхемы.Распознан = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементСхемы.Сообщение) Тогда 
		РезультатРаспознания = ЭлектронныеДокументыЭДО.РаспознатьСообщение(ЭлементСхемы.Сообщение);
	Иначе
		Возврат;
	КонецЕсли;
	
	ЭлементСхемы.РаспознаниеВыполнено = Истина;
	ЭлементСхемы.Распознан = ЗначениеЗаполнено(РезультатРаспознания);
	Если ЭлементСхемы.Распознан Тогда
		ЭлементСхемы.ФормированиеПоОбъектуУчета = ЭлектронныеДокументыЭДО.ЭтоСтандартныйФормат(
			РезультатРаспознания.ИсходныйФормат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОформлениеФормы(ЭлементСхемы)
	
	ЗагрузитьНастройкиОтображения();
	
	УстановитьОформлениеНастроекФормы(ЭлементСхемы);
	
	НастроитьВидимостьИНаименованиеДействийПоСостояниюЭДО();
	
	ИнтерфейсДокументовЭДО.НастроитьКомандуПереформировать(ЭтотОбъект, ЭлементСхемы);
	
	Элементы.ГруппаДекорацииПометкиУдаления.Видимость = Объект.ПометкаУдаления;
	
	Элементы.СтраницаСопроводительнаяЗаписка.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(
		СопроводительнаяЗаписка);
	
	Элементы.ГруппаМаршрутПодписания.Видимость = СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.НеСформирован
				Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание;
	
	Элементы.ОткрытьНастройкиФормирования.Видимость = (Объект.СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО
		Или Объект.СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском)
		И ЕстьПравоВыполненияОбмена
		И (СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание
			Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправка)
			И СостояниеЭДО <> Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением 
			И СостояниеЭДО <> Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно
			И ЗначениеЗаполнено(Объект.Ссылка);	
	
	Элементы.ОткрытьНастройкиОтправки.Видимость = Элементы.ОткрытьНастройкиФормирования.Видимость;
									
	Если Не ЭлементСхемыИнформацияОтправителя(ЭтотОбъект).Распознан
		И СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.НеСформирован Тогда
		Элементы.ГруппаШапкаПроизвольногоДокумента.Видимость = Истина;
		Элементы.МаршрутПодписанияДокумента.Видимость = Ложь;
	ИначеЕсли (Не ЭлементСхемыИнформацияОтправителя(ЭтотОбъект).Распознан
			ИЛИ ЭлементСхемыИнформацияОтправителя(ЭтотОбъект).ТипДокумента = Перечисления.ТипыДокументовЭДО.МашиночитаемаяДоверенность)
		 И ЭлементСхемыИнформацияОтправителя(ЭтотОбъект).ТипДокумента <> Перечисления.ТипыДокументовЭДО.Прикладной
		 И СостояниеЭДО <> Перечисления.СостоянияДокументовЭДО.НеСформирован 
		 И Не ЭлектронныеДокументыЭДО.ЭтоВнутреннийВидДокумента(Объект.ВидДокумента) Тогда
		Элементы.ГруппаШапкаПраво.Видимость = СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание;
		Элементы.ГруппаШапкаЛево.Видимость = СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание;
		Элементы.МаршрутПодписанияДокумента.Видимость = Ложь;
		Элементы.ГруппаШапкаПроизвольногоДокумента.Видимость = Истина;
		
	Иначе
		Элементы.ГруппаШапкаПроизвольногоДокумента.Видимость = Ложь;
		Элементы.МаршрутПодписанияДокумента.Видимость = Не ЗначениеЗаполнено(Объект.Ссылка) И МаршрутРедактируетсяПриСоздании;
	КонецЕсли;
	
	Элементы.ПодменюДобавитьДокументыВПакет.Видимость = СоставПакета.Количество() <= 1
		И ДоступноИзменениеПакета
		И Объект.СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО;
		
	ЗаполнитьЗаголовокСтраницыПодписей(ЭлементСхемы);
	
	Если Подписи.НайтиСтроки(Новый Структура("ПодписьВерна", Ложь)).Количество() = 0 Тогда
		Элементы.СтраницаПодписиИСтатусы.Картинка = Новый Картинка;
	Иначе
		Элементы.СтраницаПодписиИСтатусы.Картинка = БиблиотекаКартинок.Предупреждение;
	КонецЕсли;

	СостояниеДокументаПодробное = ЭлектронныеДокументыЭДО.СостояниеДокументаПодробное(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(СостояниеДокументаПодробное.Комментарий) Тогда
		ШаблонПредставления = "%1 (%2)";
		СостояниеДокументаПодробное = ЭлектронныеДокументыЭДО.СостояниеДокументаПодробное(Объект.Ссылка);
		ПредставлениеСостояния = СтрШаблон(ШаблонПредставления, СостояниеДокументаПодробное.Значение,
			СостояниеДокументаПодробное.Комментарий);
	ИначеЕсли ЗначениеЗаполнено(СостояниеДокументаПодробное.Значение) Тогда		
		ПредставлениеСостояния = СостояниеДокументаПодробное.Значение;
	Иначе
		ПредставлениеСостояния = ЭлектронныеДокументыЭДО.НачальноеСостояниеДокумента();
	КонецЕсли;
		
	Если ЗначениеЗаполнено(СостояниеДокументаПодробное.Комментарий) Тогда
		КомментарийСостояния =  СостояниеДокументаПодробное.Комментарий;
		Элементы.ПоказатьКомментарийСостояния.Видимость = Истина;
	КонецЕсли;
	
	Если ЭлектронныеДокументыЭДО.ЭтоВнутреннийВидДокумента(Объект.ВидДокумента) Тогда
		Элементы.СхемаРегламента.Видимость = Ложь;
		Элементы.ОтображатьСхемуРегламента.Видимость = Ложь;			
		Элементы.ПодменюНастройкаОтображения.Видимость = Ложь;
		Элементы.ОткрытьКонтейнерДокумента.Видимость = Ложь;		
	КонецЕсли;	
	
	ОбновитьДеревоМаршрутаПодписания();	

	Если Не СостоянияПакетаОднородно И ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ОбщегоНазначенияБЭД.ПереместитьЭлемент(Элементы, 
			Элементы.ГруппаСостояние.Имя, Элементы.ГруппаДокумент.Имя,
			Элементы.ГруппаШапкаПроизвольногоДокумента.Имя);
	Иначе
		ОбщегоНазначенияБЭД.ПереместитьЭлемент(Элементы, 
			Элементы.ГруппаСостояние.Имя, 
			Элементы.ГруппаШапка.Имя);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовокСтраницыПодписей(ЭлементСхемы)

	Если СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание Тогда
		ТекстКоличестваПодписей = МаршрутыПодписанияБЭД.ПредставлениеПрогрессаПодписания(
			ЭлементСхемы.Сообщение, Подписи.Количество())
	ИначеЕсли Подписи.Количество() > 0 Тогда
		ТекстКоличестваПодписей = "(" + Подписи.Количество() + ")";
	Иначе
		ТекстКоличестваПодписей = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстКоличестваПодписей) Тогда
		Элементы.СтраницаПодписиИСтатусы.Заголовок = СтрШаблон(НСтр("ru = 'Подписи %1'"), ТекстКоличестваПодписей);
	Иначе
		Элементы.СтраницаПодписиИСтатусы.Заголовок = НСтр("ru = 'Подписи'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьИНаименованиеДействийПоСостояниюЭДО()
	
	ЕстьПравоОбработкиДокументов = ЭлектронныеДокументыЭДО.ЕстьПравоОбработкиДокументов();

	Элементы.СоздатьПроизвольныйДокумент.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.Перенаправить.Видимость = ЕстьПравоОбработкиДокументов;
	Элементы.ОбновитьСостояниеЭД.Видимость = ЕстьПравоОбработкиДокументов;
	
	ДействияНаЭтапеДляДокумента = ЭлектронныеДокументыЭДО.ДействияПоСостояниюДокумента(СостояниеЭДО, Объект);
	
	Если СостоянияПакетаОднородно И ЗначениеЗаполнено(Объект.Ссылка) И ЭтоПакет() Тогда
		ДействияНаЭтапе = ЭлектронныеДокументыЭДО.ДействияПоСостояниюДокумента(СостояниеПакета, Объект);
	Иначе
		ДействияНаЭтапе = ДействияНаЭтапеДляДокумента;
	КонецЕсли;
	
	ЭтоИнтеркампани = ЭлектронныеДокументыЭДО.ИспользуемыеВидыДокументовИнтеркампани().Найти(Объект.ВидДокумента) <> Неопределено;
	
	Элементы.ЗаписатьДокумент.Видимость = Не ЗначениеЗаполнено(Объект.Ссылка)
		Или (Не ЭлементСхемыИнформацияОтправителя(ЭтотОбъект).Распознан 
		И Не ЭлектронныеДокументыЭДО.ЭтоВнутреннийВидДокумента(Объект.ВидДокумента))
		И СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание
		И ЭлектронныеДокументыЭДО.ЕстьПравоОбработкиДокументов();
	
	Элементы.Подписать.Видимость = Ложь;
	Элементы.ПодписатьДокумент.Видимость = Ложь;
	Элементы.Отправить.Видимость = Ложь;
	Элементы.ОтправитьДокумент.Видимость = Ложь;
	Элементы.ПодписатьОтправить.Видимость = Ложь;
	Элементы.ПодписатьОтправитьДокумент.Видимость = Ложь;
		
	Если ЕстьДействиеПоЭДО(ДействияНаЭтапе, Перечисления.ДействияПоЭДО.Подписать)
		И ЕстьДействиеПоЭДО(ДействияНаЭтапе, Перечисления.ДействияПоЭДО.Отправить)
		И Не ИспользуетсяОтложеннаяОтправка
		И Не ЭтоИнтеркампани Тогда
		Элементы.ПодписатьОтправить.Видимость = Истина;
	ИначеЕсли ЕстьДействиеПоЭДО(ДействияНаЭтапе, Перечисления.ДействияПоЭДО.Подписать) Тогда
		Элементы.Подписать.Видимость = Истина;
	ИначеЕсли ЕстьДействиеПоЭДО(ДействияНаЭтапе, Перечисления.ДействияПоЭДО.Отправить)
	 	Или ЕстьДействиеПоЭДО(ДействияНаЭтапе, Перечисления.ДействияПоЭДО.ПодготовитьКОтправке)Тогда
		Элементы.Отправить.Видимость = Истина;
	КонецЕсли;
	
	Если ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента, Перечисления.ДействияПоЭДО.Подписать)
		И ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента, Перечисления.ДействияПоЭДО.Отправить) Тогда
		Элементы.ПодписатьОтправитьДокумент.Видимость = Истина;
	ИначеЕсли ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента, Перечисления.ДействияПоЭДО.Подписать) Тогда
		Элементы.ПодписатьДокумент.Видимость = Истина;
	ИначеЕсли ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента, Перечисления.ДействияПоЭДО.Отправить)
		Или ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента, Перечисления.ДействияПоЭДО.ПодготовитьКОтправке) Тогда
		Элементы.ОтправитьДокумент.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ПринятьАннулирование.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапе,
		Перечисления.ДействияПоЭДО.ПринятьАннулирование);
	Элементы.ПринятьАннулированиеДокумент.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента,
		Перечисления.ДействияПоЭДО.ПринятьАннулирование);
		
	Элементы.ОтклонитьАннулирование.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапе,
		Перечисления.ДействияПоЭДО.ОтклонитьАннулирование);
	Элементы.ОтклонитьАннулированиеДокумент.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента,
		Перечисления.ДействияПоЭДО.ОтклонитьАннулирование);
	
	Элементы.ОтклонитьПодписание.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапе,
		Перечисления.ДействияПоЭДО.ОтклонитьПодписание);
	Элементы.ОтклонитьПодписаниеДокумент.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента,
		Перечисления.ДействияПоЭДО.ОтклонитьПодписание);	
		
	Элементы.Отклонить.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапе, Перечисления.ДействияПоЭДО.Отклонить);
	Элементы.ОтклонитьДокумент.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента,
		Перечисления.ДействияПоЭДО.Отклонить);

	Элементы.Аннулировать.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапе, Перечисления.ДействияПоЭДО.Аннулировать);
	Элементы.АннулироватьДокумент.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента,
		Перечисления.ДействияПоЭДО.Аннулировать);

	Элементы.Завершить.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапе, Перечисления.ДействияПоЭДО.ЗакрытьПринудительно);
	Элементы.ЗавершитьДокумент.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента,
		Перечисления.ДействияПоЭДО.ЗакрытьПринудительно);

	Элементы.ОтправитьВАрхив.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапе, Перечисления.ДействияПоЭДО.ОтправитьВАрхив);
	Элементы.ОтправитьВАрхивДокумент.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента,
		Перечисления.ДействияПоЭДО.ОтправитьВАрхив);

	Элементы.ВернутьВРаботу.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапе, Перечисления.ДействияПоЭДО.ВернутьВРаботу);
	Элементы.ВернутьВРаботуДокумент.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента,
		Перечисления.ДействияПоЭДО.ВернутьВРаботу);

	Элементы.ОтправитьПовторно.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапе,
		Перечисления.ДействияПоЭДО.ОтправитьПовторно);
	Элементы.ОтправитьПовторноДокумент.Видимость = ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента,
		Перечисления.ДействияПоЭДО.ОтправитьПовторно);
	
	СформироватьИзвещение = ЕстьДействиеПоЭДО(ДействияНаЭтапеДляДокумента,
		Перечисления.ДействияПоЭДО.СформироватьИзвещение);
	
	ПакетСоставной = СоставПакета.Количество() > 1;
	
	Элементы.ДействияСДокументом.Видимость = ПакетСоставной И СостоянияПакетаОднородно 
		И СостояниеЭДО <> Перечисления.СостоянияДокументовЭДО.НеСформирован
		И СостояниеЭДО <> Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправка
		И СостояниеЭДО <> Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание;

	Элементы.Подписать.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыПодписать(ПакетСоставной, СостоянияПакетаОднородно);
	Элементы.Отправить.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыОтправить(ПакетСоставной, СостоянияПакетаОднородно);
	Элементы.ПодписатьОтправить.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыПодписатьИОтправить(ПакетСоставной, СостоянияПакетаОднородно);
	Элементы.ПринятьАннулирование.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыПринятьАннулирование(ПакетСоставной, СостоянияПакетаОднородно);
	Элементы.ОтклонитьАннулирование.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыОтклонитьАннулирование(ПакетСоставной, СостоянияПакетаОднородно);		
	Элементы.Отклонить.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыОтклонить(ПакетСоставной, СостоянияПакетаОднородно);
	Элементы.ОтклонитьПодписание.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыОтклонитьПодписание(ПакетСоставной, СостоянияПакетаОднородно);
	Элементы.Переформировать.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыПереформировать(ПакетСоставной, СостоянияПакетаОднородно);
	Элементы.Аннулировать.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыАннулировать(ПакетСоставной, СостоянияПакетаОднородно);
	Элементы.ОтправитьВАрхив.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыОтправитьВАрхив(ПакетСоставной, СостоянияПакетаОднородно);
	Элементы.ВернутьВРаботу.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыВернутьВРаботу(ПакетСоставной, СостоянияПакетаОднородно);
	Элементы.ОтправитьПовторно.Заголовок = ИнтерфейсДокументовЭДО.ПредставлениеКомандыОтправитьПовторно(ПакетСоставной, СостоянияПакетаОднородно);
	
КонецПроцедуры

&НаСервере
Функция ЕстьДействиеПоЭДО(ДоступныеДействия, ДействиеПоЭДО)
	Возврат ИнтерфейсДокументовЭДО.ЕстьДействиеПоЭДО(ДоступныеДействия, ДействиеПоЭДО);
КонецФункции

&НаСервере
Функция ЭтоПакет()
	Возврат ЗначениеЗаполнено(ИдентификаторПакета);
КонецФункции 

&НаКлиенте
Процедура ВыполнитьДействияПоЭДО(НаборДействий, ПакетнаяОбработка)

	Если Модифицированность Тогда
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("ЭтоНовыйДокумент", Не ЗначениеЗаполнено(Объект.Ссылка));
			
		Записать(ПараметрыЗаписи);
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, НаборДействий));

	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ИнтерфейсДокументовЭДОКлиент, ДополнительныеПараметры);
	
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	
	Если ПакетнаяОбработка И ЗначениеЗаполнено(ИдентификаторПакета) Тогда		
		ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов.Добавить(ИдентификаторПакета);
	Иначе
		ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);
	
КонецПроцедуры

&НаСервере
Процедура СхемаРегламентаПослеАктивизацииСтрокиНаСервере()
	
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
	
	ЗаполнитьПодписи(ЭлементСхемы);
	
	УстановитьВидимостьДоверенности();
	
	ЗаполнитьЗаголовокСтраницыПодписей(ЭлементСхемы);
	
	ЗаполнитьТекстСопроводительнойЗаписки(ЭлементСхемы);
	
	ПоказатьПредставлениеДокумента(ЭлементСхемы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоверенности()  
	
	Если Подписи.НайтиСтроки(Новый Структура("ЭтоПодписьПоДоверенности", Истина)).Количество() = 0 Тогда
		Элементы.ПодписиДоверенностьПредставление.Видимость = Ложь;
	Иначе
		Элементы.ПодписиДоверенностьПредставление.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоказатьПредставлениеДокумента(ЭлементСхемыРегламента)
	
	РаспознатьДокумент(ЭлементСхемыРегламента);

	Если Не ЭлементСхемыРегламента.Распознан 
		И ЭлементСхемыРегламента.Направление <> Перечисления.НаправленияЭДО.Внутренний
		И ЭлементСхемыРегламента.ТипДокумента <> Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		ПодготовитьПредставлениеФайла(ЭлементСхемыРегламента);
	КонецЕсли;
	
	Если ЭлементСхемыРегламента.ПредставлениеСформировано Тогда
		УстановитьСтраницуПредставления(ЭлементСхемыРегламента);
		Возврат;
	КонецЕсли;
	
	ПараметрыВизуализацииДокумента = ИнтерфейсДокументовЭДО.НовыеПараметрыВизуализацииДокумента();
	ПараметрыВизуализацииДокумента.ВыводитьБанковскиеРеквизиты = ВыводитьБанковскиеРеквизиты;
	ПараметрыВизуализацииДокумента.ВыводитьДопДанные = Не ОтключитьВыводДопДанных;
	ПараметрыВизуализацииДокумента.ВыводитьКопияВерна = Не ОтключитьВыводКопияВерна;
	
	ФормированиеПредставления = ИнтерфейсДокументовЭДО.ЗапуститьФормированиеПредставленияДанныхДокумента(
		ЭлементСхемыРегламента, УникальныйИдентификатор, ПараметрыВизуализацииДокумента,
		ЭлементСхемыРегламента.АдресОписанияСообщения);
	
	ОбновитьПредставлениеДокумента();
	
КонецПроцедуры

&НаСервере
Функция КоличествоПрисоединенныхФайлов()
	
	ВладелецПрисоединенныхФайлов = ВладелецПрисоединенныхФайлов();
	
	Если Не ЗначениеЗаполнено(ВладелецПрисоединенныхФайлов) Тогда
		Возврат 0;
	КонецЕсли;
	
	ПрисоединенныеФайлы = Новый Массив;
	
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ВладелецПрисоединенныхФайлов, ПрисоединенныеФайлы);
	
	Возврат ПрисоединенныеФайлы.Количество();
	
КонецФункции

&НаСервере
Функция ВладелецПрисоединенныхФайлов()
	
	Возврат ?(Основания.Количество() > 0, Основания[0].Значение, Неопределено);
	
КонецФункции

&НаСервере
Процедура ПодготовитьПредставлениеФайла(ЭлементСхемыРегламента)
	
	РедактированиеЗапрещено = ЭлементСхемыРегламента.Статус = Перечисления.СтатусыСообщенийЭДО.Подписан
		ИЛИ ЭлементСхемыРегламента.Статус = Перечисления.СтатусыСообщенийЭДО.Отправлен;
	
	Если РедактированиеЗапрещено И ЭлементСхемыРегламента.ПредставлениеСформировано Тогда
		ИмяФайла = ЭлементСхемыРегламента.ИмяФайла;
		
		Элементы.НадписьИмяФайла.Гиперссылка = Истина;
		Элементы.НадписьИмяФайла.ЦветТекста = ЦветаСтиля.ЦветГиперссылкиБЭД;
		Элементы.ГруппаРедактированиеФайла.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ЭлементСхемыРегламента.ИмяРеквизита = "Файл";
	ЭлементСхемыРегламента.ПредставлениеСформировано = Истина;
	
	Если ЗначениеЗаполнено(ЭлементСхемыРегламента.ПрисоединенныйФайл)Тогда
		Элементы.ГруппаКомандДобавитьЗаменить.Видимость = Ложь;
		Элементы.ДобавитьВложениеИзФайлаНаДискеОдиночная.Видимость = Ложь;
	ИначеЕсли КоличествоПрисоединенныхФайлов() > 0 Тогда
		Элементы.ГруппаКомандДобавитьЗаменить.Видимость = Истина;
		Элементы.ДобавитьВложениеИзФайлаНаДискеОдиночная.Видимость = Ложь;
	Иначе
		Элементы.ГруппаКомандДобавитьЗаменить.Видимость = Ложь;
		Элементы.ДобавитьВложениеИзФайлаНаДискеОдиночная.Видимость = Истина;
	КонецЕсли;
	
	ДанныеФайла = Новый Структура;
	Если ЗначениеЗаполнено(ЭлементСхемыРегламента.ПрисоединенныйФайл) Тогда
		ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
		ПараметрыДанныхФайла.ИдентификаторФормы = УникальныйИдентификатор;
		ПараметрыДанныхФайла.ПолучатьСсылкуНаДвоичныеДанные = Ложь;
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(ЭлементСхемыРегламента.ПрисоединенныйФайл, ПараметрыДанныхФайла);
	ИначеЕсли ЗначениеЗаполнено(ЭлементСхемыРегламента.АдресФайла) Тогда
		ДанныеФайла.Вставить("ИмяФайла", ЭлементСхемыРегламента.ИмяФайла);
		ДанныеФайла.Вставить("Расширение", ЭлементСхемыРегламента.РасширениеФайла);
		ДанныеФайла.Вставить("ФайлРедактируется", Ложь);
		ДанныеФайла.Вставить("ФайлРедактируетТекущийПользователь", Ложь);
	Иначе
		ИмяФайла = НСтр("ru = '<отсутствует>'");
		КартинкаФайла = 0;
		Элементы.НадписьИмяФайла.Гиперссылка = Ложь;
		Элементы.НадписьИмяФайла.ЦветТекста = WebЦвета.Кирпичный;
		Элементы.РедактироватьФайл.Доступность = Ложь;
		Элементы.ЗавершитьРедактированиеФайла.Доступность = Ложь;
		Элементы.ОтменитьРедактированиеФайла.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	ИмяФайла = ДанныеФайла.ИмяФайла;
	ЭлементСхемыРегламента.ИмяФайла = ИмяФайла;
	
	КартинкаФайла = ИнтеграцияБСПБЭД.ИндексПиктограммыФайла(ДанныеФайла.Расширение);
	
	Элементы.НадписьИмяФайла.Гиперссылка = Истина;
	Элементы.НадписьИмяФайла.ЦветТекста = ЦветаСтиля.ЦветГиперссылкиБЭД;
	
	Если РедактированиеЗапрещено Тогда
		Элементы.ГруппаРедактированиеФайла.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаРедактированиеФайла.Видимость = Истина;
	
	Если ДанныеФайла.ФайлРедактируется Тогда
		ТекстРедактируетФайл = СтрШаблон(НСтр("ru = 'Файл захвачен на редактирование пользователем %1'"),
			ДанныеФайла.Редактирует);
		Элементы.НадписьРедактируетФайл.ЦветТекста = ЦветаСтиля[?(ДанныеФайла.ФайлРедактируетТекущийПользователь,
			"ФайлЗанятыйТекущимПользователем", "ТекстЗапрещеннойЯчейкиЦвет")];
	Иначе
		ТекстРедактируетФайл = "";
	КонецЕсли;
	
	ИмяЗаголовкаКнопкиДобавить = НСтр("ru = 'Заменить на файл'");
	Если ЗначениеЗаполнено(ЭлементСхемыРегламента.ПрисоединенныйФайл) > 0 Тогда
		Элементы.ГруппаКомандДобавитьЗаменить.Заголовок = ИмяЗаголовкаКнопкиДобавить;
	Иначе
		Элементы.ДобавитьВложениеИзФайлаНаДискеОдиночная.Заголовок = ИмяЗаголовкаКнопкиДобавить;
	КонецЕсли;
	
	Элементы.РедактироватьФайл.Доступность = НЕ ДанныеФайла.ФайлРедактируется
		И (ЗначениеЗаполнено(ЭлементСхемыРегламента.ПрисоединенныйФайл)
			ИЛИ ЗначениеЗаполнено(ЭлементСхемыРегламента.АдресФайла));
	
	Элементы.ЗавершитьРедактированиеФайла.Доступность = ДанныеФайла.ФайлРедактируется
		И ДанныеФайла.ФайлРедактируетТекущийПользователь;
	
	Элементы.ОтменитьРедактированиеФайла.Доступность = ДанныеФайла.ФайлРедактируется
		И ДанныеФайла.ФайлРедактируетТекущийПользователь;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеДокумента()
	
	ЭлементСхемыРегламента = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
		
	Если ФормированиеПредставления = Неопределено
		ИЛИ ФормированиеПредставления.Статус = "Ошибка" Тогда
		
		ПодготовитьПредставлениеОшибки(ЭлементСхемыРегламента);
		Элементы.СтраницыПредставленийДокумента.ТекущаяСтраница = Элементы.СтраницаОшибка;
		
	ИначеЕсли ФормированиеПредставления.Статус = "Выполнено" Тогда

		ПодготовитьПредставлениеДокумента(ЭлементСхемыРегламента);
		УстановитьСтраницуПредставления(ЭлементСхемыРегламента);
		
	ИначеЕсли ФормированиеПредставления.Статус = "Выполняется" Тогда
		
		ПодготовитьПредставлениеОжидания(ЭлементСхемыРегламента);
		Элементы.СтраницыПредставленийДокумента.ТекущаяСтраница = Элементы.СтраницаОжидание;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПодготовитьПредставлениеДокумента(ЭлементСхемыРегламента)
	
	Если ЭлементСхемыРегламента.ТипЭлементаРегламента
		= Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда

		ЭлементСхемыРегламента.ИмяРеквизита = Элементы.ТабличныйДокументИнформацияОтправителя.ПутьКДанным;

	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСГИСЭПД") Тогда
		МодульОбменСГИСЭПД = ОбщегоНазначения.ОбщийМодуль("ОбменСГИСЭПД");
		Если МодульОбменСГИСЭПД.ЭтоТитулОтправителя(ЭлементСхемыРегламента.ТипЭлементаРегламента) Тогда
			ЭлементСхемыРегламента.ИмяРеквизита = Элементы.ТабличныйДокументИнформацияОтправителя.ПутьКДанным;	
		КонецЕсли;
	КонецЕсли;
	
	РезультатФормирования = ПолучитьИзВременногоХранилища(ФормированиеПредставления.АдресРезультата);
	Если РезультатФормирования = Неопределено
		ИЛИ РезультатФормирования.ПредставлениеДокумента = Неопределено Тогда
		ПодготовитьПредставлениеОшибки(ЭлементСхемыРегламента);
		Возврат;
	КонецЕсли;
	
	ПредставлениеДокумента = РезультатФормирования.ПредставлениеДокумента;
	ЭлектронныеДокументыЭДО.ДополнитьТабличныйДокументШтампамиПодписей(ПредставлениеДокумента, ЭлементСхемыРегламента.Сообщение);
	
	ЭтотОбъект[ЭлементСхемыРегламента.ИмяРеквизита] = ПредставлениеДокумента;
	ЭлементСхемыРегламента.ПредставлениеСформировано = Истина;
	
	ФормированиеПредставления = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПредставлениеОшибки(ЭлементСхемыРегламента)
	ФормированиеПредставления = Неопределено;
	ЭлементСхемыРегламента.ПредставлениеСформировано = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПредставлениеОжидания(ЭлементСхемыРегламента)
	ЭлементСхемыРегламента.ПредставлениеСформировано = Ложь;
КонецПроцедуры

&НаСервере
Процедура УстановитьСтраницуПредставления(ЭлементСхемыРегламента)
	Элементы.СтраницыПредставленийДокумента.ТекущаяСтраница = 
		Элементы["Страница" + ЭлементСхемыРегламента.ИмяРеквизита];
КонецПроцедуры

&НаСервере
Процедура УстановитьИдентификаторТекущегоЭлемента(ЭлементСхемыРодитель, Сообщение, Установлен = Ложь)
	
	Если Установлен Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияЭлементовСхемы = ЭлементСхемыРодитель.ПолучитьЭлементы();
	Если КоллекцияЭлементовСхемы.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(Сообщение) Тогда
		ИдентификаторТекущегоЭлемента = КоллекцияЭлементовСхемы[0].ПолучитьИдентификатор();
		Установлен = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСхемы Из КоллекцияЭлементовСхемы Цикл
		Если ЭлементСхемы.Сообщение = Сообщение Тогда
			ИдентификаторТекущегоЭлемента = ЭлементСхемы.ПолучитьИдентификатор();
			Установлен = Истина;
		Иначе
			УстановитьИдентификаторТекущегоЭлемента(ЭлементСхемы, Сообщение, Установлен);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодписи(ЭлементСхемы)
	
	Если Подписи.Количество() Тогда
		Подписи.Очистить();
	КонецЕсли;
	
	Если Объект.ОбменБезПодписи
		ИЛИ Не ЗначениеЗаполнено(ЭлементСхемы.ПрисоединенныйФайл) Тогда
		Возврат;
	КонецЕсли;
	
	УстановленныеПодписи = ИнтерфейсДокументовЭДО.УстановленныеПодписи(ЭлементСхемы, Объект.ТипРегламента);
	Для Каждого СтрокаПодпись Из УстановленныеПодписи Цикл
		НоваяСтрока = Подписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПодпись);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПодпись.СвойстваПодписи);
		НоваяСтрока.НомерСтроки = Подписи.Индекс(НоваяСтрока);
		НоваяСтрока.ВыводКартинки = ?(НоваяСтрока.ПодписьВерна, 0, 1);
	КонецЦикла;
	ИнтерфейсДокументовЭДО.ЗаполнитьПредставлениеСостоянияПодписей(Подписи);
	
	Элементы.ПодписиВыводКартинки.Видимость = Подписи.Итог("ВыводКартинки") = 1;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстСопроводительнойЗаписки(ЭлементСхемы);
	СопроводительнаяЗаписка = ЭлементСхемы.ДополнительнаяИнформация;	
КонецПроцедуры	

&НаСервере
Процедура УстановитьСвязиПараметровВыбораДоговорКонтрагента();
	
	ИнтерфейсДокументовЭДО.УстановитьСвязиПараметровВыбораДоговорКонтрагента(
		Элементы.Договор, Элементы.Организация.ПутьКДанным, Элементы.Контрагент.ПутьКДанным);

КонецПроцедуры	

&НаСервере
Процедура ОчиститьЗаписку(Команда)
	
	Если ЗначениеЗаполнено(СопроводительнаяЗаписка) Тогда
	
		ТекущаяСтрокаДерева = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
		
		ЭлектронныеДокументыЭДО.ОчиститьДополнительнуюИнформациюСообщения(ТекущаяСтрокаДерева.ЭлектронныйДокумент);
		
		СопроводительнаяЗаписка = "";
		
		ТекущаяСтрокаДерева = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
		ТекущаяСтрокаДерева.ДополнительнаяИнформация = СопроводительнаяЗаписка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Если СоставПакета.Количество() > 1 Тогда
		Заголовок = ПакетыДокументовЭДО.ЗаголовокОтображенияПакетов(СоставПакета.Количество());
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
		Заголовок = ПакетыДокументовЭДО.ЗаголовокНовогоПроизвольногоДокумента();
		Возврат;
	КонецЕсли;
	
	ПараметрыПредставления = ЭлектронныеДокументыЭДО.НовыеСвойстваПредставленияДокумента();
	ПараметрыПредставления.ВидДокумента = Объект.ВидДокумента;
	ПараметрыПредставления.НомерДокумента = Объект.НомерДокумента;
	ПараметрыПредставления.ДатаДокумента = Объект.ДатаДокумента;
	
	Заголовок = ЭлектронныеДокументыЭДО.ПредставлениеДокументаПоСвойствам(ПараметрыПредставления, Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеНастроекФормы(ЭлементСхемы)
	
	Элементы.ОтображатьДополнительнуюИнформацию.Пометка = НЕ ОтключитьВыводДопДанных;
	Элементы.ОтображатьОбластьКопияВерна.Пометка = НЕ ОтключитьВыводКопияВерна;
	
	Элементы.ОтображатьСхемуРегламента.Пометка = НЕ ОтключитьВыводСхемыРегламента;
	Элементы.СхемаРегламента.Видимость = НЕ ОтключитьВыводСхемыРегламента;
	
	Если ЭлементСхемы.ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетНаОплату Тогда
		
		ВыводитьБанковскиеРеквизиты = Истина;
		Элементы.ОтображатьБанковскиеРеквизиты.Видимость = Ложь;
		
	ИначеЕсли ЭлементСхемы.ФормированиеПоОбъектуУчета Тогда
		
		Элементы.ОтображатьБанковскиеРеквизиты.Видимость = Истина;
		Элементы.ТранслитироватьИмяФайла.Видимость = Ложь;
		
	Иначе
	
		Элементы.ТранслитироватьИмяФайла.Видимость = Истина;
		Элементы.ТранслитироватьИмяФайла.Пометка = Не ОтключитьТранслитерацию;
		
		Элементы.ОтображатьБанковскиеРеквизиты.Видимость = Ложь;	
		Элементы.ОтображатьДополнительнуюИнформацию.Видимость = Ложь; 
		Элементы.ОтображатьОбластьКопияВерна.Видимость = Ложь;
			
	КонецЕсли;

	Элементы.НадписьТранслитерация.Видимость = Элементы.ТранслитироватьИмяФайла.Пометка;
	
	Элементы.ОтображатьБанковскиеРеквизиты.Пометка = ВыводитьБанковскиеРеквизиты;
	
	Если ЭлементСхемы.ТипДокумента = Перечисления.ТипыДокументовЭДО.ДоговорнойДокумент Тогда
		Элементы.ГруппаПодсказкаДоговорнойДокумент.Видимость = Истина;
	Иначе
		Элементы.ГруппаПодсказкаДоговорнойДокумент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПараметрыКонтрагента()
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		ИЛИ ЭлементСхемыИнформацияОтправителя(ЭтотОбъект).ФормированиеПоОбъектуУчета Тогда
		Возврат;
	КонецЕсли;

	Элементы.Контрагент.ОграничениеТипа = Метаданные.ОпределяемыеТипы.КонтрагентБЭД.Тип;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПакетФайлСКомпьютераКоманда(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Описание = Новый ОписаниеОповещения("ДобавитьВПакетФайлСКомпьютераПослеОтветаНаВопрос", ЭтотОбъект);

		Текст = НСтр("ru = 'Для выполнения операции необходимо сохранить документ. Продолжить?'");
		ПоказатьВопрос(Описание, Текст, РежимДиалогаВопрос.ДаНет);	
	Иначе
		
		ДобавитьВПакетФайлСКомпьютера();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПакетФайлСКомпьютераПослеОтветаНаВопрос(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеНаКлиенте(Отказ);
	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли;
	
	НачатьЗаписьДокумента(Новый ОписаниеОповещения("ДобавитьВПакетФайлСКомпьютераПослеЗаписи", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПакетФайлСКомпьютераПослеЗаписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда 
		Возврат;
	КонецЕсли;
	
	ДобавитьВПакетФайлСКомпьютера();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПакетФайлСКомпьютера()
	
	ДополнительныеПараметры = ПараметрыДобавленияВПакет();
	
	ПакетыДокументовЭДОКлиент.ПослеВыбораСпособаДобавленияДокументаВПакет("ДобавитьВПакетФайлСКомпьютера",
		ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПакетПрисоединенныйФайлКоманда(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Описание = Новый ОписаниеОповещения("ДобавитьВПакетПрисоединенныйФайлПослеОтветаНаВопрос", ЭтотОбъект);

		Текст = НСтр("ru = 'Для выполнения операции необходимо сохранить документ. Продолжить?'");
		ПоказатьВопрос(Описание, Текст, РежимДиалогаВопрос.ДаНет);	
	Иначе
		
		ДобавитьВПакетПрисоединенныйФайл();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПакетПрисоединенныйФайлПослеОтветаНаВопрос(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеНаКлиенте(Отказ);
	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли;
	
	НачатьЗаписьДокумента(Новый ОписаниеОповещения("ДобавитьВПакетПрисоединенныйФайлПослеЗаписи", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПакетПрисоединенныйФайлПослеЗаписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда 
		Возврат;
	КонецЕсли;
	
	ДобавитьВПакетПрисоединенныйФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПакетПрисоединенныйФайл()
	
	ДополнительныеПараметры = ПараметрыДобавленияВПакет();
	
	ПакетыДокументовЭДОКлиент.ПослеВыбораСпособаДобавленияДокументаВПакет("ДобавитьВПакетПрисоединенныйФайл",
		ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПакетДокументИнформационнойБазыКоманда(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Описание = Новый ОписаниеОповещения("ДобавитьВПакетДокументИнформационнойБазыПослеОтветаНаВопрос", ЭтотОбъект);

		Текст = НСтр("ru = 'Для выполнения операции необходимо сохранить документ. Продолжить?'");
		ПоказатьВопрос(Описание, Текст, РежимДиалогаВопрос.ДаНет);	
	Иначе
		
		ДобавитьВПакетДокументИнформационнойБазы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПакетДокументИнформационнойБазыПослеОтветаНаВопрос(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеНаКлиенте(Отказ);
	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли;
	
	НачатьЗаписьДокумента(Новый ОписаниеОповещения);
	
	ДобавитьВПакетДокументИнформационнойБазы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПакетДокументИнформационнойБазы()
	
	ДополнительныеПараметры = ПараметрыДобавленияВПакет();
	
	ПакетыДокументовЭДОКлиент.ПослеВыбораСпособаДобавленияДокументаВПакет(
		"ДобавитьВПакетДокументИнформационнойБазы", ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Функция ПараметрыДобавленияВПакет()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторПакета", ИдентификаторПакета); 
	ДополнительныеПараметры.Вставить("ЭлектронныйДокумент", Объект.Ссылка);
	ДополнительныеПараметры.Вставить("Отправитель", Объект.Организация);
	ДополнительныеПараметры.Вставить("Получатель", Объект.Контрагент);
	ДополнительныеПараметры.Вставить("Договор", Объект.ДоговорКонтрагента);
	ДополнительныеПараметры.Вставить("ОтключитьТранслитерацию", ОтключитьТранслитерацию);
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьДоговорПослеВыбораОрганизации(ВыбранноеЗначение)
	
	Если Объект.Организация <> ВыбранноеЗначение Тогда
		Объект.ДоговорКонтрагента = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПриИзмененииКлючевыхРеквизитов();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СхемаРегламентаПослеАктивизацииСтроки()
	
	ИдентификаторЭлементаСхемы = Элементы.СхемаРегламента.ТекущаяСтрока;
	Если ИдентификаторЭлементаСхемы <> Неопределено
		И ИдентификаторЭлементаСхемы <> ИдентификаторТекущегоЭлемента
		И Элементы.СхемаРегламента.ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(Элементы.СхемаРегламента.ТекущиеДанные.Сообщение) Тогда
		
		ИдентификаторТекущегоЭлемента = ИдентификаторЭлементаСхемы;
		СхемаРегламентаПослеАктивизацииСтрокиНаСервере();
		ОжидатьФормированияПредставленияДокумента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеЭлектронногоДокумента()
	
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
	
	ЭлементСхемы.ПредставлениеСформировано = Ложь;
		
	ПоказатьПредставлениеДокумента(ЭлементСхемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьФормированияПредставленияДокумента()
	
	Если ФормированиеПредставления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьПредставлениеДанныхДокументаПослеФормирования", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ВыводитьОкноОжидания", Ложь);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФормированиеПредставления, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоМаршрутаПодписания()
	
	ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ЭлементСхемы.Сообщение) Тогда
		
		ИсточникМаршрута = ЭлементСхемы.Сообщение;
		
	Иначе
		
		ИсточникМаршрута = МаршрутыПодписанияБЭД.ТаблицаМаршрутаПоПараметрам(Объект.Ссылка, Объект.МаршрутПодписания, ,
			Объект.СписокПодписантов.Выгрузить());

	КонецЕсли;
	
	Если ЭлементСхемы.Направление = Перечисления.НаправленияЭДО.Интеркампани Тогда
		ОсновнойРеквизит = "Организация";
	Иначе
		ОсновнойРеквизит = "Подписант";
	КонецЕсли;
	
	МаршрутыПодписанияБЭД.ЗаполнитьДеревоМаршрутаНаФорме(ЭтотОбъект, ИсточникМаршрута, 
		"СхемаМаршрутаПодписания", ОсновнойРеквизит);
	
	Элементы.СхемаМаршрутаПодписанияСертификат.Видимость = Объект.ВидПодписи <> Перечисления.ВидыЭлектронныхПодписей.Простая;
		
КонецПроцедуры

&НаСервере
Процедура СформироватьПредупреждения()

	ИнтерфейсДокументовЭДО.СформироватьПредупреждения(ЭтотОбъект, Элементы.ГруппаПредупреждений);
	
	Элементы.ГруппаПредупреждений.Видимость = ЭлектронныеДокументыЭДО.ЕстьПравоОбработкиДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПредставлениеДокументовУчета()
	
	ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
	
	МассивОбъектовУчета = Основания.ВыгрузитьЗначения();
	КоличествоДокументов = МассивОбъектовУчета.Количество();
	
	ОтображатьПодбор = Ложь;
	Элементы.ДокументыУчетаЭлектронногоДокументаПредставление.Заголовок = НСтр("ru = 'Документ учета'");
	
	Если КоличествоДокументов = 0 Тогда
		
		Если ЭлементСхемы.ТипДокумента = Перечисления.ТипыДокументовЭДО.КаталогТоваров Тогда
			ПредставлениеДокументов = НСтр("ru = 'Сопоставить номенклатуру'");
			Элементы.ДокументыУчетаЭлектронногоДокументаПредставление.Заголовок = НСтр("ru = 'Настройка ЭДО'");
		ИначеЕсли Не ЭлементСхемы.ФормированиеПоОбъектуУчета 
			И Не ЭлектронныеДокументыЭДО.ЭтоВнутреннийВидДокумента(Объект.ВидДокумента) Тогда
			ПредставлениеДокументов = НСтр("ru = '<Подбор>'");
		Иначе
			ПредставлениеДокументов = "";
		КонецЕсли;

		Если ЭлементСхемы.ТипДокумента = Перечисления.ТипыДокументовЭДО.МашиночитаемаяДоверенность Тогда
			ОтображатьПодбор = Истина;
		КонецЕсли;
		
	ИначеЕсли КоличествоДокументов = 1 Тогда
		
		ОбъектУчета = МассивОбъектовУчета[0];
		
		ПредставлениеДокументов = Строка(ОбъектУчета);
		
		Если Не ЭлементСхемы.ФормированиеПоОбъектуУчета
			И Не ЭлектронныеДокументыЭДО.ЭтоВнутреннийВидДокумента(Объект.ВидДокумента) Тогда
			ОтображатьПодбор = Истина;
		КонецЕсли;
		
	Иначе
		
		Элементы.ДокументыУчетаЭлектронногоДокументаПредставление.Заголовок = НСтр("ru = 'Документы учета'");
		ШаблонТекста = НСтр("ru = 'Список документов (%1)'");  
		ПредставлениеДокументов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекста, КоличествоДокументов);
		
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
		ПредставлениеДокументов, , , , "ПредставлениеДокументовУчетаЭлектронногоДокументаНажатие"));
		
	Если ОтображатьПодбор И Не Объект.Ссылка.Пустая() Тогда
		МассивСтрок.Добавить("   ");
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
			НСтр("ru = '<Подбор>'"), ,
			, ,
			"ОткрытьФормуПодбораДокументовУчетаНажатие"));
	КонецЕсли;
	
	ДокументыУчетаЭлектронногоДокументаПредставление = Новый ФорматированнаяСтрока(МассивСтрок);
	
	Элементы.ДокументыУчетаЭлектронногоДокументаПредставление.Видимость = КоличествоДокументов > 0 ИЛИ Не Объект.Ссылка.Пустая();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредставлениеДанныхДокументаПослеФормирования(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено
		ИЛИ ФормированиеПредставленияОтменено Тогда
		ФормированиеПредставленияОтменено = Ложь;
		Возврат;
	КонецЕсли;
	
	ФормированиеПредставления = Результат;
	ОбновитьПредставлениеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияЗаписиДокумента(Результат, Контекст) Экспорт
	
	ОбновитьДанныеЭлектронногоДокументаНаСервере();
	Оповестить("ОбновитьСостояниеЭД");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияДействийПоЭДО(Результат, НаборДействий) Экспорт
	
	ОбновитьДанныеЭлектронногоДокументаНаСервере();
		
	Если НаборДействий.Получить(ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ОтправитьВАрхив")) = Истина Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеЭлектронногоДокументаНаСервере()
	
	ЗаполнитьДанныеЭлектронногоДокумента();
	
	ИдентификаторТекущегоЭлемента = СхемаРегламента.ПолучитьЭлементы()[0].ПолучитьИдентификатор();
	
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
		
	РаспознатьДокумент(ЭлементСхемы);	
	
	ПолучитьДанныеПакета();
	
	СформироватьПанельСоставаПакета();
	
	ЗаполнитьПодписи(ЭлементСхемы);
	
	ВывестиПредставлениеДокументовУчета();
	
	НастроитьОформлениеФормы(ЭлементСхемы);	
	
	УстановитьВидимостьДоверенности();
	
	ЗаполнитьТекстСопроводительнойЗаписки(ЭлементСхемы);
	
	ОбновитьПредставлениеЭлектронногоДокумента();
	
	ИнтерфейсДокументовЭДОКлиентСервер.РазблокироватьЗаблокированныеЭлементыФормы(ЭтотОбъект, ЭтотОбъект.ЗаблокированныеЭлементыФормы);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД
	ОбновляемыеКатегории = Новый Массив;	
	ОбновляемыеКатегории.Добавить(КонтекстныеПодсказкиБЭДКатегоризацияВызовСервера.Категория_СтатусДокументооборота());

	СформироватьКонтекст(ОбновляемыеКатегории);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами.КонтекстныеПодсказкиБЭД	
	
	ЭтотОбъект.Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаПолучениеЭДЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ОбновитьСостояниеЭД.Картинка = БиблиотекаКартинок.Обновить;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиПодписейДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьСтраницуПодписей();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевыхРеквизитов()
	
	КлючНастройкиОтправки = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
	КлючНастройкиОтправки.ВидДокумента = Объект.ВидДокумента;
	КлючНастройкиОтправки.Отправитель = Объект.Организация;
	КлючНастройкиОтправки.Получатель = Объект.Контрагент;
	КлючНастройкиОтправки.Договор = Объект.ДоговорКонтрагента;
	
	НастройкиОтправки = НастройкиЭДО.НастройкиОтправки(КлючНастройкиОтправки);
	
	Объект.ТребуетсяПодтверждение = ?(ЗначениеЗаполнено(НастройкиОтправки), 
		НастройкиОтправки.ТребуетсяОтветнаяПодпись, Ложь);
	Объект.ТребуетсяИзвещение = ?(ЗначениеЗаполнено(НастройкиОтправки), 
		НастройкиОтправки.ТребуетсяИзвещениеОПолучении, Ложь);
	Объект.ИдентификаторОрганизации = ?(ЗначениеЗаполнено(НастройкиОтправки), 
		НастройкиОтправки.ИдентификаторОтправителя, "");
	Объект.ИдентификаторКонтрагента = ?(ЗначениеЗаполнено(НастройкиОтправки), 
		НастройкиОтправки.ИдентификаторПолучателя, "");
	Объект.СпособОбмена = ?(ЗначениеЗаполнено(НастройкиОтправки), 
		НастройкиОтправки.СпособОбмена, Неопределено);
	Объект.ОбменБезПодписи = ?(ЗначениеЗаполнено(НастройкиОтправки),
		НастройкиОтправки.ОбменБезПодписи, Ложь);
	Объект.МаршрутПодписания = ?(ЗначениеЗаполнено(НастройкиОтправки),
		НастройкиОтправки.МаршрутПодписания, Неопределено);
	Объект.ФорматОсновногоТитула = ?(ЗначениеЗаполнено(НастройкиОтправки), 
		НастройкиОтправки.Формат, "");
	Объект.ВидПодписи = Перечисления.ВидыЭлектронныхПодписей.УсиленнаяКвалифицированная;
	
	МаршрутРедактируетсяПриСоздании = ?(ЗначениеЗаполнено(НастройкиОтправки), 
		НастройкиОтправки.МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутУказыватьПриСоздании(), 
		Не ЗначениеЗаполнено(Объект.МаршрутПодписания));
		
	Если Объект.МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутУказыватьПриСоздании() Тогда
		Объект.МаршрутПодписания = Неопределено;
	КонецЕсли;
	
	Объект.СписокПодписантов.Очистить();

	Элементы.ПодменюДобавитьДокументыВПакет.Видимость = СоставПакета.Количество() <= 1
		И ДоступноИзменениеПакета
		И Объект.СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО;
	
	ОбновитьОтображениеМаршрутаПодписания();
	
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВложениеИзТабличногоДокумента(ТабличныйДокумент, НаименованиеФайла)
	
	Поток = Новый ПотокВПамяти;
	ТабличныйДокумент.Записать(Поток, ТипФайлаТабличногоДокумента.PDF);
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(НаименованиеФайла) Тогда 
		Наименование = НаименованиеФайла;   
	Иначе
		Если Основания.Количество() = 0 Тогда
			ФайлДляПолученияИмени = Новый Файл(ПолучитьИмяВременногоФайла());
			Наименование = ФайлДляПолученияИмени.ИмяБезРасширения;
		Иначе
			Наименование = СтрЗаменить(Строка(Основания[0].Значение), " ", "_");
		КонецЕсли;
	КонецЕсли;	
	
	Объект.Комментарий = Наименование;
	
	Наименование = РаботаСФайламиБЭД.ПреобразоватьИмяФайлаСУчетомТранслитерации(Наименование,
		ОтключитьТранслитерацию);
	Наименование = РаботаСФайламиБЭДКлиентСервер.ДопустимоеИмяФайла(Наименование, Истина);
	
	Расширение = "pdf";
	ИмяФайла = СтрШаблон("%1.%2", Наименование, Расширение);
	
	ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);	
	
	ЭлементСхемы.АдресФайла = АдресВХранилище;
	ЭлементСхемы.ИмяФайла = ИмяФайла;
	ЭлементСхемы.РасширениеФайла = Расширение;
	
	ПодготовитьПредставлениеФайла(ЭлементСхемы);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВложениеИзДвоичныхДанных(ДвоичныеДанные, НаименованиеФайла, Расширение)
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	Объект.Комментарий = НаименованиеФайла;
	
	НаименованиеФайла = РаботаСФайламиБЭД.ПреобразоватьИмяФайлаСУчетомТранслитерации(НаименованиеФайла,
		ОтключитьТранслитерацию);
	НаименованиеФайла = РаботаСФайламиБЭДКлиентСервер.ДопустимоеИмяФайла(НаименованиеФайла, Истина);
	
	НаименованиеФайла = СтрШаблон("%1.%2", НаименованиеФайла, Расширение);
	
	ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);	
	
	ЭлементСхемы.АдресФайла = АдресВХранилище;
	ЭлементСхемы.ИмяФайла = НаименованиеФайла;
	ЭлементСхемы.РасширениеФайла = Расширение;
	
	ПодготовитьПредставлениеФайла(ЭлементСхемы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущийДокументПакета(Документ)
	ОбъектДокумента = Документ.ПолучитьОбъект();
	ЗначениеВДанныеФормы(ОбъектДокумента, Объект);
	ЭтотОбъект.Прочитать();
	
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеМаршрутаПодписания()
	
	Если ЗначениеЗаполнено(Объект.СписокПодписантов) Тогда
		Подписанты = Объект.СписокПодписантов.Выгрузить();
		
		ПредставлениеНастроекВыбораМаршрута = МаршрутыПодписанияБЭД.ПредставлениеМаршрутаВыбранногоВДокументе(
			Истина, Подписанты, Объект.МаршрутПодписания);
	Иначе	
		Если ЗначениеЗаполнено(Объект.МаршрутПодписания) Тогда
			ПредставлениеНастроекВыбораМаршрута = Объект.МаршрутПодписания;
		Иначе
			ПредставлениеНастроекВыбораМаршрута = МаршрутыПодписанияБЭД.ПредставлениеНеВыбранногоМаршрута();
		КонецЕсли;
	КонецЕсли;
	
	Элементы.МаршрутПодписания.Доступность = ЗначениеЗаполнено(Объект.Организация) И МаршрутРедактируетсяПриСоздании;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтраницуПодписей()
	
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
	
	ЗаполнитьПодписи(ЭлементСхемы);
	УстановитьВидимостьДоверенности();
	ЗаполнитьЗаголовокСтраницыПодписей(ЭлементСхемы);
	
КонецПроцедуры

#Область ЗаписатьДокумент

&НаКлиенте
Процедура НачатьЗаписьДокумента(ОповещениеОЗавершении)
	
	РезультатЗаписи = ЗаписатьДокументНаСервере();
	Если Не РезультатЗаписи.Отказ Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Истина);
		Возврат;
	КонецЕсли;
	
	ИнтерфейсДокументовЭДОКлиентСервер.РазблокироватьЗаблокированныеЭлементыФормы(ЭтотОбъект, ЭтотОбъект.ЗаблокированныеЭлементыФормы);
	
	Если РезультатЗаписи.РезультатПроверкиЗаполнения.Отказ
		И РезультатЗаписи.РезультатПроверкиЗаполнения.ФайлРедактируется Тогда
		Оповещение = Новый ОписаниеОповещения("ОсвободитьЗакончитьРедактированиеФайлаПередЗаписью",
			ЭтотОбъект, ОповещениеОЗавершении);
		ОсвободитьЗакончитьРедактированиеФайла(Оповещение);
		Возврат;
	КонецЕсли;
	
	Если РезультатЗаписи.РезультатПроверкиНастроек.Отказ Тогда
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПервичнуюНастройкуПередЗаписью",
			ЭтотОбъект, ОповещениеОЗавершении);
		Если РезультатЗаписи.РезультатПроверкиНастроек.ЭтоВнутреннийЭДО Тогда			
			НастройкиЭДОКлиент.НастроитьВнутреннийЭлектронныйДокументооборот(
				Объект.Организация, Объект.ВидДокумента, Оповещение);
		
		ИначеЕсли РезультатЗаписи.РезультатПроверкиНастроек.ФормированиеЗапрещено = Истина Тогда 
			ПараметрыФормы = НастройкиОтправкиЭДОКлиент.НовыеПараметрыФормыНастроекОтправки();
			ПараметрыФормы.КлючНастроекОтправки = РезультатЗаписи.РезультатПроверкиНастроек.КлючНастроекОтправки;
			
			Описание = ИнтеграцияЭДОКлиентСервер.НовоеОписаниеОбъектаУчетаСтруктура();	
			
			Описание.Направление = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Исходящий");
			Описание.Организация = Объект.Организация;
			Описание.Контрагент = Объект.Контрагент;
			Описание.Договор = Объект.ДоговорКонтрагента;
			Описание.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.Прочее");

			ОшибкиФормирования = Новый Массив;
			Ошибка = Новый Структура;			
			Ошибка.Вставить("ФормированиеЗапрещено", Истина);
			Ошибка.Вставить("ОписаниеОбъектаУчета", Описание);			
			ОшибкиФормирования.Добавить(Ошибка);
			ПараметрыОткрытия = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыПроблемПриОбработкеДокументов();
			ПараметрыОткрытия.АдресСведенийОбОшибках = ПоместитьВоВременноеХранилище(ОшибкиФормирования);
			
			ИнтерфейсДокументовЭДОКлиент.ПоказатьПроблемыПриОбработкеДокументов(Оповещение, ПараметрыОткрытия);
			
		Иначе
			НастройкиЭДОКлиент.НастроитьОбменСКонтрагентом(
				РезультатЗаписи.РезультатПроверкиНастроек.КлючНастроекОтправки, Оповещение);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(РезультатЗаписи.КонтекстДиагностики);
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсвободитьЗакончитьРедактированиеФайлаПередЗаписью(Результат, ОповещениеОЗавершении) Экспорт
	
	Если Результат = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Ложь);
	Иначе
		НачатьЗаписьДокумента(ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПервичнуюНастройкуПередЗаписью(Результат, ОповещениеОЗавершении) Экспорт
	
	Если Результат = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Ложь);
	Иначе
		ПриИзмененииКлючевыхРеквизитов();
		НачатьЗаписьДокумента(ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьДокументНаСервере()
	
	РезультатЗаписи = Новый Структура;
	РезультатЗаписи.Вставить("Отказ", Ложь);
	РезультатЗаписи.Вставить("РезультатПроверкиЗаполнения", НовыйРезультатПроверкиЗаполнения());
	РезультатЗаписи.Вставить("РезультатПроверкиНастроек", НовыйРезультатПроверкиНастроекОтправки());
	РезультатЗаписи.Вставить("КонтекстДиагностики", ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики());
	
	ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
	
	РезультатПроверки = ПроверитьЗаполнениеДокумента(ЭлементСхемы);
	Если РезультатПроверки.Отказ Тогда
		РезультатЗаписи.Отказ = Истина;
		РезультатЗаписи.РезультатПроверкиЗаполнения = РезультатПроверки;
		Возврат РезультатЗаписи;
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ЭтоНовыйДокумент", Не ЗначениеЗаполнено(Объект.Ссылка));
	ПараметрыЗаписи.Вставить("КонтекстДиагностики", РезультатЗаписи.КонтекстДиагностики);
	
	Если ПараметрыЗаписи.ЭтоНовыйДокумент Или Модифицированность Тогда
		
		РезультатПроверкиНастроек = ПроверитьНастройки();

		Если РезультатПроверкиНастроек.Отказ Тогда
			РезультатЗаписи.Отказ = Истина;
			РезультатЗаписи.РезультатПроверкиНастроек = РезультатПроверкиНастроек;
			Возврат РезультатЗаписи;
		КонецЕсли;
		ПараметрыЗаписи.Вставить("ЭлементСхемыРегламента", ЭлементСхемы);
	КонецЕсли;
	
	ПроверитьЗаполнениеДокументаПослеПроверкиНастроек(РезультатПроверки.Отказ);
	Если РезультатПроверки.Отказ Тогда
		РезультатЗаписи.Отказ = Истина;
		РезультатЗаписи.РезультатПроверкиЗаполнения = РезультатПроверки;
		Возврат РезультатЗаписи;
	КонецЕсли;
	
	Если Не Записать(ПараметрыЗаписи) Тогда
		РезультатЗаписи.Отказ = Истина;
		Возврат РезультатЗаписи;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементСхемы.АдресОписанияСообщения) Тогда
		УдалитьИзВременногоХранилища(ЭлементСхемы.АдресОписанияСообщения);
		ЭлементСхемы.АдресОписанияСообщения = "";
	КонецЕсли;
	
	Возврат РезультатЗаписи;
КонецФункции

&НаСервере
Функция ПроверитьНастройки()

	Если ЭлектронныеДокументыЭДО.ЭтоВнутреннийВидДокумента(Объект.ВидДокумента) Тогда
		РезультатПроверки = ПроверитьНастройкиВнутреннегоЭДО();
		РезультатПроверки.ЭтоВнутреннийЭДО = Истина;
	Иначе
		РезультатПроверки = ПроверитьНастройкиОтправки();
		РезультатПроверки.ЭтоВнутреннийЭДО = Ложь;
	КонецЕсли;

	Возврат РезультатПроверки;

КонецФункции

&НаКлиенте
Процедура СопроводительнаяЗапискаПриИзменении(Элемент)
	
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
	ЭлементСхемы.ДополнительнаяИнформация = СопроводительнаяЗаписка;
			
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеДокумента(ЭлементСхемыРегламента)
	
	Результат = НовыйРезультатПроверкиЗаполнения();
	
	ШаблонСообщенияОНезаполненности = НСтр("ru = 'Поле ""%1"" не заполнено. Документ не записан.
		|Заполните его и повторите запись.'");
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщенияОНезаполненности, "Организация"),
			Объект.Ссылка, "Организация", "Объект", Результат.Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщенияОНезаполненности, "Вид"),
			Объект.Ссылка, "ВидДокумента", "Объект", Результат.Отказ);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Контрагент) И Не ЭлектронныеДокументыЭДО.ЭтоВнутреннийВидДокумента(
		Объект.ВидДокумента) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщенияОНезаполненности, "Контрагент"),
			Объект.Ссылка, "Контрагент", "Объект", Результат.Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДанныеФайла = Неопределено;
	
	Если ЗначениеЗаполнено(ЭлементСхемыРегламента.ПрисоединенныйФайл) Тогда
		ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
		ПараметрыДанныхФайла.ИдентификаторФормы = УникальныйИдентификатор;
		ПараметрыДанныхФайла.ПолучатьСсылкуНаДвоичныеДанные = Ложь;
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(ЭлементСхемыРегламента.ПрисоединенныйФайл, ПараметрыДанныхФайла);
	КонецЕсли;
	
	Если ДанныеФайла = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо выбрать файл'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "НадписьИмяФайла",, Результат.Отказ);
	ИначеЕсли ДанныеФайла.ФайлРедактируется Тогда
		Результат.Отказ = Истина;
		Результат.ФайлРедактируется = ДанныеФайла.ФайлРедактируется;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеДокументаПослеПроверкиНастроек(Отказ)
	
	ШаблонСообщенияОНезаполненности = НСтр("ru = 'Поле ""%1"" не заполнено. Документ не записан.
		|Заполните его и повторите запись.'");
	
	Если Не ЗначениеЗаполнено(Объект.МаршрутПодписания) И Не ЗначениеЗаполнено(Объект.СписокПодписантов) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщенияОНезаполненности, НСтр("ru = 'Маршрут подписания'")),
			, "ПредставлениеНастроекВыбораМаршрута", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НовыйРезультатПроверкиЗаполнения()
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("ФайлРедактируется", Ложь);
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПроверитьНастройкиОтправки()
	
	Результат = НовыйРезультатПроверкиНастроекОтправки();
	
	КлючНастроекОтправки = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
	КлючНастроекОтправки.Отправитель = Объект.Организация;
	КлючНастроекОтправки.Получатель = Объект.Контрагент;
	КлючНастроекОтправки.Договор = Объект.ДоговорКонтрагента;
	КлючНастроекОтправки.ВидДокумента = Объект.ВидДокумента;
	
	НастройкиОтправки = НастройкиЭДО.НастройкиОтправки(КлючНастроекОтправки);
	Если НастройкиОтправки = Неопределено Тогда
		Результат.Отказ = Истина;

		Если НастройкиЭДО.ЕстьПравоНастройкиОбмена() Тогда
			Результат.Вставить("КлючНастроекОтправки", КлючНастроекОтправки);
		Иначе 
			ТекстСообщения = НСтр("ru = 'Не создано настроек отправки электронных документов между:
				|Организация - %1.
				|Контрагент - %2.
				|Недостаточно прав для выполнения операции, обратитесь к администратору.'");
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(ТекстСообщения, Объект.Организация, Объект.Контрагент));
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	Если Не НастройкиОтправки.Формировать Тогда
		Результат.Отказ = Истина;
		Результат.ФормированиеЗапрещено = Истина;
		
		Если НастройкиЭДО.ЕстьПравоНастройкиОбмена() Тогда
			Результат.Вставить("КлючНастроекОтправки", КлючНастроекОтправки);
		Иначе 
			ТекстСообщения = НСтр("ru = 'Запрещена отправка документов с видом %1 между:
				|Организация - %2.
				|Контрагент - %3.
				|Недостаточно прав для выполнения операции, обратитесь к администратору.'");
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(ТекстСообщения, Объект.ВидДокумента, Объект.Организация, Объект.Контрагент))	
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьНастройкиВнутреннегоЭДО()
	
	Результат = НовыйРезультатПроверкиНастроекОтправки();
	
	НастройкиФормированияВнутреннегоЭДО = ИнтерфейсДокументовЭДО.НастройкиВнутреннегоЭДО(Объект.Организация, Объект.ВидДокумента);

	Если НастройкиФормированияВнутреннегоЭДО = Неопределено Тогда
		Результат.Отказ = Истина;

		Если НастройкиЭДО.ЕстьПравоНастройкиОбмена() Тогда
			КлючНастроек = Новый Структура;
			КлючНастроек.Вставить("Организация", Объект.Организация);
			КлючНастроек.Вставить("ВидДокумента", Объект.ВидДокумента);
			
			Результат.Вставить("КлючНастроекОтправки", КлючНастроек);
		Иначе 
			ТекстСообщения = НСтр("ru = 'Не создано настроек формирования документов для:
				|Организация - %1.
				|Вид документа - %2.
				|Недостаточно прав для выполнения операции, обратитесь к администратору.'");
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(ТекстСообщения, Объект.Организация, Объект.ВидДокумента));
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	Если Не НастройкиФормированияВнутреннегоЭДО.Формировать Тогда
		Результат.Отказ = Истина;

		Если НастройкиЭДО.ЕстьПравоНастройкиОбмена() Тогда
			ТекстСообщения = НСтр("ru = 'Запрещена отправка произвольных документов между:
				|Организация - %1.
				|Вид документа - %2.
				|Включите возможность формирования произвольных документов в настройке отправки и повторите попытку.'");
		Иначе 
			ТекстСообщения = НСтр("ru = 'Запрещена отправка произвольных документов между:
				|Организация - %1.
				|Вид документа - %2.
				|Недостаточно прав для выполнения операции, обратитесь к администратору.'");
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстСообщения, Объект.Организация, Объект.ВидДокумента))	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаСервере
Функция НовыйРезультатПроверкиНастроекОтправки()
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("КлючНастроекОтправки");
	Результат.Вставить("ЭтоВнутреннийЭДО", Ложь);
	Результат.Вставить("ФормированиеЗапрещено", Ложь);
	
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭлементСхемыИнформацияОтправителя(Форма)
	Возврат Форма.СхемаРегламента.ПолучитьЭлементы()[0];
КонецФункции

&НаСервере
Функция ОписаниеСообщения(ЭлементСхемыРегламента)
	
	Если ЗначениеЗаполнено(ЭлементСхемыРегламента.АдресОписанияСообщения) Тогда
		ОписаниеСообщения = ПолучитьИзВременногоХранилища(ЭлементСхемыРегламента.АдресОписанияСообщения);
	Иначе
		ОписаниеСообщения = ОписаниеСообщенияПроизвольногоФормата(ЭлементСхемыРегламента);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОписаниеСообщения.Данные.Содержание) Тогда
		СодержаниеСообщения = ЭлектронныеДокументыЭДО.НовоеСодержаниеСообщения();
		
		СодержаниеСообщения.ТипРегламента = Перечисления.ТипыРегламентовЭДО.Неформализованный;
		СодержаниеСообщения.НомерДокумента = Объект.НомерДокумента;
		СодержаниеСообщения.ДатаДокумента = Объект.ДатаДокумента;
		СодержаниеСообщения.СуммаДокумента = Объект.СуммаДокумента;
		СодержаниеСообщения.ЕстьМаркировка = Ложь;
		
		ОписаниеСообщения.Данные.Содержание = СодержаниеСообщения;
	КонецЕсли;
	
	ОписаниеСообщения.ДополнительнаяИнформация = ЭлементСхемыРегламента.ДополнительнаяИнформация;
	
	Возврат ОписаниеСообщения;
	
КонецФункции

&НаСервере
Функция ОписаниеСообщенияПроизвольногоФормата(ЭлементСхемыРегламента)
	
	ОписаниеСообщения = ЭлектронныеДокументыЭДО.НовоеОписаниеСообщения();
	ОписаниеСообщения.ТипЭлементаРегламента = ЭлементСхемыРегламента.ТипЭлементаРегламента;
	ОписаниеСообщения.Направление = ЭлементСхемыРегламента.Направление;
	ОписаниеСообщения.ДополнительнаяИнформация = ЭлементСхемыРегламента.ДополнительнаяИнформация;
	ОписаниеСообщения.ВидСообщения = Объект.ВидДокумента;
	
	ОписаниеСообщения.Данные.Документ.ДвоичныеДанные = ПолучитьИзВременногоХранилища(ЭлементСхемыРегламента.АдресФайла);
	ОписаниеСообщения.Данные.Документ.ИмяФайла = ЭлементСхемыРегламента.ИмяФайла;
	
	Возврат ОписаниеСообщения;
	
КонецФункции

&НаСервере
Процедура УстановитьНовыйНомерДокумента(ТекущийОбъект)
	
	Если Не ТекущийОбъект.ЭтоНовый()
		ИЛИ ЗначениеЗаполнено(Объект.НомерДокумента)
		ИЛИ ЭлементСхемыИнформацияОтправителя(ЭтотОбъект).ФормированиеПоОбъектуУчета Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущийОбъект.Номер) Тогда
		ТекущийОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	Объект.НомерДокумента = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(ТекущийОбъект.Номер, "0");
	
КонецПроцедуры

&НаСервере
Функция АдресДанныхСертификата(НомерСтроки)
	
	СсылкаНаХранилищеДанныхСертификата = Неопределено;
	Сертификат = Подписи[НомерСтроки].Сертификат;
	
	Если Сертификат <> Неопределено Тогда
		ДвоичныеДанныеСертификата = Подписи[НомерСтроки].Сертификат.Получить();
		СсылкаНаХранилищеДанныхСертификата = ПоместитьВоВременноеХранилище(ДвоичныеДанныеСертификата, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат СсылкаНаХранилищеДанныхСертификата;
	
КонецФункции

#КонецОбласти

#Область РаботаСВложением

&НаКлиенте
Процедура ДобавитьВложениеИзФайлаНаДискеЗавершить(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла <> Неопределено И ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено = Ложь Тогда
		ПроверитьИВложитьФайл(ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя, ОписаниеПомещенногоФайла.Адрес);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложениеИзФайлаОснования(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(Результат, Новый УникальныйИдентификатор, Истина);
		ПроверитьИВложитьФайл(ДанныеФайла.ИмяФайла, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИВложитьФайл(ПолноеИмяФайла, АдресВХранилище)
	
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолноеИмяФайла);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроверитьИВложитьФайлЗавершение", ЭтотОбъект, АдресВХранилище);
	РаботаСФайламиБЭДКлиент.СкорректироватьИмяФайлаСУчетомКодировки(ОповещениеОЗавершении, СтруктураИмениФайла.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИВложитьФайлЗавершение(ИмяФайла, АдресВХранилище) Экспорт
	Если ИмяФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДобавитьВложениеИзФайлаНаСервере(ИмяФайла, АдресВХранилище);
КонецПроцедуры

&НаСервере
Процедура ДобавитьВложениеИзФайлаНаСервере(Знач ИмяФайла, Знач АдресВХранилище)
	
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
	Если ЭлементСхемы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИмяФайла = РаботаСФайламиБЭД.ПреобразоватьИмяФайлаСУчетомТранслитерации(ИмяФайла, ОтключитьТранслитерацию);
	
	РасширениеФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла);
	
	ЭлементСхемы.АдресФайла = АдресВХранилище;
	ЭлементСхемы.ИмяФайла = ИмяФайла;
	ЭлементСхемы.РасширениеФайла = СтрЗаменить(РасширениеФайла, ".", "");
	
	ПодготовитьПредставлениеФайла(ЭлементСхемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлВложения(ДляРедактирования = Ложь)
	
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		И ЗначениеЗаполнено(ЭлементСхемы.АдресФайла) Тогда
		Оповещение = Новый ОписаниеОповещения("ОткрытьФайлВложенияПослеВопроса", ЭтотОбъект, ДляРедактирования);
		ТекстВопроса = НСтр("ru = 'Для продолжения операции необходимо записать документ.
			|Записать документ?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	ИначеЕсли ЗначениеЗаполнено(ЭлементСхемы.ПрисоединенныйФайл) Тогда
		
		ИнтерфейсДокументовЭДОКлиент.ОткрытьФайл(ЭлементСхемы.ПрисоединенныйФайл, УникальныйИдентификатор, ДляРедактирования);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлВложенияПослеВопроса(Ответ, ДляРедактирования) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФайлВложенияПослеЗаписи", ЭтотОбъект, ДляРедактирования);
	НачатьЗаписьДокумента(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлВложенияПослеЗаписи(ФайлВложенияЗаписан, ДляРедактирования) Экспорт
	
	Если ФайлВложенияЗаписан Тогда
		ЗаполнитьДанныеТекущегоЭлектронногоДокумента();
		
		ЭлементСхемы = Элементы.СхемаРегламента.ТекущиеДанные;
		Если ЭлементСхемы = Неопределено Тогда
			ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
		КонецЕсли;
		ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ЭлементСхемы.ПрисоединенныйФайл, УникальныйИдентификатор,, ДляРедактирования);
		
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, ДляРедактирования);
		ПодготовитьПредставлениеФайлаНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПредставлениеФайлаНаСервере()
	
	ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
	Если ЭлементСхемы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьПредставлениеФайла(ЭлементСхемы);
		
КонецПроцедуры

&НаКлиенте
Процедура ОсвободитьЗакончитьРедактированиеФайла(ОповещениеОЗавершении)
	
	ЭлементСхемы = Элементы.СхемаРегламента.ТекущиеДанные;
	
	Оповещение = Новый ОписаниеОповещения("ОсвободитьЗакончитьРедактированиеФайлаПослеВопроса",
		ЭтотОбъект, ОповещениеОЗавершении);
	ТекстВопроса = НСтр("ru = 'Вложение ""%1"" захвачено для редактирования.
		|Для продолжения надо завершить редактирование.'");
	ТекстВопроса = СтрЗаменить(ТекстВопроса, "%1", ЭлементСхемы.ИмяФайла);
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("ЗакончитьРедактирование", НСтр("ru = 'Закончить редактирование'"));
	СписокКнопок.Добавить("Освободить",              НСтр("ru = 'Отменить редактирование'"));
	СписокКнопок.Добавить("Отменить",                НСтр("ru = 'Отменить'"));
	ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсвободитьЗакончитьРедактированиеФайлаПослеВопроса(Результат, ОповещениеОЗавершении) Экспорт
	
	Если Результат = "Освободить" Тогда
		ОсвободитьФайл(ОповещениеОЗавершении);
	ИначеЕсли Результат = "ЗакончитьРедактирование" Тогда
		ЗакончитьРедактированиеФайла(ОповещениеОЗавершении);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьРедактированиеФайла(ОповещениеОЗавершении)
	
	ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
	ПараметрыОбновленияФайла = РаботаСФайламиСлужебныйКлиент.ПараметрыОбновленияФайла(
		ОповещениеОЗавершении, ЭлементСхемы.ПрисоединенныйФайл, УникальныйИдентификатор);
	
	РаботаСФайламиСлужебныйКлиент.ЗакончитьРедактированиеСОповещением(ПараметрыОбновленияФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсвободитьФайл(ОповещениеОЗавершении)
	
	ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
	ПараметрыОсвобожденияФайла = РаботаСФайламиСлужебныйКлиент.ПараметрыОсвобожденияФайла(
		ОповещениеОЗавершении, ЭлементСхемы.ПрисоединенныйФайл);
	
	РаботаСФайламиСлужебныйКлиент.ОсвободитьФайлСОповещением(ПараметрыОсвобожденияФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиОтправки(Команда)
	
	КлючНастроекОтправки = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
	КлючНастроекОтправки.Отправитель = Объект.Организация;
	КлючНастроекОтправки.Получатель = Объект.Контрагент;
	КлючНастроекОтправки.Договор = Объект.ДоговорКонтрагента;
	КлючНастроекОтправки.ВидДокумента = Объект.ВидДокумента;
	
	Оповещение = Новый ОписаниеОповещения("ПослеИзмененияНастроекОтправки", ЭтотОбъект);
	
	ПараметрыОткрытия = НастройкиЭДОКлиент.НовыеПараметрыТранспортныхНастроек();
	ПараметрыОткрытия.КлючНастроек = КлючНастроекОтправки;
	ПараметрыОткрытия.ИдентификаторОтправителя = Объект.ИдентификаторОрганизации;
	ПараметрыОткрытия.ИдентификаторПолучателя = Объект.ИдентификаторКонтрагента;
	ПараметрыОткрытия.НастройкаДокумента = Истина;
	НастройкиЭДОКлиент.ОткрытьТранспортныеНастройкиОтправки(ПараметрыОткрытия, ЭтотОбъект, Оповещение, НастройкаОтправки());

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьНастройкиФормирования(Команда)
	
	КлючНастроекОтправки = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
	КлючНастроекОтправки.Отправитель = Объект.Организация;
	КлючНастроекОтправки.Получатель = Объект.Контрагент;
	КлючНастроекОтправки.Договор = Объект.ДоговорКонтрагента;
	КлючНастроекОтправки.ВидДокумента = Объект.ВидДокумента;
	
	Оповещение = Новый ОписаниеОповещения("ПослеИзмененияНастроекОтправки", ЭтотОбъект);
	НастройкиЭДОКлиент.НастроитьРегламентЭДО(КлючНастроекОтправки, ЭтотОбъект, Оповещение, Истина, НастройкаОтправки());
	
КонецПроцедуры

&НаСервере
Функция НастройкаОтправки()
	
	Настройка = НастройкиЭДОКлиентСервер.НоваяНастройкаОтправки();
	Настройка.ИдентификаторОтправителя = Объект.ИдентификаторОрганизации;
	Настройка.ИдентификаторПолучателя = Объект.ИдентификаторКонтрагента;
	Настройка.ВидДокумента = Объект.ВидДокумента;
	Настройка.ВыгружатьДополнительныеСведения = Объект.ВыгружатьДополнительныеСведения;
	Настройка.Договор = Объект.ДоговорКонтрагента;
	Настройка.МаршрутПодписания = Объект.МаршрутПодписания;
	Настройка.ОбменБезПодписи = Объект.ОбменБезПодписи;
	Настройка.Отправитель = Объект.Организация;
	Настройка.Получатель = Объект.Контрагент;
	Настройка.СпособОбмена = Объект.СпособОбмена;
	Настройка.ТребуетсяИзвещениеОПолучении = Объект.ТребуетсяИзвещение;
	Настройка.ТребуетсяОтветнаяПодпись = Объект.ТребуетсяПодтверждение;
	Настройка.ЭтоНастройкаОтправки = Истина;
	
	ЭлементСхемы = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
	РезультатРаспознания = ЭлектронныеДокументыЭДО.РаспознатьСообщение(ЭлементСхемы.Сообщение);
	
	Если ЗначениеЗаполнено(РезультатРаспознания) Тогда
		Настройка.Формат = РезультатРаспознания.ИсходныйФормат;
	КонецЕсли;
	Возврат Настройка;
	
КонецФункции

&НаКлиенте
Процедура ПослеИзмененияНастроекОтправки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	
	ЭлементСхемыИнформацияОтправителя = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
	Если Не ЭлементСхемыИнформацияОтправителя.ФормированиеПоОбъектуУчета Тогда
		ПослеИзмененияНастроекОтправкиПроизвольногоДокумента(Результат);
	Иначе
		
		ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
		ПараметрыПереформирования = ИнтерфейсДокументовЭДОВызовСервера.ПараметрыПереформированияДокумента(ЭлементСхемы.Сообщение);
		ПараметрыПереформирования.Вставить("ИдентификаторПакета", ИдентификаторПакета);
		ПараметрыПереформирования.Вставить("ОбъектУчета", Основания[0].Значение);
		ПараметрыПереформирования.Вставить("Настройки", Результат);
		ПараметрыПереформирования.Вставить("Комментарий", НСтр("ru = 'Изменение настроек формирования'"));
	
		Оповещение = Новый ОписаниеОповещения("ПереформированиеЗавершениеФормированияЭлектронногоДокумента", ЭтотОбъект, ПараметрыПереформирования);
		ИнтерфейсДокументовЭДОКлиент.ПереформироватьДокумент(Оповещение, ПараметрыПереформирования);
		
	КонецЕсли;
	ЭлементСхемыИнформацияОтправителя = ЭлементСхемыИнформацияОтправителя(ЭтотОбъект);
	
	Если ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(КонтекстДиагностики) Тогда
		ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);
	ИначеЕсли ЭлементСхемыИнформацияОтправителя.ФормированиеПоОбъектуУчета Тогда	
		ОбновитьДанныеДокументаЗавершениеФормированияЭлектронногоДокумента();
	Иначе
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеИзмененияНастроекОтправкиПроизвольногоДокумента(Настройки)
	
	Если Настройки <> Неопределено Тогда
			
		Объект.ИдентификаторОрганизации = Настройки.ИдентификаторОтправителя;
		Объект.ИдентификаторКонтрагента = Настройки.ИдентификаторПолучателя;
		Объект.ТребуетсяИзвещение = Настройки.ТребуетсяИзвещениеОПолучении;
		Объект.ТребуетсяПодтверждение = Настройки.ТребуетсяОтветнаяПодпись;
			
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("ЭтоНовыйДокумент", Не ЗначениеЗаполнено(Объект.Ссылка));
			
		Записать(ПараметрыЗаписи);	
			
		ПриСозданииЧтенииНаСервере();
					
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПереформированиеЗавершениеФормированияЭлектронногоДокумента(Результат, Контекст) Экспорт
	
	Если ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(Результат.КонтекстДиагностики) Тогда
		ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(Результат.КонтекстДиагностики);
	Иначе
		ОбновитьДанныеДокументаЗавершениеФормированияЭлектронногоДокумента();
		
		Если Результат.Переформирован Тогда
			ПоказатьОповещениеПользователя(НСтр("ru = 'Переформирование'"),,
			НСтр("ru = 'Сформирован новый документ'"), БиблиотекаКартинок.ЭмблемаСервиса1СЭДО48, СтатусОповещенияПользователя.Информация);
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Документ переформирован'"));
			
			Оповестить(ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияТекущихДелЭДО());
			Оповестить(ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияСостоянияЭДО());
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеДокументаЗавершениеФормированияЭлектронногоДокумента()
	
	АктуальныйЭлектронныйДокумент = ИнтеграцияЭДО.АктуальныйЭлектронныйДокументОбъектаУчета(
		Основания.ВыгрузитьЗначения()[0], Объект.ВидДокумента, Объект.Контрагент, Объект.ДоговорКонтрагента);
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	Если ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ПакетыДокументовЭДО.ДобавитьДокументВПакет(ИдентификаторПакета, АктуальныйЭлектронныйДокумент, КонтекстДиагностики);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АктуальныйЭлектронныйДокумент) Тогда
		ЗначениеВРеквизитФормы(АктуальныйЭлектронныйДокумент.ПолучитьОбъект(), "Объект");
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутПодписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	АдресХраненияНастроек = ПолучитьАдресХраненияНастроекВыбораМаршрута();
	
	Если АдресХраненияНастроек <> Неопределено Тогда
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборМаршрутаПодписания", ЭтотОбъект);
		МаршрутыПодписанияБЭДКлиент.ОткрытьВыборМаршрутаПодписанияПоПараметрам(ЭтотОбъект, АдресХраненияНастроек, Объект.ВидПодписи, 
			Объект.Организация, ОповещениеОЗакрытии);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборМаршрутаПодписания(АдресХраненияНастроек, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(АдресХраненияНастроек) = Тип("Строка") И ЗначениеЗаполнено(АдресХраненияНастроек) Тогда
		ОбработатьПолученныеНастройкиВыбораМаршрутов(АдресХраненияНастроек);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПолученныеНастройкиВыбораМаршрутов(АдресНастроек)

	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	УдалитьИзВременногоХранилища(АдресНастроек);
	
	ПредставлениеНастроекВыбораМаршрута = Настройки.ПредставлениеНастроек;
	Объект.СписокПодписантов.Очистить();
	Если Настройки.ЗадаватьМаршрутВручную Тогда
		Объект.МаршрутПодписания = Справочники.МаршрутыПодписания.УказыватьПриСоздании;
		
		Для Каждого Подписант Из Настройки.Подписанты Цикл
			СтрокаПодписанта = Объект.СписокПодписантов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПодписанта, Подписант);
		КонецЦикла;
	Иначе	
	    Объект.МаршрутПодписания = Настройки.Маршрут;
	КонецЕсли;
	
	ОбновитьОтображениеМаршрутаПодписания();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХраненияНастроекВыбораМаршрута()	
	
	Запрос = Новый Запрос;
	
	Отбор = КриптографияБЭД.НовыйОтборСертификатов();
	Отбор.Организация = объект.Организация;
	ЗапросДействующихСертификатов = КриптографияБЭД.ЗапросДействующихСертификатов("ДействующиеСертификаты", Отбор);
	
	МассивВспомогательныхЗапросов = Новый Массив;
	МассивВспомогательныхЗапросов.Добавить(ЗапросДействующихСертификатов);
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ДействующиеСертификаты.Ссылка КАК Сертификат ИЗ ДействующиеСертификаты КАК ДействующиеСертификаты";
		
	Запрос.Текст = ТекстЗапроса;
	
	ИтоговыйЗапрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, МассивВспомогательныхЗапросов);
	ДоступныеДляВыбораСертификаты = ИтоговыйЗапрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сертификат");	

	ЗадаватьМаршрутВручную = (Не ЗначениеЗаполнено(Объект.МаршрутПодписания) 
		ИЛИ Объект.МаршрутПодписания = Справочники.МаршрутыПодписания.УказыватьПриСоздании) 
		И Объект.СписокПодписантов.Количество();
	Подписанты = Объект.СписокПодписантов.Выгрузить();
	
	Возврат МаршрутыПодписанияБЭД.СохранитьНастройкиВыбораМаршрута(ЭтотОбъект, ЗадаватьМаршрутВручную, 
		Подписанты, Объект.МаршрутПодписания, ДоступныеДляВыбораСертификаты);

КонецФункции

#КонецОбласти

#Область Переформирование

#Область КонтекстныеПодсказки

&НаКлиенте
Процедура Подключаемый_ПанельКонтекстныхНовостей_ЭлементУправленияНажатие(Элемент)
	
	КонтекстныеПодсказкиБЭДКлиент.ЭлементУправленияНажатие(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКонтекст(КатегорииПересчета = Неопределено) 
	
	Если Не КонтекстныеПодсказкиБЭД.ФункционалКонтекстныхПодсказокДоступен() Тогда 
		Возврат;
	КонецЕсли;  

	Категория = КонтекстныеПодсказкиБЭДКатегоризацияВызовСервера.Категория_СтатусДокументооборота();
	Если ЗначениеЗаполнено(Категория)  
			И ?(ЗначениеЗаполнено(КатегорииПересчета), КатегорииПересчета.Найти(Категория) <> Неопределено, Истина) Тогда 
		Значение = КонтекстныеПодсказкиБЭДКатегоризация.ЗначениеСостоянияВерсииЭД(СостояниеЭДО); 
		КонтекстныеПодсказкиБЭДКлиентСервер.УстановитьЗначениеКатегорииКонтекстаФормы(ЭтаФорма, Категория, Значение);
	КонецЕсли;  
	
	Категория = КонтекстныеПодсказкиБЭДКатегоризацияВызовСервера.Категория_ВидЭлектронногоДокумента();
	Если ЗначениеЗаполнено(Категория)  
			И ?(ЗначениеЗаполнено(КатегорииПересчета), КатегорииПересчета.Найти(Категория) <> Неопределено, Истина) Тогда 
		ОписаниеВидаДокумента = ЭлектронныеДокументыЭДО.ОписаниеВидаДокумента(Объект.ВидДокумента);
		Значение = КонтекстныеПодсказкиБЭДКатегоризация.ЗначениеВидаЭД(ОписаниеВидаДокумента.ТипДокумента); 
		КонтекстныеПодсказкиБЭДКлиентСервер.УстановитьЗначениеКатегорииКонтекстаФормы(ЭтаФорма, Категория, Значение);
	КонецЕсли; 
	
	Категория = КонтекстныеПодсказкиБЭДКатегоризацияВызовСервера.Категория_ОператорАбонента();
	Если ЗначениеЗаполнено(Категория)  
			И ?(ЗначениеЗаполнено(КатегорииПересчета), КатегорииПересчета.Найти(Категория) <> Неопределено, Истина) Тогда 
		Значение = КонтекстныеПодсказкиБЭДКатегоризация.ОператорАбонента(Объект.ИдентификаторКонтрагента); 
		КонтекстныеПодсказкиБЭДКлиентСервер.УстановитьЗначениеКатегорииКонтекстаФормы(ЭтаФорма, Категория, Значение);
	КонецЕсли;
	
	Категория = КонтекстныеПодсказкиБЭДКатегоризацияВызовСервера.Категория_КодОператораУчетнойЗаписиОрганизации();
	Если ЗначениеЗаполнено(Категория)  
			И ?(ЗначениеЗаполнено(КатегорииПересчета), КатегорииПересчета.Найти(Категория) <> Неопределено, Истина) Тогда 
		Значение = КонтекстныеПодсказкиБЭДКатегоризация.КодОператораУчетнойЗаписиОрганизации(Объект.Организация); 
		КонтекстныеПодсказкиБЭДКлиентСервер.УстановитьЗначениеКатегорииКонтекстаФормы(ЭтаФорма, Категория, Значение);
	КонецЕсли;
	
	Категория = КонтекстныеПодсказкиБЭДКатегоризацияВызовСервера.Категория_СуществуютНеверныеПодписиФайла();
	Если ЗначениеЗаполнено(Категория)  
			И ?(ЗначениеЗаполнено(КатегорииПересчета), КатегорииПересчета.Найти(Категория) <> Неопределено, Истина) Тогда 
		ЭлементСхемы = СхемаРегламента.НайтиПоИдентификатору(ИдентификаторТекущегоЭлемента);
		Значение = КонтекстныеПодсказкиБЭДКатегоризация.СуществуютНеверныеПодписиФайла(ЭлементСхемы.Сообщение); 
		КонтекстныеПодсказкиБЭДКлиентСервер.УстановитьЗначениеКатегорииКонтекстаФормы(ЭтаФорма, Категория, Значение);
	КонецЕсли;
	
	Категория = КонтекстныеПодсказкиБЭДКатегоризацияВызовСервера.Категория_СтатусОтраженияЭДВУчете();
	Если ЗначениеЗаполнено(Категория)  
			И ?(ЗначениеЗаполнено(КатегорииПересчета), КатегорииПересчета.Найти(Категория) <> Неопределено, Истина) Тогда 
		Значение = КонтекстныеПодсказкиБЭДКатегоризация.СтатусКонтроляОтраженияВУЧете(Объект.Ссылка); 
		КонтекстныеПодсказкиБЭДКлиентСервер.УстановитьЗначениеКатегорииКонтекстаФормы(ЭтаФорма, Категория, Значение);
	КонецЕсли;

	КонтекстныеПодсказкиБЭД.ОтобразитьАктуальныеДляКонтекстаНовости(ЭтотОбъект);
	
КонецПроцедуры

// Процедура показывает новости, требующие прочтения (важные и очень важные).
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии()

	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";	
	КонтекстныеПодсказкиБЭДКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриОткрытии(ЭтотОбъект, ИдентификаторыСобытийПриОткрытии);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПанельКонтекстныхНовостейОбработкаНавигационнойСсылки(Элемент, ПараметрНавигационнаяСсылка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	КонтекстныеПодсказкиБЭДКлиент.ПанельКонтекстныхНовостей_ЭлементПанелиНовостейОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		Элемент,
		ПараметрНавигационнаяСсылка,
		СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти  

#КонецОбласти

#Область РаботаСПакетом

&НаСервере
Функция СоставПакета_ОбработкаНавигационнойСсылкиНаСервере(Знач НавигационнаяСсылка)
	
	Возврат ПакетыДокументовЭДО.СоставПакета_ОбработкаНавигационнойСсылкиНаСервере(ЭтотОбъект, НавигационнаяСсылка);
	
КонецФункции

#КонецОбласти

#КонецОбласти