
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
//
// Параметры:
//  ДрайвераОборудования - см. МенеджерОборудования.НоваяТаблицаПоставляемыхДрайверовОборудования
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID;
	Драйвер.ИмяДрайвера  = "ДрайверERFIDСчитывательRFID";
	Драйвер.Наименование = НСтр("ru = 'ERFID:Считыватель RFID'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "RFIDReader"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID;
	Драйвер.ИмяДрайвера  = "ДрайверКлеверенсСчитывателиRFID";
	Драйвер.Наименование = НСтр("ru = 'Клеверенс:Считыватели RFID'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "Cleverence.TO_RFID"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID;
	Драйвер.ИмяДрайвера  = "ДрайверСканкодСчитывательRFIDCipherLab";
	Драйвер.Наименование = НСтр("ru = 'Сканкод:Считыватели RFID Cipher Lab'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CipherLab186x"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID;
	Драйвер.ИмяДрайвера  = "ДрайверISBCСчитывательRFID";
	Драйвер.Наименование = НСтр("ru = 'ISBC:Считыватель RFID'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "RFIDDevice"; 
	
КонецПроцедуры

#КонецОбласти
