
Процедура had_КонтрольСтатьиРасходовВАрхивеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	// Профрешение 21.12.2023 {
	Если Не РольДоступна("had_УстановкаСтатьиРасходовИзАрхива") Тогда
		
		СтатьиРасходов = Источник.Товары.ВыгрузитьКолонку("СтатьяРасходов"); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СтатьиРасходов.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|ГДЕ
		|	СтатьиРасходов.Ссылка В ИЕРАРХИИ(&Архив)
		|	И СтатьиРасходов.Ссылка В(&СтатьиРасходов)"; 
		Запрос.УстановитьПараметр("Архив", 			ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("0Б-000122"));  
		Запрос.УстановитьПараметр("СтатьиРасходов", СтатьиРасходов);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда    
			ОбщегоНазначения.СообщитьПользователю("#Проведение " + Источник);
			ОбщегоНазначения.СообщитьПользователю("Запрещено проводить списание с использованием архивных статей.",,,, Отказ);
			Возврат;
		КонецЕсли;	
		
	КонецЕсли;  
	// } Профрешение

КонецПроцедуры
