#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

Функция ЗначениеПоУмолчанию() Экспорт
	Возврат "https://api.1cbn.ru";
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// ОБНОВЛЕНИЕ ИНФОРМАЦИОННОЙ БАЗЫ
#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьЗначениеПоУмолчанию() Экспорт
	
	Установить(ЗначениеПоУмолчанию());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли