#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = МашиночитаемыеДоверенности.ПредставлениеОбъекта(ЭтотОбъект);
	МЧД = Справочники.МашиночитаемыеДоверенностиКонтрагентов.НайтиПоРеквизиту("НомерДоверенности", НомерДоверенности);
	
	Если ЗначениеЗаполнено(МЧД) И Ссылка <> МЧД Тогда
		
		ДополнительныеСвойства.Вставить("МЧД", МЧД);
		ТекстСообщения = НСтр("ru = 'Доверенность с таким номером уже существует'") + ": " + НомерДоверенности;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Отозвана И Не ЗначениеЗаполнено(ДатаОтзыва) Тогда
		ДатаОтзыва = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не Отозвана И ЗначениеЗаполнено(ДатаОтзыва) Тогда
		ДатаОтзыва = Дата(1, 1, 1);	
	КонецЕсли;
	
	Если Верна И Не Подписана Тогда
		Верна = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли