
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	//// СтандартныеПодсистемы.Свойства
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", Элементы.ГруппаДополнительныеРеквизиты.Имя);
	//УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	//// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//// ИнтеграцияС1СДокументооборотом
	//Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
	//	МодульИнтеграцияС1СДокументооборот = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборот");
	//	МодульИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтотОбъект);
	//КонецЕсли;
	//// Конец ИнтеграцияС1СДокументооборотом
	//
	//// ЭлектроннаяПодпись
	//ЭлектроннаяПодписьБольничнаяАптека.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаЭлектронныеПодписи);
	//// Конец ЭлектроннаяПодпись
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	//ОбменСКонтрагентамиБольничнаяАптека.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	НастройкаФормБольничнаяАптека.ФормаДокумента_ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор=ПараметрыСеанса.ТекущийПользователь;
		Объект.Ответственный=ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
	Если НЕ Объект.Статус=Перечисления.сок_СостоянияНеформализованныхТребований.НеСогласован Тогда
		МассивЭлементов=Новый Массив;
		МассивЭлементов.Добавить("ТоварыПолноеОписание");
		МассивЭлементов.Добавить("Комментарий");
		МассивЭлементов.Добавить("ГруппаТовары");
		МассивЭлементов.Добавить("ГруппаСтраницы");
		//МассивЭлементов.Добавить("");
		Для Каждого Элемент из Элементы Цикл
			Если МассивЭлементов.Найти(Элемент.Имя)=Неопределено Тогда
				Попытка
					Элемент.ТолькоПросмотр=Истина;
				Исключение
				КонецПопытки;	
			КонецЕсли;;	
		КонецЦикла;	
	КонецЕсли;	  
	
	Если Объект.Статус=Перечисления.сок_СостоянияНеформализованныхТребований.Анулирован ИЛИ 
		 Объект.Статус=Перечисления.сок_СостоянияНеформализованныхТребований.Закрыт Тогда
		 Этаформа.ТолькоПросмотр=Истина;
	КонецЕсли;	 
		
КонецПроцедуры
