#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБНОВЛЕНИЕ ИНФОРМАЦИОННОЙ БАЗЫ
#Область ОбновлениеИнформационнойБазы

// Выполняет первоначальное заполнение справочника
//
Процедура СоздатьЦелевыеФункцииАктивовДляИнвентаризации() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Справочник.ЦелевыеФункцииАктивовДляИнвентаризации КАК ЦелевыеФункцииАктивовДляИнвентаризации
	|");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		// Материальные запасы
		Статус = Справочники.ЦелевыеФункцииАктивовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Использовать'");
		Статус.Записать();
		
		Статус = Справочники.ЦелевыеФункцииАктивовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Продолжить хранение'");
		Статус.Записать();
		
		// Основные средства
		Статус = Справочники.ЦелевыеФункцииАктивовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Введение в эксплуатацию'");
		Статус.Записать();
		
		Статус = Справочники.ЦелевыеФункцииАктивовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Ремонт'");
		Статус.Записать();
		
		Статус = Справочники.ЦелевыеФункцииАктивовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Консервация объекта'");
		Статус.Записать();
		
		Статус = Справочники.ЦелевыеФункцииАктивовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Дооснащение (дооборудование)'");
		Статус.Записать();
		
		Статус = Справочники.ЦелевыеФункцииАктивовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Списание'");
		Статус.Записать();
		
		Статус = Справочники.ЦелевыеФункцииАктивовДляИнвентаризации.СоздатьЭлемент();
		Статус.Наименование = НСтр("ru = 'Утилизация'");
		Статус.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбновлениеИнформационнойБазы

#КонецЕсли
