#Область ПрограммныйИнтерфейс

// Можно самостоятельно реализовать подписание, установив СтандартнаяОбработка в Ложь. Подпись должна быть
// добавлена в подписываемые элементы справочника ФедеральныеВебСервисыЭМД с использованием функций ПолучитьДанныеЭлектронныхПодписейИзРезультатаПодписания
// и ДобавитьПодписьДокументуВХранилищеЭМД общего модуля ФедеральныеВебСервисыРЭМД.
// ОписаниеДанных - Структура готовая для передачи в процеддуру БСП ЭлектроннаяПодписьКлиент.Подписать.
// ОбработчикЗавершения - Описание оповещение которое необходимо вызвать после завершения подписания.
Процедура ДобавитьПодписьДокументу(ОписаниеДанных, Форма, ОбработчикЗавершения, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры


// Обработчик открытия для элемента ДокументИнформационнойБазы формы ФормаЭлемента справочника ФедеральныеВебСервисыЭМД.
Процедура ОбработчикСобытияДокументИнформационнойБазыОткрытие(Форма, Элемент, ДокументИнформационнойБазы, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

