#Область Обрабтчики_запросов

/// Обработчки HTTP запроса записи на прием /hs/fws/Appointment
//
// Параметры:
//   Запрос - HTTPСервисЗапрос -
//     HTTP запрос.
//
// Возвращаемое значение:
//   HTTPСервисОтвет - HTTP ответ.
///
Функция ОбработатьЗапрос(Запрос)
	
	Возврат ФедеральныеВебСервисы.ОбработатьЗапросHTTPСервиса(Запрос);
	
КонецФункции

/// Обработчки HTTP запроса с применением JWT
//
// Параметры:
//   Запрос - HTTPСервисЗапрос -
//     HTTP запрос.
//
// Возвращаемое значение:
//   HTTPСервисОтвет - HTTP ответ.
///
Функция ОбработатьЗапросJWT(Запрос)
	
	Попытка
		
		Возврат ФедеральныеВебСервисыJWT.ОбработатьЗапросHTTPСервиса(Запрос);
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			"ФедеральныеВебСервисы.Ошибка",
			УровеньЖурналаРегистрации.Ошибка,
			,
			Запрос.ПолучитьТелоКакСтроку(),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		
	КонецПопытки;
	
	Возврат Новый HTTPСервисОтвет(500, "Application error");
	
КонецФункции

#КонецОбласти
