
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ДанныеФормыВыпускаГРЛС);
	
	Элементы.ФормаКомандаОК.Доступность = Не ТолькоПросмотр;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Модифицированность Тогда
		
		ДанныеФормыВыпускаГРЛС = Новый Структура("НаименованиеЛекарственнойФормыГРЛС, ОписаниеДозировкиГРЛС");
		ЗаполнитьЗначенияСвойств(ДанныеФормыВыпускаГРЛС, ЭтотОбъект);
		
		Закрыть(ДанныеФормыВыпускаГРЛС);
		
	Иначе
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
