#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных - Настройки для загрузки в компоновщик настроек.
//
// См. также:
//   "Расширение управляемой формы для отчета.ПриЗагрузкеВариантаНаСервере" в синтакс-помощнике.
//
Процедура ПередЗагрузкойВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	
	НастроитьПараметрыОтборыПоФункциональнымОпциям(КомпоновщикНастроек);
	
	НовыеНастройкиКД = КомпоновщикНастроек.Настройки;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтчетыБольничнаяАптека.АктуализироватьСебестоимостьТоваровДляОтчетов(КомпоновщикНастроек,, "СтруктураПредприятия.Организация");
	
	КонтрольИспользованияАналитикиОборотов(КомпоновщикНастроек);
	
	СхемаКомпоновкиДанных.НаборыДанных.ОсновнаяАналитика.Запрос  = ИсполняемыйЗапросОсновнаяАналитика();
	СхемаКомпоновкиДанных.НаборыДанных.ОборотнаяАналитика.Запрос = ИсполняемыйЗапросОборотнаяАналитика();
	СхемаКомпоновкиДанных.НаборыДанных.Документы.Запрос          = ИсполняемыйЗапросДокументы();
	
	УстановитьТекстЗапросаМерныхЕдиниц(СхемаКомпоновкиДанных);
	
	УстановитьОбязательныеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства);
	
	УдалитьПоказателиИзОтборовРасшифровки(КомпоновщикНастроек);
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	МодифицироватьПоляИтогаРесурсов(МакетКомпоновки, СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	ОтчетыБольничнаяАптека.ОптимизироватьВыраженияПараметровВиртуальныхТаблиц(МакетКомпоновки);
	
	ОтчетыБольничнаяАптека.УстановитьЗаголовкиМакетаКомпоновки(ДанныеЗаголовковПолей(), МакетКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ОтчетыБольничнаяАптека.ОформитьДиаграммыОтчета(КомпоновщикНастроек, ДокументРезультат);
	
	ОтчетыБольничнаяАптека.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

#Область НастройкаПараметровОтчета

Процедура УстановитьОбязательныеНастройки(ДополнительныеСвойства)
	
	ОбязательныеНастройкиПоУмолчанию = Новый Структура;
	ОбязательныеНастройкиПоУмолчанию.Вставить("ДанныеОтчета", 1);
	
	Для Каждого НастройкаПоУмолчанию Из ОбязательныеНастройкиПоУмолчанию Цикл
		ПараметрДанныеОтчета = ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, НастройкаПоУмолчанию.Ключ);
		Если ПараметрДанныеОтчета <> Неопределено И Не ЗначениеЗаполнено(ПараметрДанныеОтчета.Значение) Тогда
			ОбщегоНазначенияБольничнаяАптекаКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, НастройкаПоУмолчанию.Ключ, НастройкаПоУмолчанию.Значение);
			ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьПоказателиИзОтборовРасшифровки(КомпоновщикНастроек)
	
	Если КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.Свойство("РежимРасшифровки")
	   И КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.РежимРасшифровки Тогда
		
		Показатели = Новый Массив;
		Показатели.Добавить("Показатели.Количество.КоличествоНачальныйОстаток");
		Показатели.Добавить("Показатели.Количество.КоличествоПриход");
		Показатели.Добавить("Показатели.Количество.КоличествоРасход");
		Показатели.Добавить("Показатели.Количество.КоличествоКонечныйОстаток");
		
		Показатели.Добавить("Показатели.Вес.ВесНачальныйОстаток");
		Показатели.Добавить("Показатели.Вес.ВесПриход");
		Показатели.Добавить("Показатели.Вес.ВесРасход");
		Показатели.Добавить("Показатели.Вес.ВесКонечныйОстаток");
		
		Показатели.Добавить("Показатели.Объем.ОбъемНачальныйОстаток");
		Показатели.Добавить("Показатели.Объем.ОбъемПриход");
		Показатели.Добавить("Показатели.Объем.ОбъемРасход");
		Показатели.Добавить("Показатели.Объем.ОбъемКонечныйОстаток");
		
		Показатели.Добавить("Показатели.Длина.ДлинаНачальныйОстаток");
		Показатели.Добавить("Показатели.Длина.ДлинаПриход");
		Показатели.Добавить("Показатели.Длина.ДлинаРасход");
		Показатели.Добавить("Показатели.Длина.ДлинаКонечныйОстаток");
		
		Показатели.Добавить("Показатели.Площадь.ПлощадьНачальныйОстаток");
		Показатели.Добавить("Показатели.Площадь.ПлощадьПриход");
		Показатели.Добавить("Показатели.Площадь.ПлощадьРасход");
		Показатели.Добавить("Показатели.Площадь.ПлощадьКонечныйОстаток");
		
		Показатели.Добавить("Показатели.СтоимостьПоступления.СтоимостьПоступленияНачальныйОстаток");
		Показатели.Добавить("Показатели.СтоимостьПоступления.СтоимостьПоступленияПриход");
		Показатели.Добавить("Показатели.СтоимостьПоступления.СтоимостьПоступленияРасход");
		Показатели.Добавить("Показатели.СтоимостьПоступления.СтоимостьПоступленияКонечныйОстаток");
		
		Показатели.Добавить("Показатели.ДопРасходы.ДопРасходыНачальныйОстаток");
		Показатели.Добавить("Показатели.ДопРасходы.ДопРасходыПриход");
		Показатели.Добавить("Показатели.ДопРасходы.ДопРасходыРасход");
		Показатели.Добавить("Показатели.ДопРасходы.ДопРасходыКонечныйОстаток");
		
		Показатели.Добавить("Показатели.Себестоимость.СебестоимостьНачальныйОстаток");
		Показатели.Добавить("Показатели.Себестоимость.СебестоимостьПриход");
		Показатели.Добавить("Показатели.Себестоимость.СебестоимостьРасход");
		Показатели.Добавить("Показатели.Себестоимость.СебестоимостьКонечныйОстаток");
		
		Для Каждого Показатель Из Показатели Цикл
			ОбщегоНазначенияБольничнаяАптека.УдалитьЭлементОтбораИзВсехНастроекОтчета(КомпоновщикНастроек, Показатель);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеЗаголовковПолей()
	
	ДанныеЗаголовковПолей = Новый Структура;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеЗаголовковПолей, ДанныеЗаголовковВалют(), Ложь);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеЗаголовковПолей, ОтчетыБольничнаяАптека.ДанныеЗаголовковПолейМерныхЕдиниц(), Ложь);
	
	Возврат ДанныеЗаголовковПолей;
	
КонецФункции

Функция ВспомогательныеПараметрыОтчета()
	
	ВспомогательныеПараметры = Новый Массив;
	
	КлючТекущегоВарианта = "";
	Если КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("КлючТекущегоВарианта", КлючТекущегоВарианта) Тогда
		Если Не КлючТекущегоВарианта = "ДинамикаЗакупок" Тогда
			ВспомогательныеПараметры.Добавить("Периодичность");
		КонецЕсли;
	КонецЕсли;
	
	ВспомогательныеПараметры.Добавить("КоличественныеИтогиПоЕдИзм");
	
	ВспомогательныеПараметры.Добавить("МаксимумСерийКоличество");
	ВспомогательныеПараметры.Добавить("ВыделениеСерийДиаграмм");
	ВспомогательныеПараметры.Добавить("ОтслеживаемыеАналитики");
	ВспомогательныеПараметры.Добавить("ГрадиентСерийДиаграмм");
	ВспомогательныеПараметры.Добавить("ОтображениеМаркеровТочекДиаграмм");
	ВспомогательныеПараметры.Добавить("ОтображениеЛинийТрендаСерийДиаграммы");
	ВспомогательныеПараметры.Добавить("ТипАппроксимацииЛинийТренда");
	
	Возврат ВспомогательныеПараметры;
	
КонецФункции

#КонецОбласти // НастройкаПараметровОтчета

#Область ФормированиеТекстовЗапросаНаборовДанных

#Область НаборыДанныхСхемыОтчета

Функция ИсполняемыйЗапросОсновнаяАналитика()
	
	ТекстЗапроса = ТекстЗапросаАналитикаВидаУчета();
	
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаКорАналитикаВидаУчета()              , ТипПодключенияПакет());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаАналитикаУчетаНоменклатуры()         , ТипПодключенияПакет());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаКорАналитикаУчетаНоменклатуры()      , ТипПодключенияПакет());
	
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаСебестоимостьТоваровОстаткиИОбороты(), ТипПодключенияПакет());
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ИсполняемыйЗапросОборотнаяАналитика()
	
	ТекстЗапроса = ТекстЗапросаАналитикаВидаУчета();
	
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаКорАналитикаВидаУчета()                        , ТипПодключенияПакет());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаАналитикаУчетаНоменклатуры()                   , ТипПодключенияПакет());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаКорАналитикаУчетаНоменклатуры()                , ТипПодключенияПакет());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаХозяйственныеОперации()                        , ТипПодключенияПакет());
	
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаЗарегистрированныеВводыОстатков()              , ТипПодключенияПакет());
	
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаЗакупкиОбороты()                               , ТипПодключенияПакет());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаВыручкаИСебестоимостьПродажОбороты()           , ТипПодключенияОператор());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаДвиженияНоменклатураНоменклатураОборотыПриход(), ТипПодключенияОператор());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаДвиженияНоменклатураНоменклатураОборотыРасход(), ТипПодключенияОператор());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаДвиженияНоменклатураДоходыРасходыОбороты()     , ТипПодключенияОператор());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаДополнениеВводОстатков()                       , ТипПодключенияОператор());
	
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаКлассифицированныеОбороты()                    , ТипПодключенияПакет());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаНеклассифицированныеОбороты()                  , ТипПодключенияОператор());
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ИсполняемыйЗапросДокументы()
	
	ТекстЗапроса = ТекстЗапросаЗарегистрированныеВводыОстатков();
	
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаСебестоимостьТоваровЗаписи(), ТипПодключенияПакет());
	ПодключитьЗапрос(ТекстЗапроса, ТекстЗапросаСебестоимостьТоваровОборотыПоЗаписям(), ТипПодключенияПакет());
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти // НаборыДанныхСхемыОтчета

#Область ОбщиеФрагментыЗапросов

Функция ТекстЗапросаАналитикаВидаУчета()
	
	ТекстЗапрос = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаВидаУчета.КлючАналитики           КАК КлючАналитики,
	|	АналитикаВидаУчета.Организация             КАК Организация,
	|	АналитикаВидаУчета.Склад                   КАК Склад,
	|	АналитикаВидаУчета.ИсточникФинансирования  КАК ИсточникФинансирования
	|ПОМЕСТИТЬ АналитикаВидаУчета
	|ИЗ
	|	РегистрСведений.АналитикаВидаУчета КАК АналитикаВидаУчета
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики
	|";
	
	Возврат ТекстЗапрос;
	
КонецФункции

Функция ТекстЗапросаКорАналитикаВидаУчета()
	
	ТекстЗапрос = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаВидаУчета.КлючАналитики           КАК КлючАналитики,
	|	АналитикаВидаУчета.Организация             КАК Организация,
	|	АналитикаВидаУчета.Склад                   КАК Склад,
	|	АналитикаВидаУчета.ИсточникФинансирования  КАК ИсточникФинансирования
	|ПОМЕСТИТЬ КорАналитикаВидаУчета
	|ИЗ
	|	РегистрСведений.АналитикаВидаУчета КАК АналитикаВидаУчета
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики
	|";
	
	Возврат ТекстЗапрос;
	
КонецФункции

Функция ТекстЗапросаАналитикаУчетаНоменклатуры()
	
	ТекстЗапрос = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаУчетаНоменклатуры.КлючАналитики      КАК КлючАналитики,
	|	АналитикаУчетаНоменклатуры.Номенклатура       КАК Номенклатура,
	|	АналитикаУчетаНоменклатуры.СерияНоменклатуры  КАК СерияНоменклатуры,
	|	АналитикаУчетаНоменклатуры.Партия             КАК Партия
	|ПОМЕСТИТЬ АналитикаУчетаНоменклатуры
	|ИЗ
	|	РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики
	|";
	
	Возврат ТекстЗапрос;
	
КонецФункции

Функция ТекстЗапросаКорАналитикаУчетаНоменклатуры()
	
	ТекстЗапрос = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаУчетаНоменклатуры.КлючАналитики      КАК КлючАналитики,
	|	АналитикаУчетаНоменклатуры.Номенклатура       КАК Номенклатура,
	|	АналитикаУчетаНоменклатуры.СерияНоменклатуры  КАК СерияНоменклатуры,
	|	АналитикаУчетаНоменклатуры.Партия             КАК Партия
	|ПОМЕСТИТЬ КорАналитикаУчетаНоменклатуры
	|ИЗ
	|	РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики
	|";
	
	Возврат ТекстЗапрос;
	
КонецФункции

Функция ТекстЗапросаХозяйственныеОперации()
	
	ТекстЗапрос = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиХозопераций.Ссылка                 КАК Хозоперация,
	|	НастройкиХозопераций.ХозяйственнаяОперация  КАК ХозяйственнаяОперация,
	|	НастройкиХозопераций.Приход                 КАК Приход,
	|	НастройкиХозопераций.Расход                 КАК Расход
	|ПОМЕСТИТЬ НастройкиХозопераций
	|ИЗ
	|	Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозопераций
	|ИНДЕКСИРОВАТЬ ПО
	|	ХозяйственнаяОперация
	|";
	
	Возврат ТекстЗапрос;
	
КонецФункции

Функция ТекстЗапросаЗарегистрированныеВводыОстатков()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводОстатков.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЗарегистрированныеВводыОстатков
	|ИЗ
	|	Документ.ВводОстатков КАК ВводОстатков
	|ГДЕ
	|	ВводОстатков.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийВводаОстатков.ОстаткиСобственныхТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийВводаОстатков.ОстаткиСобственныхТоваровВОтделениях)
	|		)
	|	И ВводОстатков.Проведен
	|{ГДЕ
	|	ВводОстатков.Дата >= &НачалоПериода,
	|	ВводОстатков.Дата <= &КонецПериода}
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура УстановитьТекстЗапросаМерныхЕдиниц(СхемаКомпоновкиДанных)
	
	Для Каждого НаборДанных Из СхемаКомпоновкиДанных.НаборыДанных Цикл
		
		ТекстЗапроса = НаборДанных.Запрос;
		
		ТекстЗапросаВес = Справочники.ЕдиницыИзмерения.ТекстЗапросаКоличествоВМерныхЕдиницах(Перечисления.ТипыЕдиницИзмерения.Вес, "АналитикаНоменклатуры.Номенклатура");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесНоменклатуры", ТекстЗапросаВес);
		
		ТекстЗапросаОбъем = Справочники.ЕдиницыИзмерения.ТекстЗапросаКоличествоВМерныхЕдиницах(Перечисления.ТипыЕдиницИзмерения.Объем, "АналитикаНоменклатуры.Номенклатура");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемНоменклатуры", ТекстЗапросаОбъем);
		
		ТекстЗапросаДлина = Справочники.ЕдиницыИзмерения.ТекстЗапросаКоличествоВМерныхЕдиницах(Перечисления.ТипыЕдиницИзмерения.Длина, "АналитикаНоменклатуры.Номенклатура");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаДлинаНоменклатуры", ТекстЗапросаДлина);
		
		ТекстЗапросаПлощадь = Справочники.ЕдиницыИзмерения.ТекстЗапросаКоличествоВМерныхЕдиницах(Перечисления.ТипыЕдиницИзмерения.Площадь, "АналитикаНоменклатуры.Номенклатура");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПлощадьНоменклатуры", ТекстЗапросаПлощадь);
		
		НаборДанных.Запрос = ТекстЗапроса;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаРеквизитПоляСоставногоТипа(ИмяТаблицыВЗапросе, МетаданныеПоляСоставногоТипа, ИмяРеквизита)
	
	ТелоВыражения = "";
	ШаблонТелаВыражения = "
		|	КОГДА %1 ССЫЛКА %2 ТОГДА
		|		ВЫРАЗИТЬ(%1 КАК %2).%3";
	
	ИмяПоляВладельца = ИмяТаблицыВЗапросе + "." + МетаданныеПоляСоставногоТипа.Имя;
	
	Для Каждого ТипПоляВладельца Из МетаданныеПоляСоставногоТипа.Тип.Типы() Цикл
		
		МетаданныеТипаПоляВладельца = Метаданные.НайтиПоТипу(ТипПоляВладельца);
		
		Если МетаданныеТипаПоляВладельца = Неопределено Или МетаданныеТипаПоляВладельца.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТелоВыражения = ТелоВыражения + СтрШаблон(ШаблонТелаВыражения, ИмяПоляВладельца, МетаданныеТипаПоляВладельца.ПолноеИмя(), ИмяРеквизита);
		
	КонецЦикла;
	
	ТекстВыражения = "
		|ВЫБОР %1
		|	ИНАЧЕ NULL
		|КОНЕЦ";
	
	Возврат СтрШаблон(ТекстВыражения, ТелоВыражения);
	
КонецФункции

#КонецОбласти // ОбщиеФрагментыЗапросов

#Область ОсновнаяАналитика

Функция ТекстЗапросаСебестоимостьТоваровОстаткиИОбороты()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	
	|	// Аналитика периодов
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодДень,      ДЕНЬ)       КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодНеделя,    НЕДЕЛЯ)     КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодДекада,    ДЕКАДА)     КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодМесяц,     МЕСЯЦ)      КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодКвартал,   КВАРТАЛ)    КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодПолугодие, ПОЛУГОДИЕ)  КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОстатки.ПериодГод,       ГОД)        КАК ПериодГод,
	|	
	|	// Структура предприятия
	|	СебестоимостьТоваровОстатки.АналитикаВидаУчета                         КАК АналитикаВидаУчета,
	|	АналитикаВида.Организация                                              КАК Организация,
	|	АналитикаВида.Склад                                                    КАК Склад,
	|	АналитикаВида.ИсточникФинансирования                                   КАК ИсточникФинансирования,
	|	
	|	// Общая аналитика
	|	АналитикаПартий.Поставщик                                              КАК Партнер,
	|	
	|	// Аналитика номенклатуры
	|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры                 КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура                                     КАК Номенклатура,
	|	АналитикаНоменклатуры.СерияНоменклатуры                                КАК СерияНоменклатуры,
	|	АналитикаНоменклатуры.Партия                                           КАК Партия,
	|	ВидыНоменклатуры.ГруппаБухгалтерскогоУчета                             КАК ГруппаБухгалтерскогоУчета,
	|	
	|	// Аналитика остатков и оборотов без детализации
	|	СебестоимостьТоваровОстатки.РазделУчета                                КАК РазделУчета,
	|	
	|	// Показатель ""Количество""
	|	ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА
	|			СебестоимостьТоваровОстатки.КоличествоНачальныйОстаток
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.КоличествоНачальныйОстаток
	|				/ Упаковки.Коэффициент
	|	КОНЕЦ                                                                  КАК КоличествоНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА
	|			СебестоимостьТоваровОстатки.КоличествоПриход
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.КоличествоПриход
	|				/ Упаковки.Коэффициент
	|	КОНЕЦ                                                                  КАК КоличествоПриход,
	|	ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА
	|			СебестоимостьТоваровОстатки.КоличествоРасход
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.КоличествоРасход
	|				/ Упаковки.Коэффициент
	|	КОНЕЦ                                                                  КАК КоличествоРасход,
	|	ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА
	|			СебестоимостьТоваровОстатки.КоличествоКонечныйОстаток
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.КоличествоКонечныйОстаток
	|				/ Упаковки.Коэффициент
	|	КОНЕЦ                                                                  КАК КоличествоКонечныйОстаток,
	|	
	|	// Показатель ""Вес""
	|	СебестоимостьТоваровОстатки.КоличествоНачальныйОстаток
	|		* &ТекстЗапросаВесНоменклатуры                                     КАК ВесНачальныйОстаток,
	|	СебестоимостьТоваровОстатки.КоличествоПриход
	|		* &ТекстЗапросаВесНоменклатуры                                     КАК ВесПриход,
	|	СебестоимостьТоваровОстатки.КоличествоРасход
	|		* &ТекстЗапросаВесНоменклатуры                                     КАК ВесРасход,
	|	СебестоимостьТоваровОстатки.КоличествоКонечныйОстаток
	|		* &ТекстЗапросаВесНоменклатуры                                     КАК ВесКонечныйОстаток,
	|	
	|	// Показатель ""Объем""
	|	СебестоимостьТоваровОстатки.КоличествоНачальныйОстаток
	|		* &ТекстЗапросаОбъемНоменклатуры                                   КАК ОбъемНачальныйОстаток,
	|	СебестоимостьТоваровОстатки.КоличествоПриход
	|		* &ТекстЗапросаОбъемНоменклатуры                                   КАК ОбъемПриход,
	|	СебестоимостьТоваровОстатки.КоличествоРасход
	|		* &ТекстЗапросаОбъемНоменклатуры                                   КАК ОбъемРасход,
	|	СебестоимостьТоваровОстатки.КоличествоКонечныйОстаток
	|		* &ТекстЗапросаОбъемНоменклатуры                                   КАК ОбъемКонечныйОстаток,
	|	
	|	// Показатель ""Длина""
	|	СебестоимостьТоваровОстатки.КоличествоНачальныйОстаток
	|		* &ТекстЗапросаДлинаНоменклатуры                                   КАК ДлинаНачальныйОстаток,
	|	СебестоимостьТоваровОстатки.КоличествоПриход
	|		* &ТекстЗапросаДлинаНоменклатуры                                   КАК ДлинаПриход,
	|	СебестоимостьТоваровОстатки.КоличествоРасход
	|		* &ТекстЗапросаДлинаНоменклатуры                                   КАК ДлинаРасход,
	|	СебестоимостьТоваровОстатки.КоличествоКонечныйОстаток
	|		* &ТекстЗапросаДлинаНоменклатуры                                   КАК ДлинаКонечныйОстаток,
	|	
	|	// Показатель ""Площадь""
	|	СебестоимостьТоваровОстатки.КоличествоНачальныйОстаток
	|		* &ТекстЗапросаПлощадьНоменклатуры                                 КАК ПлощадьНачальныйОстаток,
	|	СебестоимостьТоваровОстатки.КоличествоПриход
	|		* &ТекстЗапросаПлощадьНоменклатуры                                 КАК ПлощадьПриход,
	|	СебестоимостьТоваровОстатки.КоличествоРасход
	|		* &ТекстЗапросаПлощадьНоменклатуры                                 КАК ПлощадьРасход,
	|	СебестоимостьТоваровОстатки.КоличествоКонечныйОстаток
	|		* &ТекстЗапросаПлощадьНоменклатуры                                 КАК ПлощадьКонечныйОстаток,
	|	
	|	// Показатель ""Стоимость""
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьБезНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьРеглНачальныйОстаток
	|	КОНЕЦ                                                                  КАК СтоимостьПоступленияНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьПриход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьБезНДСПриход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьРеглПриход
	|	КОНЕЦ                                                                  КАК СтоимостьПоступленияПриход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьРасход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьБезНДСРасход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьРеглРасход
	|	КОНЕЦ                                                                  КАК СтоимостьПоступленияРасход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьБезНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьРеглКонечныйОстаток
	|	КОНЕЦ                                                                  КАК СтоимостьПоступленияКонечныйОстаток,
	|	
	|	// Показатель ""Доп. расходы""
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СуммаДопРасходовНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СуммаДопРасходовБезНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			0
	|	КОНЕЦ                                                                  КАК ДопРасходыНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СуммаДопРасходовПриход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СуммаДопРасходовБезНДСПриход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			0
	|	КОНЕЦ                                                                  КАК ДопРасходыПриход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СуммаДопРасходовРасход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СуммаДопРасходовБезНДСРасход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			0
	|	КОНЕЦ                                                                  КАК ДопРасходыРасход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СуммаДопРасходовКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СуммаДопРасходовБезНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			0
	|	КОНЕЦ                                                                  КАК ДопРасходыКонечныйОстаток,
	|	
	|	// Показатель ""Себестоимость""
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьНачальныйОстаток
	|				+ СебестоимостьТоваровОстатки.СуммаДопРасходовНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьБезНДСНачальныйОстаток
	|				+ СебестоимостьТоваровОстатки.СуммаДопРасходовБезНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьРеглНачальныйОстаток
	|	КОНЕЦ                                                                  КАК СебестоимостьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьПриход
	|				+ СебестоимостьТоваровОстатки.СуммаДопРасходовПриход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьБезНДСПриход
	|				+ СебестоимостьТоваровОстатки.СуммаДопРасходовБезНДСПриход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьРеглПриход
	|	КОНЕЦ                                                                  КАК СебестоимостьПриход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьРасход
	|				+ СебестоимостьТоваровОстатки.СуммаДопРасходовРасход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьБезНДСРасход
	|				+ СебестоимостьТоваровОстатки.СуммаДопРасходовБезНДСРасход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьРеглРасход
	|	КОНЕЦ                                                                  КАК СебестоимостьРасход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьКонечныйОстаток
	|				+ СебестоимостьТоваровОстатки.СуммаДопРасходовКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьБезНДСКонечныйОстаток
	|				+ СебестоимостьТоваровОстатки.СуммаДопРасходовБезНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровОстатки.СтоимостьРеглКонечныйОстаток
	|	КОНЕЦ                                                                  КАК СебестоимостьКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(,,Авто,,
	|		&ВыражениеПараметраАналитикаВидаУчета
	|		И &ВыражениеПараметраАналитикаУчетаНоменклатуры
	|		) КАК СебестоимостьТоваровОстатки
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			АналитикаВидаУчета КАК АналитикаВида
	|		ПО
	|			СебестоимостьТоваровОстатки.АналитикаВидаУчета = АналитикаВида.КлючАналитики}
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|				ПО
	|					АналитикаНоменклатуры.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка}
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					РегистрСведений.ЕдиницыИзмеренияНоменклатуры КАК Упаковки
	|				ПО
	|					АналитикаНоменклатуры.Номенклатура = Упаковки.Номенклатура
	|					И АналитикаНоменклатуры.Номенклатура.ОсновнаяЕдиницаУчета = Упаковки.ЕдиницаИзмерения}
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					РегистрСведений.АналитикаУчетаПартий КАК АналитикаПартий
	|				ПО
	|					АналитикаНоменклатуры.Партия = АналитикаПартий.КлючАналитики}
	|		ПО
	|			СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики}
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти // ОсновнаяАналитика

#Область ОборотнаяАналитика

Функция ТекстЗапросаЗакупкиОбороты()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ЗакупкиОбороты""                                        КАК НаборДанных,
	|
	|	// Аналитика периодов
	|	НАЧАЛОПЕРИОДА(ЗакупкиОбороты.ПериодДень,      ДЕНЬ)       КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(ЗакупкиОбороты.ПериодНеделя,    НЕДЕЛЯ)     КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(ЗакупкиОбороты.ПериодДекада,    ДЕКАДА)     КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(ЗакупкиОбороты.ПериодМесяц,     МЕСЯЦ)      КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(ЗакупкиОбороты.ПериодКвартал,   КВАРТАЛ)    КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(ЗакупкиОбороты.ПериодПолугодие, ПОЛУГОДИЕ)  КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(ЗакупкиОбороты.ПериодГод,       ГОД)        КАК ПериодГод,
	|	
	|	// Структура предприятия
	|	NULL                                                      КАК АналитикаВидаУчета,
	|	ЗакупкиОбороты.Организация                                КАК Организация,
	|	ЗакупкиОбороты.Склад                                      КАК Склад,
	|	ЗакупкиОбороты.ИсточникФинансирования                     КАК ИсточникФинансирования,
	|	
	|	// Общая аналитика
	|	ЗакупкиОбороты.Контрагент                                 КАК Партнер,
	|	
	|	// Аналитика номенклатуры
	|	ЗакупкиОбороты.АналитикаУчетаНоменклатуры                 КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура                        КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ОсновнаяЕдиницаУчета   КАК ОсновнаяЕдиницаУчета,
	|	АналитикаНоменклатуры.СерияНоменклатуры                   КАК СерияНоменклатуры,
	|	АналитикаНоменклатуры.Партия                              КАК Партия,
	|	ВидыНоменклатуры.ГруппаБухгалтерскогоУчета                КАК ГруппаБухгалтерскогоУчета,
	|	
	|	// Аналитика оборотов
	|	NULL                                                      КАК СтатьяДоходов,
	|	NULL                                                      КАК СтатьяРасходов,
	|	NULL                                                      КАК СтатьяДоходовРасходов,
	|	NULL                                                      КАК АналитикаДоходов,
	|	NULL                                                      КАК АналитикаРасходов,
	|	NULL                                                      КАК АналитикаДоходовРасходов,
	|	ЗакупкиОбороты.ДоговорКонтрагента                         КАК Договор,
	|	ЗакупкиОбороты.ЗаказПоставщику                            КАК Заказ,
	|	ЗакупкиОбороты.Контрагент                                 КАК Контрагент,
	|	ЗакупкиОбороты.ПодразделениеОрганизации                   КАК Подразделение,
	|	ЗакупкиОбороты.Спецификация                               КАК Спецификация,
	|	НастройкиХозопераций.Хозоперация                          КАК Хозоперация,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                     КАК ХозяйственнаяОперацияПрихода,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                     КАК ХозяйственнаяОперацияРасхода,
	|	
	|	// Показатель ""Количество""
	|	0                                                         КАК Об_КоличествоНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ЗакупкиОбороты.КоличествоОборот                     КАК Об_КоличествоПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ЗакупкиОбороты.КоличествоОборот                     КАК Об_КоличествоРасход,
	|	0                                                         КАК Об_КоличествоКонечныйОстаток,
	|	
	|	// Показатель ""Вес""
	|	0                                                         КАК Об_ВесНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ЗакупкиОбороты.КоличествоОборот
	|		* &ТекстЗапросаВесНоменклатуры                        КАК Об_ВесПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ЗакупкиОбороты.КоличествоОборот
	|		* &ТекстЗапросаВесНоменклатуры                        КАК Об_ВесРасход,
	|	0                                                         КАК Об_ВесКонечныйОстаток,
	|	
	|	// Показатель ""Объем""
	|	0                                                         КАК Об_ОбъемНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ЗакупкиОбороты.КоличествоОборот
	|		* &ТекстЗапросаОбъемНоменклатуры                      КАК Об_ОбъемПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ЗакупкиОбороты.КоличествоОборот
	|		* &ТекстЗапросаОбъемНоменклатуры                      КАК Об_ОбъемРасход,
	|	0                                                         КАК Об_ОбъемКонечныйОстаток,
	|	
	|	// Показатель ""Длина""
	|	0                                                         КАК Об_ДлинаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ЗакупкиОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                      КАК Об_ДлинаПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ЗакупкиОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                      КАК Об_ДлинаРасход,
	|	0                                                         КАК Об_ДлинаКонечныйОстаток,
	|	
	|	// Показатель ""Площадь""
	|	0                                                         КАК Об_ПлощадьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ЗакупкиОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                      КАК Об_ПлощадьПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ЗакупкиОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                      КАК Об_ПлощадьРасход,
	|	0                                                         КАК Об_ПлощадьКонечныйОстаток,
	|	
	|	// Показатель ""Стоимость""
	|	0                                                         КАК Об_СтоимостьПоступленияНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ЗакупкиОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ЗакупкиОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ЗакупкиОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                     КАК Об_СтоимостьПоступленияПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ЗакупкиОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ЗакупкиОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ЗакупкиОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                     КАК Об_СтоимостьПоступленияРасход,
	|	0                                                         КАК Об_СтоимостьПоступленияКонечныйОстаток,
	|	
	|	// Показатель ""Доп. расходы""
	|	0                                                         КАК Об_ДопРасходыНачальныйОстаток,
	|	0                                                         КАК Об_ДопРасходыПриход,
	|	0                                                         КАК Об_ДопРасходыРасход,
	|	0                                                         КАК Об_ДопРасходыКонечныйОстаток,
	|	
	|	// Показатель ""Себестоимость""
	|	0                                                         КАК Об_СебестоимостьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ЗакупкиОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ЗакупкиОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ЗакупкиОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                     КАК Об_СебестоимостьПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ЗакупкиОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ЗакупкиОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ЗакупкиОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                     КАК Об_СебестоимостьРасход,
	|	0                                                         КАК Об_СебестоимостьКонечныйОстаток
	|
	|ПОМЕСТИТЬ ОборотнаяАналитика
	|ИЗ
	|	РегистрНакопления.Закупки.Обороты(,,Авто,
	|		&ВыражениеПараметраАналитикаУчетаНоменклатуры
	|		И &ВыражениеПараметраХозяйственнаяОперация
	|		) КАК ЗакупкиОбороты
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			НастройкиХозопераций КАК НастройкиХозопераций
	|		ПО
	|			НастройкиХозопераций.ХозяйственнаяОперация = ЗакупкиОбороты.ХозяйственнаяОперация}
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|				ПО
	|					АналитикаНоменклатуры.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка}
	|		ПО
	|			ЗакупкиОбороты.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики}
	|		
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВыручкаИСебестоимостьПродажОбороты()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ВыручкаИСебестоимостьПродажОбороты""                                        КАК НаборДанных,
	|	
	|	// Аналитика периодов
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.ПериодДень,      ДЕНЬ)       КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.ПериодНеделя,    НЕДЕЛЯ)     КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.ПериодДекада,    ДЕКАДА)     КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.ПериодМесяц,     МЕСЯЦ)      КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.ПериодКвартал,   КВАРТАЛ)    КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.ПериодПолугодие, ПОЛУГОДИЕ)  КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.ПериодГод,       ГОД)        КАК ПериодГод,
	|	
	|	// Структура предприятия
	|	NULL                                                                          КАК АналитикаВидаУчета,
	|	ВыручкаИСебестоимостьПродажОбороты.Организация                                КАК Организация,
	|	ВыручкаИСебестоимостьПродажОбороты.Склад                                      КАК Склад,
	|	ВыручкаИСебестоимостьПродажОбороты.ИсточникФинансирования                     КАК ИсточникФинансирования,
	|
	|	// Общая аналитика
	|	АналитикаПартий.Поставщик                                                     КАК Партнер,
	|	
	|	// Аналитика номенклатуры
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры                 КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура                                            КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ОсновнаяЕдиницаУчета                       КАК ОсновнаяЕдиницаУчета,
	|	АналитикаНоменклатуры.СерияНоменклатуры                                       КАК СерияНоменклатуры,
	|	АналитикаНоменклатуры.Партия                                                  КАК Партия,
	|	ВидыНоменклатуры.ГруппаБухгалтерскогоУчета                                    КАК ГруппаБухгалтерскогоУчета,
	|	
	|	// Аналитика оборотов
	|	NULL                                                                          КАК СтатьяДоходов,
	|	NULL                                                                          КАК СтатьяРасходов,
	|	NULL                                                                          КАК СтатьяДоходовРасходов,
	|	NULL                                                                          КАК АналитикаДоходов,
	|	NULL                                                                          КАК АналитикаРасходов,
	|	NULL                                                                          КАК АналитикаДоходовРасходов,
	|	ВыручкаИСебестоимостьПродажОбороты.ДоговорКонтрагента                         КАК Договор,
	|	NULL                                                                          КАК Заказ,
	|	ВыручкаИСебестоимостьПродажОбороты.Контрагент                                 КАК Контрагент,
	|	ВыручкаИСебестоимостьПродажОбороты.ПодразделениеОрганизации                   КАК Подразделение,
	|	NULL                                                                          КАК Спецификация,
	|	НастройкиХозопераций.Хозоперация                                              КАК Хозоперация,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				ИЛИ (НастройкиХозопераций.ХозяйственнаяОперация = Значение(Перечисление.ХозяйственныеОперации.ОприходованиеПоВозврату))
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                                         КАК ХозяйственнаяОперацияПрихода,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И НастройкиХозопераций.ХозяйственнаяОперация <> Значение(Перечисление.ХозяйственныеОперации.ОприходованиеПоВозврату)
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                                         КАК ХозяйственнаяОперацияРасхода,
	|	
	|	// Показатель ""Количество""
	|	0                                                                             КАК Об_КоличествоНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|		* ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот                     КАК Об_КоличествоПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|		* ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот                     КАК Об_КоличествоРасход,
	|	0                                                                             КАК Об_КоличествоКонечныйОстаток,
	|	
	|	// Показатель ""Вес""
	|	0                                                                             КАК Об_ВесНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|		* ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот
	|		* &ТекстЗапросаВесНоменклатуры                                            КАК Об_ВесПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|		* ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот
	|		* &ТекстЗапросаВесНоменклатуры                                            КАК Об_ВесРасход,
	|	0                                                                             КАК Об_ВесКонечныйОстаток,
	|	
	|	// Показатель ""Объем""
	|	0                                                                             КАК Об_ОбъемНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|		* ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот
	|		* &ТекстЗапросаОбъемНоменклатуры                                          КАК Об_ОбъемПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|		* ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот
	|		* &ТекстЗапросаОбъемНоменклатуры                                          КАК Об_ОбъемРасход,
	|	0                                                                             КАК Об_ОбъемКонечныйОстаток,
	|	
	|	// Показатель ""Длина""
	|	0                                                                             КАК Об_ДлинаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|		* ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                          КАК Об_ДлинаПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|		* ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                          КАК Об_ДлинаРасход,
	|	0                                                                             КАК Об_ДлинаКонечныйОстаток,
	|	
	|	// Показатель ""Площадь""
	|	0                                                                             КАК Об_ПлощадьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|		* ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                          КАК Об_ПлощадьПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|		* ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                          КАК Об_ПлощадьРасход,
	|	0                                                                             КАК Об_ПлощадьКонечныйОстаток,
	|	
	|	// Показатель ""Стоимость""
	|	0                                                                             КАК Об_СтоимостьПоступленияНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот < 0
	|			ТОГДА -1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                                         КАК Об_СтоимостьПоступленияПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                                         КАК Об_СтоимостьПоступленияРасход,
	|	0                                                                             КАК Об_СтоимостьПоступленияКонечныйОстаток,
	|	
	|	// Показатель ""Доп. расходы""
	|	0                                                                             КАК Об_ДопРасходыНачальныйОстаток,
	|	0                                                                             КАК Об_ДопРасходыПриход,
	|	0                                                                             КАК Об_ДопРасходыРасход,
	|	0                                                                             КАК Об_ДопРасходыКонечныйОстаток,
	|	
	|	// Показатель ""Себестоимость""
	|	0                                                                             КАК Об_СебестоимостьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                                         КАК Об_СебестоимостьПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот > 0
	|			ТОГДА 1
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|				И ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот < 0
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ВыручкаИСебестоимостьПродажОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                                         КАК Об_СебестоимостьРасход,
	|	0                                                                             КАК Об_СебестоимостьКонечныйОстаток
	|	
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(,,Авто,
	|		&ВыражениеПараметраАналитикаУчетаНоменклатуры
	|		И &ВыражениеПараметраХозяйственнаяОперация
	|		) КАК ВыручкаИСебестоимостьПродажОбороты
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			НастройкиХозопераций КАК НастройкиХозопераций
	|		ПО
	|			ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация = НастройкиХозопераций.ХозяйственнаяОперация}
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|				ПО
	|					АналитикаНоменклатуры.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка}
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					РегистрСведений.АналитикаУчетаПартий КАК АналитикаПартий
	|				ПО
	|					АналитикаНоменклатуры.Партия = АналитикаПартий.КлючАналитики}
	|		ПО
	|			ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики}
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДвиженияНоменклатураНоменклатураОборотыПриход()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ДвиженияНоменклатураНоменклатураОборотыПриход""                                        КАК НаборДанных,
	|	
	|	// Аналитика периодов
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыПриход.ПериодДень,      ДЕНЬ)       КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыПриход.ПериодНеделя,    НЕДЕЛЯ)     КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыПриход.ПериодДекада,    ДЕКАДА)     КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыПриход.ПериодМесяц,     МЕСЯЦ)      КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыПриход.ПериодКвартал,   КВАРТАЛ)    КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыПриход.ПериодПолугодие, ПОЛУГОДИЕ)  КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыПриход.ПериодГод,       ГОД)        КАК ПериодГод,
	|	
	|	// Структура предприятия
	|	ДвиженияНоменклатураНоменклатураОборотыПриход.КорАналитикаВидаУчета                      КАК АналитикаВидаУчета,
	|	АналитикаВида.Организация                                                                КАК Организация,
	|	АналитикаВида.Склад                                                                      КАК Склад,
	|	АналитикаВида.ИсточникФинансирования                                                     КАК ИсточникФинансирования,
	|	
	|	// Общая аналитика
	|	АналитикаПартий.Поставщик                                                                КАК Партнер,
	|	
	|	// Аналитика номенклатуры
	|	ДвиженияНоменклатураНоменклатураОборотыПриход.КорАналитикаУчетаНоменклатуры              КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура                                                       КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ОсновнаяЕдиницаУчета                                  КАК ОсновнаяЕдиницаУчета,
	|	АналитикаНоменклатуры.СерияНоменклатуры                                                  КАК СерияНоменклатуры,
	|	АналитикаНоменклатуры.Партия                                                             КАК Партия,
	|	ВидыНоменклатуры.ГруппаБухгалтерскогоУчета                                               КАК ГруппаБухгалтерскогоУчета,
	|	
	|	// Аналитика оборотов
	|	NULL                                                                                     КАК СтатьяДоходов,
	|	NULL                                                                                     КАК СтатьяРасходов,
	|	NULL                                                                                     КАК СтатьяДоходовРасходов,
	|	NULL                                                                                     КАК АналитикаДоходов,
	|	NULL                                                                                     КАК АналитикаРасходов,
	|	NULL                                                                                     КАК АналитикаДоходовРасходов,
	|	NULL                                                                                     КАК Договор,
	|	NULL                                                                                     КАК Заказ,
	|	NULL                                                                                     КАК Контрагент,
	|	NULL                                                                                     КАК Подразделение,
	|	NULL                                                                                     КАК Спецификация,
	|	НастройкиХозопераций.Хозоперация                                                         КАК Хозоперация,
	|	ИСТИНА                                                                                   КАК ХозяйственнаяОперацияПрихода,
	|	ЛОЖЬ                                                                                     КАК ХозяйственнаяОперацияРасхода,
	|	
	|	// Показатель ""Количество""
	|	0                                                                                        КАК Об_КоличествоНачальныйОстаток,
	|	ДвиженияНоменклатураНоменклатураОборотыПриход.КорКоличествоОборот                        КАК Об_КоличествоПриход,
	|	0                                                                                        КАК Об_КоличествоРасход,
	|	0                                                                                        КАК Об_КоличествоКонечныйОстаток,
	|	
	|	// Показатель ""Вес""
	|	0                                                                                        КАК Об_ВесНачальныйОстаток,
	|	ДвиженияНоменклатураНоменклатураОборотыПриход.КорКоличествоОборот
	|		* &ТекстЗапросаВесНоменклатуры                                                       КАК Об_ВесПриход,
	|	0                                                                                        КАК Об_ВесРасход,
	|	0                                                                                        КАК Об_ВесКонечныйОстаток,
	|	
	|	// Показатель ""Объем""
	|	0                                                                                        КАК Об_ОбъемНачальныйОстаток,
	|	ДвиженияНоменклатураНоменклатураОборотыПриход.КорКоличествоОборот
	|		* &ТекстЗапросаОбъемНоменклатуры                                                     КАК Об_ОбъемПриход,
	|	0                                                                                        КАК Об_ОбъемРасход,
	|	0                                                                                        КАК Об_ОбъемКонечныйОстаток,
	|	
	|	// Показатель ""Длина""
	|	0                                                                                        КАК Об_ДлинаНачальныйОстаток,
	|	ДвиженияНоменклатураНоменклатураОборотыПриход.КорКоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                                     КАК Об_ДлинаПриход,
	|	0                                                                                        КАК Об_ДлинаРасход,
	|	0                                                                                        КАК Об_ДлинаКонечныйОстаток,
	|	
	|	// Показатель ""Площадь""
	|	0                                                                                        КАК Об_ПлощадьНачальныйОстаток,
	|	ДвиженияНоменклатураНоменклатураОборотыПриход.КорКоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                                     КАК Об_ПлощадьПриход,
	|	0                                                                                        КАК Об_ПлощадьРасход,
	|	0                                                                                        КАК Об_ПлощадьКонечныйОстаток,
	|	
	|	// Показатель ""Стоимость""
	|	0                                                                                        КАК Об_СтоимостьПоступленияНачальныйОстаток,
	|	 ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыПриход.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыПриход.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыПриход.СтоимостьРеглОборот
	|	КОНЕЦ                                                                                    КАК Об_СтоимостьПоступленияПриход,
	|	0                                                                                        КАК Об_СтоимостьПоступленияРасход,
	|	0                                                                                        КАК Об_СтоимостьПоступленияКонечныйОстаток,
	|	
	|	// Показатель ""Доп. расходы""
	|	0                                                                                        КАК Об_ДопРасходыНачальныйОстаток,
	|	0                                                                                        КАК Об_ДопРасходыПриход,
	|	0                                                                                        КАК Об_ДопРасходыРасход,
	|	0                                                                                        КАК Об_ДопРасходыКонечныйОстаток,
	|	
	|	// Показатель ""Себестоимость""
	|	0                                                                                        КАК Об_СебестоимостьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыПриход.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыПриход.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыПриход.СтоимостьРеглОборот
	|	КОНЕЦ                                                                                    КАК Об_СебестоимостьПриход,
	|	0                                                                                        КАК Об_СебестоимостьРасход,
	|	0                                                                                        КАК Об_СебестоимостьКонечныйОстаток
	|	
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураНоменклатура.Обороты(,,Авто,
	|		&ВыражениеПараметраКорАналитикаВидаУчета
	|		И &ВыражениеПараметраКорАналитикаУчетаНоменклатуры
	|		И &ВыражениеПараметраХозяйственнаяОперация
	|		) КАК ДвиженияНоменклатураНоменклатураОборотыПриход
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			НастройкиХозопераций КАК НастройкиХозопераций
	|		ПО
	|			ДвиженияНоменклатураНоменклатураОборотыПриход.ХозяйственнаяОперация = НастройкиХозопераций.ХозяйственнаяОперация}
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			КорАналитикаВидаУчета КАК АналитикаВида
	|		ПО
	|			ДвиженияНоменклатураНоменклатураОборотыПриход.КорАналитикаВидаУчета = АналитикаВида.КлючАналитики}
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			КорАналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|				ПО
	|					АналитикаНоменклатуры.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка}
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					РегистрСведений.АналитикаУчетаПартий КАК АналитикаПартий
	|				ПО
	|					АналитикаНоменклатуры.Партия = АналитикаПартий.КлючАналитики}
	|		ПО
	|			ДвиженияНоменклатураНоменклатураОборотыПриход.КорАналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики}
	|ГДЕ
	|	АналитикаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И НастройкиХозопераций.Хозоперация <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПеремещениеТоваровМеждуФилиалами)
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДвиженияНоменклатураНоменклатураОборотыРасход()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ДвиженияНоменклатураНоменклатураОборотыПриход""                                        КАК НаборДанных,
	|	
	|	// Аналитика периодов
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыРасход.ПериодДень,      ДЕНЬ)       КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыРасход.ПериодНеделя,    НЕДЕЛЯ)     КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыРасход.ПериодДекада,    ДЕКАДА)     КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыРасход.ПериодМесяц,     МЕСЯЦ)      КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыРасход.ПериодКвартал,   КВАРТАЛ)    КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыРасход.ПериодПолугодие, ПОЛУГОДИЕ)  КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураНоменклатураОборотыРасход.ПериодГод,       ГОД)        КАК ПериодГод,
	|	
	|	// Структура предприятия
	|	ДвиженияНоменклатураНоменклатураОборотыРасход.АналитикаВидаУчета                         КАК АналитикаВидаУчета,
	|	АналитикаВида.Организация                                                                КАК Организация,
	|	АналитикаВида.Склад                                                                      КАК Склад,
	|	АналитикаВида.ИсточникФинансирования                                                     КАК ИсточникФинансирования,
	|	
	|	// Общая аналитика
	|	АналитикаПартий.Поставщик                                                                КАК Партнер,
	|	
	|	// Аналитика номенклатуры
	|	ДвиженияНоменклатураНоменклатураОборотыРасход.АналитикаУчетаНоменклатуры                 КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура                                                       КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ОсновнаяЕдиницаУчета                                  КАК ОсновнаяЕдиницаУчета,
	|	АналитикаНоменклатуры.СерияНоменклатуры                                                  КАК СерияНоменклатуры,
	|	АналитикаНоменклатуры.Партия                                                             КАК Партия,
	|	ВидыНоменклатуры.ГруппаБухгалтерскогоУчета                                               КАК ГруппаБухгалтерскогоУчета,
	|	
	|	// Аналитика оборотов
	|	NULL                                                                                     КАК СтатьяДоходов,
	|	NULL                                                                                     КАК СтатьяРасходов,
	|	NULL                                                                                     КАК СтатьяДоходовРасходов,
	|	NULL                                                                                     КАК АналитикаДоходов,
	|	NULL                                                                                     КАК АналитикаРасходов,
	|	NULL                                                                                     КАК АналитикаДоходовРасходов,
	|	NULL                                                                                     КАК Договор,
	|	NULL                                                                                     КАК Заказ,
	|	NULL                                                                                     КАК Контрагент,
	|	NULL                                                                                     КАК Подразделение,
	|	NULL                                                                                     КАК Спецификация,
	|	НастройкиХозопераций.Хозоперация                                                         КАК Хозоперация,
	|	ЛОЖЬ                                                                                     КАК ХозяйственнаяОперацияПрихода,
	|	ИСТИНА                                                                                   КАК ХозяйственнаяОперацияРасхода,
	|	
	|	// Показатель ""Количество""
	|	0                                                                                        КАК Об_КоличествоНачальныйОстаток,
	|	0                                                                                        КАК Об_КоличествоПриход,
	|	ДвиженияНоменклатураНоменклатураОборотыРасход.КоличествоОборот                           КАК Об_КоличествоРасход,
	|	0                                                                                        КАК Об_КоличествоКонечныйОстаток,
	|	
	|	// Показатель ""Вес""
	|	0                                                                                        КАК Об_ВесНачальныйОстаток,
	|	0                                                                                        КАК Об_ВесПриход,
	|	ДвиженияНоменклатураНоменклатураОборотыРасход.КоличествоОборот
	|		* &ТекстЗапросаВесНоменклатуры                                                       КАК Об_ВесРасход,
	|	0                                                                                        КАК Об_ВесКонечныйОстаток,
	|	
	|	// Показатель ""Объем""
	|	0                                                                                        КАК Об_ОбъемНачальныйОстаток,
	|	0                                                                                        КАК Об_ОбъемПриход,
	|	ДвиженияНоменклатураНоменклатураОборотыРасход.КоличествоОборот
	|		* &ТекстЗапросаОбъемНоменклатуры                                                     КАК Об_ОбъемРасход,
	|	0                                                                                        КАК Об_ОбъемКонечныйОстаток,
	|	
	|	// Показатель ""Длина""
	|	0                                                                                        КАК Об_ДлинаНачальныйОстаток,
	|	0                                                                                        КАК Об_ДлинаПриход,
	|	ДвиженияНоменклатураНоменклатураОборотыРасход.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                                     КАК Об_ДлинаРасход,
	|	0                                                                                        КАК Об_ДлинаКонечныйОстаток,
	|	
	|	// Показатель ""Площадь""
	|	0                                                                                        КАК Об_ПлощадьНачальныйОстаток,
	|	0                                                                                        КАК Об_ПлощадьПриход,
	|	ДвиженияНоменклатураНоменклатураОборотыРасход.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                                     КАК Об_ПлощадьРасход,
	|	0                                                                                        КАК Об_ПлощадьКонечныйОстаток,
	|	
	|	// Показатель ""Стоимость""
	|	0                                                                                        КАК Об_СтоимостьПоступленияНачальныйОстаток,
	|	0                                                                                        КАК Об_СтоимостьПоступленияПриход,
	|	 ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыРасход.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыРасход.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыРасход.СтоимостьРеглОборот
	|	КОНЕЦ                                                                                    КАК Об_СтоимостьПоступленияРасход,
	|	0                                                                                        КАК Об_СтоимостьПоступленияКонечныйОстаток,
	|	
	|	// Показатель ""Доп. расходы""
	|	0                                                                                        КАК Об_ДопРасходыНачальныйОстаток,
	|	0                                                                                        КАК Об_ДопРасходыПриход,
	|	0                                                                                        КАК Об_ДопРасходыРасход,
	|	0                                                                                        КАК Об_ДопРасходыКонечныйОстаток,
	|	
	|	// Показатель ""Себестоимость""
	|	0                                                                                        КАК Об_СебестоимостьНачальныйОстаток,
	|	0                                                                                        КАК Об_СебестоимостьПриход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыРасход.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыРасход.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДвиженияНоменклатураНоменклатураОборотыРасход.СтоимостьРеглОборот
	|	КОНЕЦ                                                                                    КАК Об_СебестоимостьРасход,
	|	0                                                                                        КАК Об_СебестоимостьКонечныйОстаток
	|	
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураНоменклатура.Обороты(,,Авто,
	|		&ВыражениеПараметраАналитикаВидаУчета
	|		И &ВыражениеПараметраАналитикаУчетаНоменклатуры
	|		И &ВыражениеПараметраХозяйственнаяОперация
	|		) КАК ДвиженияНоменклатураНоменклатураОборотыРасход
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			НастройкиХозопераций КАК НастройкиХозопераций
	|		ПО
	|			ДвиженияНоменклатураНоменклатураОборотыРасход.ХозяйственнаяОперация = НастройкиХозопераций.ХозяйственнаяОперация}
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			АналитикаВидаУчета КАК АналитикаВида
	|		ПО
	|			ДвиженияНоменклатураНоменклатураОборотыРасход.АналитикаВидаУчета = АналитикаВида.КлючАналитики}
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|				ПО
	|					АналитикаНоменклатуры.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка}
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					РегистрСведений.АналитикаУчетаПартий КАК АналитикаПартий
	|				ПО
	|					АналитикаНоменклатуры.Партия = АналитикаПартий.КлючАналитики}
	|		ПО
	|			ДвиженияНоменклатураНоменклатураОборотыРасход.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики}
	|ГДЕ
	|	АналитикаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И НастройкиХозопераций.Хозоперация <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВнутреннееПоступлениеТоваров)
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДвиженияНоменклатураДоходыРасходыОбороты()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ДвиженияНоменклатураДоходыРасходыОбороты""                                        КАК НаборДанных,
	|	
	|	// Аналитика периодов
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураДоходыРасходыОбороты.ПериодДень,      ДЕНЬ)       КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураДоходыРасходыОбороты.ПериодНеделя,    НЕДЕЛЯ)     КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураДоходыРасходыОбороты.ПериодДекада,    ДЕКАДА)     КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураДоходыРасходыОбороты.ПериодМесяц,     МЕСЯЦ)      КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураДоходыРасходыОбороты.ПериодКвартал,   КВАРТАЛ)    КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураДоходыРасходыОбороты.ПериодПолугодие, ПОЛУГОДИЕ)  КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(ДвиженияНоменклатураДоходыРасходыОбороты.ПериодГод,       ГОД)        КАК ПериодГод,
	|	
	|	// Структура предприятия
	|	ДвиженияНоменклатураДоходыРасходыОбороты.АналитикаВидаУчета                         КАК АналитикаВидаУчета,
	|	АналитикаВида.Организация                                                           КАК Организация,
	|	АналитикаВида.Склад                                                                 КАК Склад,
	|	АналитикаВида.ИсточникФинансирования                                                КАК ИсточникФинансирования,
	|	
	|	// Общая аналитика
	|	АналитикаПартий.Поставщик                                                           КАК Партнер,
	|	
	|	// Аналитика номенклатуры
	|	ДвиженияНоменклатураДоходыРасходыОбороты.АналитикаУчетаНоменклатуры                 КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура                                                  КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ОсновнаяЕдиницаУчета                             КАК ОсновнаяЕдиницаУчета,
	|	АналитикаНоменклатуры.СерияНоменклатуры                                             КАК СерияНоменклатуры,
	|	АналитикаНоменклатуры.Партия                                                        КАК Партия,
	|	ВидыНоменклатуры.ГруппаБухгалтерскогоУчета                                          КАК ГруппаБухгалтерскогоУчета,
	|	
	|	// Аналитика оборотов
	|	ВЫБОР
	|		КОГДА ДвиженияНоменклатураДоходыРасходыОбороты.СтатьяДоходовРасходов Ссылка ПланВидовХарактеристик.СтатьиДоходов
	|			ТОГДА ДвиженияНоменклатураДоходыРасходыОбороты.СтатьяДоходовРасходов
	|			ИНАЧЕ NULL
	|	КОНЕЦ                                                                               КАК СтатьяДоходов,
	|	ВЫБОР
	|		КОГДА ДвиженияНоменклатураДоходыРасходыОбороты.СтатьяДоходовРасходов Ссылка ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА ДвиженияНоменклатураДоходыРасходыОбороты.СтатьяДоходовРасходов
	|			ИНАЧЕ NULL
	|	КОНЕЦ                                                                               КАК СтатьяРасходов,
	|	ДвиженияНоменклатураДоходыРасходыОбороты.СтатьяДоходовРасходов                      КАК СтатьяДоходовРасходов,
	|	ДвиженияНоменклатураДоходыРасходыОбороты.АналитикаДоходов                           КАК АналитикаДоходов,
	|	ДвиженияНоменклатураДоходыРасходыОбороты.АналитикаРасходов                          КАК АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА НЕ ТИПЗНАЧЕНИЯ(ДвиженияНоменклатураДоходыРасходыОбороты.АналитикаДоходов) ЕСТЬ NULL
	|			ТОГДА ДвиженияНоменклатураДоходыРасходыОбороты.АналитикаДоходов
	|		КОГДА НЕ ТИПЗНАЧЕНИЯ(ДвиженияНоменклатураДоходыРасходыОбороты.АналитикаРасходов) ЕСТЬ NULL
	|			ТОГДА ДвиженияНоменклатураДоходыРасходыОбороты.АналитикаРасходов
	|	КОНЕЦ                                                                               КАК АналитикаДоходовРасходов,
	|	NULL                                                                                КАК Договор,
	|	NULL                                                                                КАК Заказ,
	|	NULL                                                                                КАК Контрагент,
	|	NULL                                                                                КАК Подразделение,
	|	NULL                                                                                КАК Спецификация,
	|	НастройкиХозопераций.Хозоперация                                                    КАК Хозоперация,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                                               КАК ХозяйственнаяОперацияПрихода,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                                               КАК ХозяйственнаяОперацияРасхода,
	|	
	|	// Показатель ""Количество""
	|	0                                                                                   КАК Об_КоличествоНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ДвиженияНоменклатураДоходыРасходыОбороты.КоличествоОборот                     КАК Об_КоличествоПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ДвиженияНоменклатураДоходыРасходыОбороты.КоличествоОборот                     КАК Об_КоличествоРасход,
	|	0                                                                                   КАК Об_КоличествоКонечныйОстаток,
	|	
	|	// Показатель ""Вес""
	|	0                                                                                   КАК Об_ВесНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ДвиженияНоменклатураДоходыРасходыОбороты.КоличествоОборот
	|		* &ТекстЗапросаВесНоменклатуры                                                  КАК Об_ВесПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ДвиженияНоменклатураДоходыРасходыОбороты.КоличествоОборот
	|		* &ТекстЗапросаВесНоменклатуры                                                  КАК Об_ВесРасход,
	|	0                                                                                   КАК Об_ВесКонечныйОстаток,
	|	
	|	// Показатель ""Объем""
	|	0                                                                                   КАК Об_ОбъемНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ДвиженияНоменклатураДоходыРасходыОбороты.КоличествоОборот
	|		* &ТекстЗапросаОбъемНоменклатуры                                                КАК Об_ОбъемПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ДвиженияНоменклатураДоходыРасходыОбороты.КоличествоОборот
	|		* &ТекстЗапросаОбъемНоменклатуры                                                КАК Об_ОбъемРасход,
	|	0                                                                                   КАК Об_ОбъемКонечныйОстаток,
	|	
	|	// Показатель ""Длина""
	|	0                                                                                   КАК Об_ДлинаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ДвиженияНоменклатураДоходыРасходыОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                                КАК Об_ДлинаПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ДвиженияНоменклатураДоходыРасходыОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                                КАК Об_ДлинаРасход,
	|	0                                                                                   КАК Об_ДлинаКонечныйОстаток,
	|	
	|	// Показатель ""Площадь""
	|	0                                                                                   КАК Об_ПлощадьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ДвиженияНоменклатураДоходыРасходыОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                                КАК Об_ПлощадьПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* ДвиженияНоменклатураДоходыРасходыОбороты.КоличествоОборот
	|		* &ТекстЗапросаДлинаНоменклатуры                                                КАК Об_ПлощадьРасход,
	|	0                                                                                   КАК Об_ПлощадьКонечныйОстаток,
	|	
	|	// Показатель ""Стоимость""
	|	0                                                                                   КАК Об_СтоимостьПоступленияНачальныйОстаток,
	|	0                                                                                   КАК Об_СтоимостьПоступленияПриход,
	|	0                                                                                   КАК Об_СтоимостьПоступленияРасход,
	|	0                                                                                   КАК Об_СтоимостьПоступленияКонечныйОстаток,
	|	
	|	// Показатель ""Доп. расходы""
	|	0                                                                                   КАК Об_ДопРасходыНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                                               КАК Об_ДопРасходыПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                                               КАК Об_ДопРасходыРасход,
	|	0                                                                                   КАК Об_ДопРасходыКонечныйОстаток,
	|	
	|	// Показатель ""Себестоимость""
	|	0                                                                                   КАК Об_СебестоимостьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                                               КАК Об_СебестоимостьПриход,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьОборот
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьБезНДСОборот
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДвиженияНоменклатураДоходыРасходыОбороты.СтоимостьРеглОборот
	|	КОНЕЦ                                                                               КАК Об_СебестоимостьРасход,
	|	0                                                                                   КАК Об_СебестоимостьКонечныйОстаток
	|	
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Обороты(,,Авто,
	|		&ВыражениеПараметраАналитикаВидаУчета
	|		И &ВыражениеПараметраАналитикаУчетаНоменклатуры
	|		И &ВыражениеПараметраХозяйственнаяОперация
	|		) КАК ДвиженияНоменклатураДоходыРасходыОбороты
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			НастройкиХозопераций КАК НастройкиХозопераций
	|		ПО
	|			ДвиженияНоменклатураДоходыРасходыОбороты.ХозяйственнаяОперация = НастройкиХозопераций.ХозяйственнаяОперация}
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			АналитикаВидаУчета КАК АналитикаВида
	|		ПО
	|			ДвиженияНоменклатураДоходыРасходыОбороты.АналитикаВидаУчета = АналитикаВида.КлючАналитики}
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|				ПО
	|					АналитикаНоменклатуры.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка}
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					РегистрСведений.АналитикаУчетаПартий КАК АналитикаПартий
	|				ПО
	|					АналитикаНоменклатуры.Партия = АналитикаПартий.КлючАналитики}
	|		ПО
	|			ДвиженияНоменклатураДоходыРасходыОбороты.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики}
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДополнениеВводОстатков()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ДополнениеВводОстатков""                                         КАК НаборДанных,
	|	
	|	// Аналитика периодов
	|	НАЧАЛОПЕРИОДА(ДополнениеВводОстатков.ПериодДень,      ДЕНЬ)        КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(ДополнениеВводОстатков.ПериодНеделя,    НЕДЕЛЯ)      КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(ДополнениеВводОстатков.ПериодДекада,    ДЕКАДА)      КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(ДополнениеВводОстатков.ПериодМесяц,     МЕСЯЦ)       КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(ДополнениеВводОстатков.ПериодКвартал,   КВАРТАЛ)     КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(ДополнениеВводОстатков.ПериодПолугодие, ПОЛУГОДИЕ)   КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(ДополнениеВводОстатков.ПериодГод,       ГОД)         КАК ПериодГод,
	|	
	|	// Структура предприятия
	|	ДополнениеВводОстатков.АналитикаВидаУчета                          КАК АналитикаВидаУчета,
	|	АналитикаВида.Организация                                          КАК Организация,
	|	АналитикаВида.Склад                                                КАК Склад,
	|	АналитикаВида.ИсточникФинансирования                               КАК ИсточникФинансирования,
	|	
	|	// Общая аналитика
	|	АналитикаПартий.Поставщик                                          КАК Партнер,
	|	
	|	// Аналитика номенклатуры
	|	ДополнениеВводОстатков.АналитикаУчетаНоменклатуры                  КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура                                 КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ОсновнаяЕдиницаУчета            КАК ОсновнаяЕдиницаУчета,
	|	АналитикаНоменклатуры.СерияНоменклатуры                            КАК СерияНоменклатуры,
	|	АналитикаНоменклатуры.Партия                                       КАК Партия,
	|	ВидыНоменклатуры.ГруппаБухгалтерскогоУчета                         КАК ГруппаБухгалтерскогоУчета,
	|	
	|	// Аналитика оборотов
	|	NULL                                                               КАК СтатьяДоходов,
	|	NULL                                                               КАК СтатьяРасходов,
	|	NULL                                                               КАК СтатьяДоходовРасходов,
	|	NULL                                                               КАК АналитикаДоходов,
	|	NULL                                                               КАК АналитикаРасходов,
	|	NULL                                                               КАК АналитикаДоходовРасходов,
	|	NULL                                                               КАК Договор,
	|	NULL                                                               КАК Заказ,
	|	NULL                                                               КАК Контрагент,
	|	NULL                                                               КАК Подразделение,
	|	NULL                                                               КАК Спецификация,
	|	НастройкиХозопераций.Хозоперация                                   КАК Хозоперация,
	|	ИСТИНА                                                             КАК ХозяйственнаяОперацияПрихода,
	|	ЛОЖЬ                                                               КАК ХозяйственнаяОперацияРасхода,
	|
	|	// Показатель ""Количество""
	|	0                                                                  КАК Об_КоличествоНачальныйОстаток,
	|	ДополнениеВводОстатков.КоличествоПриход                            КАК Об_КоличествоПриход,
	|	ДополнениеВводОстатков.КоличествоРасход                            КАК Об_КоличествоРасход,
	|	0                                                                  КАК Об_КоличествоКонечныйОстаток,
	|	
	|	// Показатель ""Вес""
	|	0                                                                  КАК Об_ВесНачальныйОстаток,
	|	ДополнениеВводОстатков.КоличествоПриход
	|		* &ТекстЗапросаВесНоменклатуры                                 КАК Об_ВесПриход,
	|	ДополнениеВводОстатков.КоличествоРасход
	|		* &ТекстЗапросаВесНоменклатуры                                 КАК Об_ВесРасход,
	|	0                                                                  КАК Об_ВесКонечныйОстаток,
	|	
	|	// Показатель ""Объем""
	|	0                                                                  КАК Об_ОбъемНачальныйОстаток,
	|	ДополнениеВводОстатков.КоличествоПриход
	|		* &ТекстЗапросаОбъемНоменклатуры                               КАК Об_ОбъемПриход,
	|	ДополнениеВводОстатков.КоличествоРасход
	|		* &ТекстЗапросаОбъемНоменклатуры                               КАК Об_ОбъемРасход,
	|	0                                                                  КАК Об_ОбъемКонечныйОстаток,
	|	
	|	// Показатель ""Длина""
	|	0                                                                  КАК Об_ДлинаНачальныйОстаток,
	|	ДополнениеВводОстатков.КоличествоПриход
	|		* &ТекстЗапросаДлинаНоменклатуры                               КАК Об_ДлинаПриход,
	|	ДополнениеВводОстатков.КоличествоРасход
	|		* &ТекстЗапросаДлинаНоменклатуры                               КАК Об_ДлинаРасход,
	|	0                                                                  КАК Об_ДлинаКонечныйОстаток,
	|	
	|	// Показатель ""Площадь""
	|	0                                                                  КАК Об_ПлощадьНачальныйОстаток,
	|	ДополнениеВводОстатков.КоличествоПриход
	|		* &ТекстЗапросаПлощадьНоменклатуры                             КАК Об_ПлощадьПриход,
	|	ДополнениеВводОстатков.КоличествоРасход
	|		* &ТекстЗапросаПлощадьНоменклатуры                             КАК Об_ПлощадьРасход,
	|	0                                                                  КАК Об_ПлощадьКонечныйОстаток,
	|	
	|	// Показатель ""Стоимость""
	|	0                                                                  КАК Об_СтоимостьПоступленияНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьПриход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьБезНДСПриход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьРеглПриход
	|	КОНЕЦ                                                              КАК Об_СтоимостьПоступленияПриход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьРасход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьБезНДСРасход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьРеглРасход
	|	КОНЕЦ                                                              КАК Об_СтоимостьПоступленияРасход,
	|	0                                                                  КАК Об_СтоимостьПоступленияКонечныйОстаток,
	|	
	|	// Показатель ""Доп. расходы""
	|	0 КАК Об_ДопРасходыНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДополнениеВводОстатков.СуммаДопРасходовПриход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДополнениеВводОстатков.СуммаДопРасходовБезНДСПриход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			0
	|	КОНЕЦ                                                              КАК Об_ДопРасходыПриход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДополнениеВводОстатков.СуммаДопРасходовРасход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДополнениеВводОстатков.СуммаДопРасходовБезНДСРасход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			0
	|	КОНЕЦ                                                              КАК Об_ДопРасходыРасход,
	|	0 КАК Об_ДопРасходыКонечныйОстаток,
	|
	|	// Показатель ""Себестоимость""
	|	0                                                                  КАК Об_СебестоимостьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьПриход
	|				+ ДополнениеВводОстатков.СуммаДопРасходовПриход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьБезНДСПриход
	|				+ ДополнениеВводОстатков.СуммаДопРасходовБезНДСПриход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьРеглПриход
	|	КОНЕЦ                                                              КАК Об_СебестоимостьПриход,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьРасход
	|				+ ДополнениеВводОстатков.СуммаДопРасходовРасход
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьБезНДСРасход
	|				+ ДополнениеВводОстатков.СуммаДопРасходовБезНДСРасход
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			ДополнениеВводОстатков.СтоимостьРеглРасход
	|	КОНЕЦ                                                              КАК Об_СебестоимостьРасход,
	|	0                                                                  КАК Об_СебестоимостьКонечныйОстаток
	|	
	|ИЗ
	|	ЗарегистрированныеВводыОстатков КАК ЗарегистрированныеВводыОстатков
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			НастройкиХозопераций КАК НастройкиХозопераций
	|		ПО
	|			НастройкиХозопераций.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеТоваров)}
	|			
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрНакопления.СебестоимостьТоваров.Обороты(,,Авто,
	|				&ВыражениеПараметраАналитикаВидаУчета
	|				И &ВыражениеПараметраАналитикаУчетаНоменклатуры
	|				) КАК ДополнениеВводОстатков
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					АналитикаВидаУчета КАК АналитикаВида
	|				ПО
	|					ДополнениеВводОстатков.АналитикаВидаУчета = АналитикаВида.КлючАналитики}
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|						
	|						{ЛЕВОЕ СОЕДИНЕНИЕ
	|							Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|						ПО
	|							АналитикаНоменклатуры.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка}
	|						
	|						{ЛЕВОЕ СОЕДИНЕНИЕ
	|							РегистрСведений.АналитикаУчетаПартий КАК АналитикаПартий
	|						ПО
	|							АналитикаНоменклатуры.Партия = АналитикаПартий.КлючАналитики}
	|				ПО
	|					ДополнениеВводОстатков.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики}
	|		ПО
	|			ЗарегистрированныеВводыОстатков.Ссылка = ДополнениеВводОстатков.Регистратор
	|ГДЕ
	|	АналитикаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаКлассифицированныеОбороты()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	КлассифицированныеОбороты.НаборДанных                              КАК НаборДанных,
	|	
	|	// Аналитика периодов
	|	КлассифицированныеОбороты.ПериодДень                               КАК ПериодДень,
	|	КлассифицированныеОбороты.ПериодНеделя                             КАК ПериодНеделя,
	|	КлассифицированныеОбороты.ПериодДекада                             КАК ПериодДекада,
	|	КлассифицированныеОбороты.ПериодМесяц                              КАК ПериодМесяц,
	|	КлассифицированныеОбороты.ПериодКвартал                            КАК ПериодКвартал,
	|	КлассифицированныеОбороты.ПериодПолугодие                          КАК ПериодПолугодие,
	|	КлассифицированныеОбороты.ПериодГод                                КАК ПериодГод,
	|	
	|	// Структура предприятия
	|	КлассифицированныеОбороты.АналитикаВидаУчета                       КАК АналитикаВидаУчета,
	|	КлассифицированныеОбороты.Организация                              КАК Организация,
	|	КлассифицированныеОбороты.Склад                                    КАК Склад,
	|	КлассифицированныеОбороты.ИсточникФинансирования                   КАК ИсточникФинансирования,
	|	
	|	// Общая аналитика
	|	КлассифицированныеОбороты.Партнер                                  КАК Партнер,
	|	
	|	// Аналитика номенклатуры
	|	КлассифицированныеОбороты.АналитикаУчетаНоменклатуры               КАК АналитикаУчетаНоменклатуры,
	|	КлассифицированныеОбороты.Номенклатура                             КАК Номенклатура,
	|	КлассифицированныеОбороты.СерияНоменклатуры                        КАК СерияНоменклатуры,
	|	КлассифицированныеОбороты.Партия                                   КАК Партия,
	|	КлассифицированныеОбороты.ГруппаБухгалтерскогоУчета                КАК ГруппаБухгалтерскогоУчета,
	|	
	|	// Аналитика оборотов
	|	КлассифицированныеОбороты.СтатьяДоходов                            КАК СтатьяДоходов,
	|	КлассифицированныеОбороты.СтатьяРасходов                           КАК СтатьяРасходов,
	|	КлассифицированныеОбороты.СтатьяДоходовРасходов                    КАК СтатьяДоходовРасходов,
	|	КлассифицированныеОбороты.АналитикаДоходов                         КАК АналитикаДоходов,
	|	КлассифицированныеОбороты.АналитикаРасходов                        КАК АналитикаРасходов,
	|	КлассифицированныеОбороты.АналитикаДоходовРасходов                 КАК АналитикаДоходовРасходов,
	|	КлассифицированныеОбороты.Договор                                  КАК Договор,
	|	КлассифицированныеОбороты.Заказ                                    КАК Заказ,
	|	КлассифицированныеОбороты.Контрагент                               КАК Контрагент,
	|	КлассифицированныеОбороты.Подразделение                            КАК Подразделение,
	|	КлассифицированныеОбороты.Спецификация                             КАК Спецификация,
	|	КлассифицированныеОбороты.Хозоперация                              КАК Хозоперация,
	|	КлассифицированныеОбороты.ХозяйственнаяОперацияПрихода             КАК ХозяйственнаяОперацияПрихода,
	|	КлассифицированныеОбороты.ХозяйственнаяОперацияРасхода             КАК ХозяйственнаяОперацияРасхода,
	|	
	|	// Показатель ""Количество""
	|	КлассифицированныеОбороты.Об_КоличествоНачальныйОстаток            КАК Об_КоличествоНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА
	|			КлассифицированныеОбороты.Об_КоличествоПриход
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
	|			КлассифицированныеОбороты.Об_КоличествоПриход
	|				/ Упаковки.Коэффициент
	|	КОНЕЦ                                                              КАК Об_КоличествоПриход,
	|	ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА
	|			КлассифицированныеОбороты.Об_КоличествоРасход
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
	|			КлассифицированныеОбороты.Об_КоличествоРасход
	|				/ Упаковки.Коэффициент
	|	КОНЕЦ                                                              КАК Об_КоличествоРасход,
	|	КлассифицированныеОбороты.Об_КоличествоКонечныйОстаток             КАК Об_КоличествоКонечныйОстаток,
	|	
	|	// Показатели ""Вес""
	|	КлассифицированныеОбороты.Об_ВесНачальныйОстаток                   КАК Об_ВесНачальныйОстаток,
	|	КлассифицированныеОбороты.Об_ВесПриход                             КАК Об_ВесПриход,
	|	КлассифицированныеОбороты.Об_ВесРасход                             КАК Об_ВесРасход,
	|	КлассифицированныеОбороты.Об_ВесКонечныйОстаток                    КАК Об_ВесКонечныйОстаток,
	|	
	|	// Показатель ""Объем""
	|	КлассифицированныеОбороты.Об_ОбъемНачальныйОстаток                 КАК Об_ОбъемНачальныйОстаток,
	|	КлассифицированныеОбороты.Об_ОбъемПриход                           КАК Об_ОбъемПриход,
	|	КлассифицированныеОбороты.Об_ОбъемРасход                           КАК Об_ОбъемРасход,
	|	КлассифицированныеОбороты.Об_ОбъемКонечныйОстаток                  КАК Об_ОбъемКонечныйОстаток,
	|	
	|	// Показатель ""Длина""
	|	КлассифицированныеОбороты.Об_ДлинаНачальныйОстаток                 КАК Об_ДлинаНачальныйОстаток,
	|	КлассифицированныеОбороты.Об_ДлинаПриход                           КАК Об_ДлинаПриход,
	|	КлассифицированныеОбороты.Об_ДлинаРасход                           КАК Об_ДлинаРасход,
	|	КлассифицированныеОбороты.Об_ДлинаКонечныйОстаток                  КАК Об_ДлинаКонечныйОстаток,
	|	
	|	// Показатель ""Площадь""
	|	КлассифицированныеОбороты.Об_ПлощадьНачальныйОстаток               КАК Об_ПлощадьНачальныйОстаток,
	|	КлассифицированныеОбороты.Об_ПлощадьПриход                         КАК Об_ПлощадьПриход,
	|	КлассифицированныеОбороты.Об_ПлощадьРасход                         КАК Об_ПлощадьРасход,
	|	КлассифицированныеОбороты.Об_ПлощадьКонечныйОстаток                КАК Об_ПлощадьКонечныйОстаток,
	|	
	|	// Показатель ""Стоимость""
	|	КлассифицированныеОбороты.Об_СтоимостьПоступленияНачальныйОстаток  КАК Об_СтоимостьПоступленияНачальныйОстаток,
	|	КлассифицированныеОбороты.Об_СтоимостьПоступленияПриход            КАК Об_СтоимостьПоступленияПриход,
	|	КлассифицированныеОбороты.Об_СтоимостьПоступленияРасход            КАК Об_СтоимостьПоступленияРасход,
	|	КлассифицированныеОбороты.Об_СтоимостьПоступленияКонечныйОстаток   КАК Об_СтоимостьПоступленияКонечныйОстаток,
	|	
	|	// Показатель ""Доп. расходы""
	|	КлассифицированныеОбороты.Об_ДопРасходыНачальныйОстаток            КАК Об_ДопРасходыНачальныйОстаток,
	|	КлассифицированныеОбороты.Об_ДопРасходыПриход                      КАК Об_ДопРасходыПриход,
	|	КлассифицированныеОбороты.Об_ДопРасходыРасход                      КАК Об_ДопРасходыРасход,
	|	КлассифицированныеОбороты.Об_ДопРасходыКонечныйОстаток             КАК Об_ДопРасходыКонечныйОстаток,
	|	
	|	// Показатель ""Себестоимость""
	|	КлассифицированныеОбороты.Об_СебестоимостьНачальныйОстаток         КАК Об_СебестоимостьНачальныйОстаток,
	|	КлассифицированныеОбороты.Об_СебестоимостьПриход                   КАК Об_СебестоимостьПриход,
	|	КлассифицированныеОбороты.Об_СебестоимостьРасход                   КАК Об_СебестоимостьРасход,
	|	КлассифицированныеОбороты.Об_СебестоимостьКонечныйОстаток          КАК Об_СебестоимостьКонечныйОстаток
	|ИЗ
	|	ОборотнаяАналитика КАК КлассифицированныеОбороты
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ЕдиницыИзмеренияНоменклатуры КАК Упаковки
	|		ПО
	|			КлассифицированныеОбороты.Номенклатура = Упаковки.Номенклатура
	|			И КлассифицированныеОбороты.ОсновнаяЕдиницаУчета = Упаковки.ЕдиницаИзмерения}
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаНеклассифицированныеОбороты()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	""НеклассифицированныеОбороты""                                      КАК НаборДанных,
	|	
	|	// Аналитика периодов
	|	НеклассифицированныеОбороты.ПериодДень                               КАК ПериодДень,
	|	НеклассифицированныеОбороты.ПериодНеделя                             КАК ПериодНеделя,
	|	НеклассифицированныеОбороты.ПериодДекада                             КАК ПериодДекада,
	|	НеклассифицированныеОбороты.ПериодМесяц                              КАК ПериодМесяц,
	|	НеклассифицированныеОбороты.ПериодКвартал                            КАК ПериодКвартал,
	|	НеклассифицированныеОбороты.ПериодПолугодие                          КАК ПериодПолугодие,
	|	НеклассифицированныеОбороты.ПериодГод                                КАК ПериодГод,
	|	
	|	// Структура предприятия
	|	НеклассифицированныеОбороты.АналитикаВидаУчета                       КАК АналитикаВидаУчета,
	|	НеклассифицированныеОбороты.Организация                              КАК Организация,
	|	НеклассифицированныеОбороты.Склад                                    КАК Склад,
	|	НеклассифицированныеОбороты.ИсточникФинансирования                   КАК ИсточникФинансирования,
	|	
	|	// Общая аналитика
	|	НеклассифицированныеОбороты.Партнер                                  КАК Партнер,
	|	
	|	// Аналитика номенклатуры
	|	НеклассифицированныеОбороты.АналитикаУчетаНоменклатуры               КАК АналитикаУчетаНоменклатуры,
	|	НеклассифицированныеОбороты.Номенклатура                             КАК Номенклатура,
	|	НеклассифицированныеОбороты.СерияНоменклатуры                        КАК СерияНоменклатуры,
	|	НеклассифицированныеОбороты.Партия                                   КАК Партия,
	|	НеклассифицированныеОбороты.ГруппаБухгалтерскогоУчета                КАК ГруппаБухгалтерскогоУчета,
	|	
	|	// Аналитика оборотов
	|	NULL                                                                 КАК СтатьяДоходов,
	|	NULL                                                                 КАК СтатьяРасходов,
	|	NULL                                                                 КАК СтатьяДоходовРасходов,
	|	NULL                                                                 КАК АналитикаДоходов,
	|	NULL                                                                 КАК АналитикаРасходов,
	|	NULL                                                                 КАК АналитикаДоходовРасходов,
	|	NULL                                                                 КАК Договор,
	|	NULL                                                                 КАК Заказ,
	|	NULL                                                                 КАК Контрагент,
	|	NULL                                                                 КАК Подразделение,
	|	NULL                                                                 КАК Спецификация,
	|	NULL                                                                 КАК Хозоперация,
	|	ИСТИНА                                                               КАК ХозяйственнаяОперацияПрихода,
	|	ИСТИНА                                                               КАК ХозяйственнаяОперацияРасхода,
	|	
	|	// Показатель ""Количество""
	|	НеклассифицированныеОбороты.Об_КоличествоНачальныйОстаток            КАК Об_КоличествоНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА
	|			НеклассифицированныеОбороты.Об_КоличествоПриход
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
	|			НеклассифицированныеОбороты.Об_КоличествоПриход
	|				/ Упаковки.Коэффициент
	|	КОНЕЦ                                                                КАК Об_КоличествоПриход,
	|	ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА
	|			НеклассифицированныеОбороты.Об_КоличествоРасход
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
	|			НеклассифицированныеОбороты.Об_КоличествоРасход
	|				/ Упаковки.Коэффициент
	|	КОНЕЦ                                                                КАК Об_КоличествоРасход,
	|	НеклассифицированныеОбороты.Об_КоличествоКонечныйОстаток             КАК Об_КоличествоКонечныйОстаток,
	|	
	|	// Показатели ""Вес""
	|	НеклассифицированныеОбороты.Об_ВесНачальныйОстаток                   КАК Об_ВесНачальныйОстаток,
	|	НеклассифицированныеОбороты.Об_ВесПриход                             КАК Об_ВесПриход,
	|	НеклассифицированныеОбороты.Об_ВесРасход                             КАК Об_ВесРасход,
	|	НеклассифицированныеОбороты.Об_ВесКонечныйОстаток                    КАК Об_ВесКонечныйОстаток,
	|	
	|	// Показатель ""Объем""
	|	НеклассифицированныеОбороты.Об_ОбъемНачальныйОстаток                 КАК Об_ОбъемНачальныйОстаток,
	|	НеклассифицированныеОбороты.Об_ОбъемПриход                           КАК Об_ОбъемПриход,
	|	НеклассифицированныеОбороты.Об_ОбъемРасход                           КАК Об_ОбъемРасход,
	|	НеклассифицированныеОбороты.Об_ОбъемКонечныйОстаток                  КАК Об_ОбъемКонечныйОстаток,
	|	
	|	// Показатель ""Длина""
	|	НеклассифицированныеОбороты.Об_ДлинаНачальныйОстаток                 КАК Об_ДлинаНачальныйОстаток,
	|	НеклассифицированныеОбороты.Об_ДлинаПриход                           КАК Об_ДлинаПриход,
	|	НеклассифицированныеОбороты.Об_ДлинаРасход                           КАК Об_ДлинаРасход,
	|	НеклассифицированныеОбороты.Об_ДлинаКонечныйОстаток                  КАК Об_ДлинаКонечныйОстаток,
	|	
	|	// Показатель ""Площадь""
	|	НеклассифицированныеОбороты.Об_ПлощадьНачальныйОстаток               КАК Об_ПлощадьНачальныйОстаток,
	|	НеклассифицированныеОбороты.Об_ПлощадьПриход                         КАК Об_ПлощадьПриход,
	|	НеклассифицированныеОбороты.Об_ПлощадьРасход                         КАК Об_ПлощадьРасход,
	|	НеклассифицированныеОбороты.Об_ПлощадьКонечныйОстаток                КАК Об_ПлощадьКонечныйОстаток,
	|	
	|	// Показатель ""Стоимость""
	|	НеклассифицированныеОбороты.Об_СтоимостьПоступленияНачальныйОстаток  КАК Об_СтоимостьПоступленияНачальныйОстаток,
	|	НеклассифицированныеОбороты.Об_СтоимостьПоступленияПриход            КАК Об_СтоимостьПоступленияПриход,
	|	НеклассифицированныеОбороты.Об_СтоимостьПоступленияРасход            КАК Об_СтоимостьПоступленияРасход,
	|	НеклассифицированныеОбороты.Об_СтоимостьПоступленияКонечныйОстаток   КАК Об_СтоимостьПоступленияКонечныйОстаток,
	|	
	|	// Показатель ""Доп. расходы""
	|	НеклассифицированныеОбороты.Об_ДопРасходыНачальныйОстаток            КАК Об_ДопРасходыНачальныйОстаток,
	|	НеклассифицированныеОбороты.Об_ДопРасходыПриход                      КАК Об_ДопРасходыПриход,
	|	НеклассифицированныеОбороты.Об_ДопРасходыРасход                      КАК Об_ДопРасходыРасход,
	|	НеклассифицированныеОбороты.Об_ДопРасходыКонечныйОстаток             КАК Об_ДопРасходыКонечныйОстаток,
	|	
	|	// Показатель ""Себестоимость""
	|	НеклассифицированныеОбороты.Об_СебестоимостьНачальныйОстаток         КАК Об_СебестоимостьНачальныйОстаток,
	|	НеклассифицированныеОбороты.Об_СебестоимостьПриход                   КАК Об_СебестоимостьПриход,
	|	НеклассифицированныеОбороты.Об_СебестоимостьРасход                   КАК Об_СебестоимостьРасход,
	|	НеклассифицированныеОбороты.Об_СебестоимостьКонечныйОстаток          КАК Об_СебестоимостьКонечныйОстаток
	|ИЗ
	|	ОборотнаяАналитика КАК НеклассифицированныеОбороты
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ЕдиницыИзмеренияНоменклатуры КАК Упаковки
	|		ПО
	|			НеклассифицированныеОбороты.Номенклатура = Упаковки.Номенклатура
	|			И НеклассифицированныеОбороты.ОсновнаяЕдиницаУчета = Упаковки.ЕдиницаИзмерения}
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти // ОборотнаяАналитика

#Область АналитикаПоДокументу

Функция ТекстЗапросаСебестоимостьТоваровЗаписи()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	
	|	// Аналитика периодов
	|	СебестоимостьТоваровЗаписи.Период                            КАК ПериодСекунда,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровЗаписи.Период, ДЕНЬ)       КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровЗаписи.Период, НЕДЕЛЯ)     КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровЗаписи.Период, ДЕКАДА)     КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровЗаписи.Период, МЕСЯЦ)      КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровЗаписи.Период, КВАРТАЛ)    КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровЗаписи.Период, ПОЛУГОДИЕ)  КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровЗаписи.Период, ГОД)        КАК ПериодГод,
	|	
	|	// Структура предприятия
	|	СебестоимостьТоваровЗаписи.АналитикаВидаУчета                КАК АналитикаВидаУчета,
	|	АналитикаВида.Организация                                    КАК Организация,
	|	АналитикаВида.Склад                                          КАК Склад,
	|	АналитикаВида.ИсточникФинансирования                         КАК ИсточникФинансирования,
	|	
	|	// Общая аналитика
	|	АналитикаПартий.Поставщик                                    КАК Партнер,
	|	
	|	// Аналитика номенклатуры
	|	СебестоимостьТоваровЗаписи.АналитикаУчетаНоменклатуры        КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура                           КАК Номенклатура,
	|	АналитикаНоменклатуры.СерияНоменклатуры                      КАК СерияНоменклатуры,
	|	АналитикаНоменклатуры.Партия                                 КАК Партия,
	|	ВидыНоменклатуры.ГруппаБухгалтерскогоУчета                   КАК ГруппаБухгалтерскогоУчета,
	|	
	|	// Аналитика оборотов
	|	СебестоимостьТоваровЗаписи.СтатьяДоходов                     КАК СтатьяДоходов,
	|	СебестоимостьТоваровЗаписи.СтатьяРасходов                    КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.СтатьяДоходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка) ТОГДА
	|			СебестоимостьТоваровЗаписи.СтатьяДоходов
	|		КОГДА СебестоимостьТоваровЗаписи.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) ТОГДА
	|			СебестоимостьТоваровЗаписи.СтатьяРасходов
	|	КОНЕЦ                                                        КАК СтатьяДоходовРасходов,
	|	СебестоимостьТоваровЗаписи.АналитикаДоходов                  КАК АналитикаДоходов,
	|	СебестоимостьТоваровЗаписи.АналитикаРасходов                 КАК АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.АналитикаДоходов <> НЕОПРЕДЕЛЕНО ТОГДА
	|			СебестоимостьТоваровЗаписи.АналитикаДоходов
	|		КОГДА СебестоимостьТоваровЗаписи.АналитикаРасходов <> НЕОПРЕДЕЛЕНО ТОГДА
	|			СебестоимостьТоваровЗаписи.АналитикаРасходов
	|		ИНАЧЕ
	|			NULL
	|	КОНЕЦ                                                        КАК АналитикаДоходовРасходов,
	|	&ТекстЗапросаДоговорРегистратора                             КАК Договор,
	|	СебестоимостьТоваровЗаписи.Заказ                             КАК Заказ,
	|	&ТекстЗапросаКонтрагентРегистратора                          КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НастройкиХозопераций.Ссылка = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПеремещениеТоваровМеждуФилиалами)
	|			И СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВнутреннееПоступлениеТоваров)
	|		ИНАЧЕ
	|			НастройкиХозопераций.Ссылка
	|	КОНЕЦ                                                        КАК Хозоперация,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                        КАК ХозяйственнаяОперацияПрихода,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                        КАК ХозяйственнаяОперацияРасхода,
	|	
	|	// Аналитика-документ
	|	СебестоимостьТоваровЗаписи.Регистратор                       КАК Документ,
	|	
	|	// Показатель ""Количество""
	|	0                                                            КАК Док_КоличествоНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА
	|			СебестоимостьТоваровЗаписи.Количество
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
	|			СебестоимостьТоваровЗаписи.Количество
	|				/ Упаковки.Коэффициент
	|	КОНЕЦ                                                        КАК Док_КоличествоПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0 ТОГДА
	|			СебестоимостьТоваровЗаписи.Количество
	|		КОГДА &ЕдиницыКоличества = 1 ТОГДА
	|			СебестоимостьТоваровЗаписи.Количество
	|				/ Упаковки.Коэффициент
	|	КОНЕЦ                                                        КАК Док_КоличествоРасход,
	|	0                                                            КАК Док_КоличествоКонечныйОстаток,
	|	
	|	// Показатель ""Вес""
	|	0                                                            КАК Док_ВесНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* СебестоимостьТоваровЗаписи.Количество
	|		* &ТекстЗапросаВесНоменклатуры                           КАК Док_ВесПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* СебестоимостьТоваровЗаписи.Количество
	|		* &ТекстЗапросаВесНоменклатуры                           КАК Док_ВесРасход,
	|	0                                                            КАК Док_ВесКонечныйОстаток,
	|	
	|	// Показатель ""Объем""
	|	0                                                            КАК Док_ОбъемНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* СебестоимостьТоваровЗаписи.Количество
	|		* &ТекстЗапросаОбъемНоменклатуры                         КАК Док_ОбъемПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* СебестоимостьТоваровЗаписи.Количество
	|		* &ТекстЗапросаОбъемНоменклатуры                         КАК Док_ОбъемРасход,
	|	0                                                            КАК Док_ОбъемКонечныйОстаток,
	|	
	|	// Показатель ""Длина""
	|	0                                                            КАК Док_ДлинаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* СебестоимостьТоваровЗаписи.Количество
	|		* &ТекстЗапросаДлинаНоменклатуры                         КАК Док_ДлинаПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* СебестоимостьТоваровЗаписи.Количество
	|		* &ТекстЗапросаДлинаНоменклатуры                         КАК Док_ДлинаРасход,
	|	0                                                            КАК Док_ДлинаКонечныйОстаток,
	|	
	|	// Показатель ""Площадь""
	|	0                                                            КАК Док_ПлощадьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* СебестоимостьТоваровЗаписи.Количество
	|		* &ТекстЗапросаПлощадьНоменклатуры                       КАК Док_ПлощадьПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|		* СебестоимостьТоваровЗаписи.Количество
	|		* &ТекстЗапросаПлощадьНоменклатуры                       КАК Док_ПлощадьРасход,
	|	0                                                            КАК Док_ПлощадьКонечныйОстаток,
	|	
	|	// Показатель ""Стоимость""
	|	0                                                            КАК Док_СтоимостьПоступленияНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровЗаписи.Стоимость
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровЗаписи.СтоимостьБезНДС
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровЗаписи.СтоимостьРегл
	|	КОНЕЦ                                                        КАК Док_СтоимостьПоступленияПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровЗаписи.Стоимость
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровЗаписи.СтоимостьБезНДС
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровЗаписи.СтоимостьРегл
	|	КОНЕЦ                                                        КАК Док_СтоимостьПоступленияРасход,
	|	0                                                            КАК Док_СтоимостьПоступленияКонечныйОстаток,
	|	
	|	// Показатель ""Доп. расходы""
	|	0                                                            КАК Док_ДопРасходыНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровЗаписи.СуммаДопРасходов
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровЗаписи.СуммаДопРасходовБезНДС
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			0
	|	КОНЕЦ                                                        КАК Док_ДопРасходыПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровЗаписи.СуммаДопРасходов
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровЗаписи.СуммаДопРасходовБезНДС
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			0
	|	КОНЕЦ                                                        КАК Док_ДопРасходыРасход,
	|	0                                                            КАК Док_ДопРасходыКонечныйОстаток,
	|	
	|	// Показатель ""Себестоимость""
	|	0                                                            КАК Док_СебестоимостьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровЗаписи.Стоимость
	|				+ СебестоимостьТоваровЗаписи.СуммаДопРасходов
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровЗаписи.СтоимостьБезНДС
	|				+ СебестоимостьТоваровЗаписи.СуммаДопРасходовБезНДС
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровЗаписи.СтоимостьРегл
	|	КОНЕЦ                                                        КАК Док_СебестоимостьПриход,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|			ИНАЧЕ 0
	|	КОНЕЦ
	|	* ВЫБОР
	|		КОГДА &ДанныеОтчета = 1 ТОГДА
	|			СебестоимостьТоваровЗаписи.Стоимость
	|				+ СебестоимостьТоваровЗаписи.СуммаДопРасходов
	|		КОГДА &ДанныеОтчета = 2 ТОГДА
	|			СебестоимостьТоваровЗаписи.СтоимостьБезНДС
	|				+ СебестоимостьТоваровЗаписи.СуммаДопРасходовБезНДС
	|		КОГДА &ДанныеОтчета = 3 ТОГДА
	|			СебестоимостьТоваровЗаписи.СтоимостьРегл
	|	КОНЕЦ                                                        КАК Док_СебестоимостьРасход,
	|	0                                                            КАК Док_СебестоимостьКонечныйОстаток
	|ПОМЕСТИТЬ СебестоимостьТоваровЗаписи
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваровЗаписи
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозопераций
	|		ПО
	|			НастройкиХозопераций.ХозяйственнаяОперация = СебестоимостьТоваровЗаписи.ХозяйственнаяОперация}
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.АналитикаВидаУчета КАК АналитикаВида
	|		ПО
	|			СебестоимостьТоваровЗаписи.АналитикаВидаУчета = АналитикаВида.КлючАналитики}
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|				ПО
	|					АналитикаНоменклатуры.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка}
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					РегистрСведений.ЕдиницыИзмеренияНоменклатуры КАК Упаковки
	|				ПО
	|					АналитикаНоменклатуры.Номенклатура = Упаковки.Номенклатура
	|					И АналитикаНоменклатуры.Номенклатура.ОсновнаяЕдиницаУчета = Упаковки.ЕдиницаИзмерения}
	|				
	|				{ЛЕВОЕ СОЕДИНЕНИЕ
	|					РегистрСведений.АналитикаУчетаПартий КАК АналитикаПартий
	|				ПО
	|					АналитикаНоменклатуры.Партия = АналитикаПартий.КлючАналитики}
	|		ПО
	|			СебестоимостьТоваровЗаписи.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики}
	|{ГДЕ
	|	СебестоимостьТоваровЗаписи.Период >= &НачалоПериода,
	|	СебестоимостьТоваровЗаписи.Период <= &КонецПериода}
	|";
	
	МетаданныеРегистратора = Метаданные.РегистрыНакопления.СебестоимостьТоваров.СтандартныеРеквизиты.Регистратор;
	
	ТекстЗапросаДоговорРегистратора = ТекстЗапросаРеквизитПоляСоставногоТипа("СебестоимостьТоваровЗаписи", МетаданныеРегистратора, "ДоговорКонтрагента");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаДоговорРегистратора", ТекстЗапросаДоговорРегистратора);
	
	ТекстЗапросаКонтрагентРегистратора = ТекстЗапросаРеквизитПоляСоставногоТипа("СебестоимостьТоваровЗаписи", МетаданныеРегистратора, "Контрагент");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаКонтрагентРегистратора", ТекстЗапросаКонтрагентРегистратора);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСебестоимостьТоваровОборотыПоЗаписям()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	
	|	// Аналитика периодов
	|	Записи.ПериодСекунда                             КАК ПериодСекунда,
	|	Записи.ПериодДень                                КАК ПериодДень,
	|	Записи.ПериодНеделя                              КАК ПериодНеделя,
	|	Записи.ПериодДекада                              КАК ПериодДекада,
	|	Записи.ПериодМесяц                               КАК ПериодМесяц,
	|	Записи.ПериодКвартал                             КАК ПериодКвартал,
	|	Записи.ПериодПолугодие                           КАК ПериодПолугодие,
	|	Записи.ПериодГод                                 КАК ПериодГод,
	|	
	|	// Структура предприятия
	|	Записи.АналитикаВидаУчета                        КАК АналитикаВидаУчета,
	|	Записи.Организация                               КАК Организация,
	|	Записи.Склад                                     КАК Склад,
	|	Записи.ИсточникФинансирования                    КАК ИсточникФинансирования,
	|	
	|	// Общая аналитика
	|	Записи.Партнер                                   КАК Партнер,
	|	
	|	// Аналитика номенклатуры
	|	Записи.АналитикаУчетаНоменклатуры                КАК АналитикаУчетаНоменклатуры,
	|	Записи.Номенклатура                              КАК Номенклатура,
	|	Записи.СерияНоменклатуры                         КАК СерияНоменклатуры,
	|	Записи.Партия                                    КАК Партия,
	|	Записи.ГруппаБухгалтерскогоУчета                 КАК ГруппаБухгалтерскогоУчета,
	|	
	|	// Аналитика оборотов
	|	ВЫБОР
	|		КОГДА Записи.СтатьяДоходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка) ТОГДА
	|			NULL
	|		ИНАЧЕ
	|			Записи.СтатьяДоходов
	|	КОНЕЦ                                            КАК СтатьяДоходов,
	|	ВЫБОР
	|		КОГДА Записи.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) ТОГДА
	|			NULL
	|		ИНАЧЕ
	|			Записи.СтатьяРасходов
	|	КОНЕЦ                                            КАК СтатьяРасходов,
	|	Записи.СтатьяДоходовРасходов                     КАК СтатьяДоходовРасходов,
	|	ВЫБОР
	|		КОГДА Записи.АналитикаДоходов = НЕОПРЕДЕЛЕНО ТОГДА
	|			NULL
	|		ИНАЧЕ
	|			Записи.АналитикаДоходов
	|	КОНЕЦ                                            КАК АналитикаДоходов,
	|	ВЫБОР
	|		КОГДА Записи.АналитикаРасходов = НЕОПРЕДЕЛЕНО ТОГДА
	|			NULL
	|		ИНАЧЕ
	|			Записи.АналитикаРасходов
	|	КОНЕЦ                                            КАК АналитикаРасходов,
	|	Записи.АналитикаДоходовРасходов                  КАК АналитикаДоходовРасходов,
	|	ВЫБОР
	|		КОГДА Записи.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) ТОГДА
	|			NULL
	|		ИНАЧЕ
	|			Записи.Договор
	|	КОНЕЦ                                            КАК Договор,
	|	ВЫБОР
	|		КОГДА Записи.Заказ = НЕОПРЕДЕЛЕНО ТОГДА
	|			NULL
	|		ИНАЧЕ
	|			Записи.Заказ
	|	КОНЕЦ                                            КАК Заказ,
	|	ВЫБОР
	|		КОГДА Записи.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			NULL
	|		ИНАЧЕ
	|			Записи.Контрагент
	|	КОНЕЦ                                            КАК Контрагент,
	|	Записи.Хозоперация                               КАК Хозоперация,
	|	Записи.ХозяйственнаяОперацияПрихода              КАК ХозяйственнаяОперацияПрихода,
	|	Записи.ХозяйственнаяОперацияРасхода              КАК ХозяйственнаяОперацияРасхода,
	|	
	|	// Аналитика-документ
	|	ВЫБОР
	|		КОГДА Записи.Документ = НЕОПРЕДЕЛЕНО ТОГДА
	|			NULL
	|		ИНАЧЕ
	|			Записи.Документ
	|	КОНЕЦ                                            КАК Документ,
	|	
	|	// Показатель ""Количество""
	|	Записи.Док_КоличествоНачальныйОстаток            КАК Док_КоличествоНачальныйОстаток,
	|	Записи.Док_КоличествоПриход                      КАК Док_КоличествоПриход,
	|	Записи.Док_КоличествоРасход                      КАК Док_КоличествоРасход,
	|	Записи.Док_КоличествоКонечныйОстаток             КАК Док_КоличествоКонечныйОстаток,
	|	
	|	// Показатель ""Вес""
	|	Записи.Док_ВесНачальныйОстаток                   КАК Док_ВесНачальныйОстаток,
	|	Записи.Док_ВесПриход                             КАК Док_ВесПриход,
	|	Записи.Док_ВесРасход                             КАК Док_ВесРасход,
	|	Записи.Док_ВесКонечныйОстаток                    КАК Док_ВесКонечныйОстаток,
	|	
	|	// Показатель ""Объем""
	|	Записи.Док_ОбъемНачальныйОстаток                 КАК Док_ОбъемНачальныйОстаток,
	|	Записи.Док_ОбъемПриход                           КАК Док_ОбъемПриход,
	|	Записи.Док_ОбъемРасход                           КАК Док_ОбъемРасход,
	|	Записи.Док_ОбъемКонечныйОстаток                  КАК Док_ОбъемКонечныйОстаток,
	|	
	|	// Показатель ""Длина""
	|	Записи.Док_ДлинаНачальныйОстаток КАК             Док_ДлинаНачальныйОстаток,
	|	Записи.Док_ДлинаПриход КАК                       Док_ДлинаПриход,
	|	Записи.Док_ДлинаРасход КАК                       Док_ДлинаРасход,
	|	Записи.Док_ДлинаКонечныйОстаток                  КАК Док_ДлинаКонечныйОстаток,
	|	
	|	// Показатель ""Площадь""
	|	Записи.Док_ПлощадьНачальныйОстаток               КАК Док_ПлощадьНачальныйОстаток,
	|	Записи.Док_ПлощадьПриход                         КАК Док_ПлощадьПриход,
	|	Записи.Док_ПлощадьРасход                         КАК Док_ПлощадьРасход,
	|	Записи.Док_ПлощадьКонечныйОстаток                КАК Док_ПлощадьКонечныйОстаток,
	|	
	|	// Показатель ""Стоимость""
	|	Записи.Док_СтоимостьПоступленияНачальныйОстаток  КАК Док_СтоимостьПоступленияНачальныйОстаток,
	|	Записи.Док_СтоимостьПоступленияПриход            КАК Док_СтоимостьПоступленияПриход,
	|	Записи.Док_СтоимостьПоступленияРасход            КАК Док_СтоимостьПоступленияРасход,
	|	Записи.Док_СтоимостьПоступленияКонечныйОстаток   КАК Док_СтоимостьПоступленияКонечныйОстаток,
	|	
	|	// Показатель ""Доп. расходы""
	|	Записи.Док_ДопРасходыНачальныйОстаток            КАК Док_ДопРасходыНачальныйОстаток,
	|	Записи.Док_ДопРасходыПриход                      КАК Док_ДопРасходыПриход,
	|	Записи.Док_ДопРасходыРасход                      КАК Док_ДопРасходыРасход,
	|	Записи.Док_ДопРасходыКонечныйОстаток             КАК Док_ДопРасходыКонечныйОстаток,
	|	
	|	// Показатель ""Себестоимость""
	|	Записи.Док_СебестоимостьНачальныйОстаток         КАК Док_СебестоимостьНачальныйОстаток,
	|	Записи.Док_СебестоимостьПриход                   КАК Док_СебестоимостьПриход,
	|	Записи.Док_СебестоимостьРасход                   КАК Док_СебестоимостьРасход,
	|	Записи.Док_СебестоимостьКонечныйОстаток          КАК Док_СебестоимостьКонечныйОстаток
	|ИЗ
	|	СебестоимостьТоваровЗаписи КАК Записи
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти // АналитикаПоДокументу

#КонецОбласти // ФормированиеТекстовЗапросаНаборовДанных

#Область МодификацияРасчетаРесурсов

// Модифицирует поля итога ресурсов схемы компоновки данных,
// в зависимости от настроек компоновки данных.
//
// Параметры:
//  МакетКомпоновки   - МакетКомпоновкиДанных - исходный макет компоновки данных.
//  СхемаКомпоновки   - СхемаКомпоновкиДанных - схема, поля итога ресурсов которой будут модифицированы.
//  НастройкиОтчета   - НастройкиКомпоновкиДанных - текущие настройки компоновки данных.
//  ДанныеРасшифровки - ДанныеРасшифровкиКомпоновкиДанных - текущие данные расшифровки компоновки данных.
//
Процедура МодифицироватьПоляИтогаРесурсов(МакетКомпоновки, СхемаКомпоновки, НастройкиОтчета, Знач ДанныеРасшифровки)
	
	ПоляИтога     = СхемаКомпоновки.ПоляИтога;
	ДоступныеПоля = НастройкиОтчета.ДоступныеПоляВыбора;
	Показатели    = ПолучитьПоказателиОтчета(СхемаКомпоновки);
	
	ОборотнаяАналитика = МакетКомпоновки.НаборыДанных.Найти("ОборотнаяАналитика");
	
	ИспользуетсяОборотнаяАналитика = ОборотнаяАналитика <> Неопределено;
	
	ОбработатьИтогиОсновнойАналитики(ПоляИтога, ДоступныеПоля, Показатели, ИспользуетсяОборотнаяАналитика);
	
	Если ИспользуетсяОборотнаяАналитика Тогда
		КэшПолейГруппировкиИтога = Неопределено;
		ДобавитьИтогиОстатковОборотнойАналитики(ПоляИтога, ДоступныеПоля, Показатели, ОборотнаяАналитика, КэшПолейГруппировкиИтога);
		ДобавитьИтогиОборотовОборотнойАналитики(ПоляИтога, ДоступныеПоля, Показатели, ОборотнаяАналитика, КэшПолейГруппировкиИтога);
	КонецЕсли;
	
	АналитикаПоДокументам = МакетКомпоновки.НаборыДанных.Найти("Документы");
	Если АналитикаПоДокументам <> Неопределено Тогда
		ДобавитьИтогиАналитикиПоДокументам(ПоляИтога, ДоступныеПоля, Показатели, АналитикаПоДокументам);
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
КонецПроцедуры

Функция ПолучитьПоказателиОтчета(СхемаКомпоновки)
	
	// Получение итоговых показателей
	Показатели = Новый ТаблицаЗначений;
	Показатели.Колонки.Добавить("Поле"               , Новый ОписаниеТипов("Строка"));
	Показатели.Колонки.Добавить("ПутьКДанным"        , Новый ОписаниеТипов("Строка"));
	Показатели.Колонки.Добавить("Группа"             , Новый ОписаниеТипов("Строка"));
	Показатели.Колонки.Добавить("ЭтоНачальныйОстаток", Новый ОписаниеТипов("Булево"));
	Показатели.Колонки.Добавить("ЭтоПриход"          , Новый ОписаниеТипов("Булево"));
	Показатели.Колонки.Добавить("ЭтоРасход"          , Новый ОписаниеТипов("Булево"));
	Показатели.Колонки.Добавить("ЭтоКонечныйОстаток" , Новый ОписаниеТипов("Булево"));
	
	// Показатели берутся из основной аналитики схемы компоновки,
	// т.к. нужно получить все показатели, а не только те, которые попали в макет компоновки.
	ПоляОсновногоНабора = СхемаКомпоновки.НаборыДанных.ОсновнаяАналитика.Поля;
	Для Каждого ПолеНабора Из ПоляОсновногоНабора Цикл
		
		Если ТипЗнч(ПолеНабора) <> Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПолеНабора.ТипЗначения.СодержитТип(Тип("Число")) И СтрНачинаетсяС(ПолеНабора.ПутьКДанным, "Показатели") Тогда
			
			Показатель = Показатели.Добавить();
			ЗаполнитьЗначенияСвойств(Показатель, ПолеНабора);
			
			Если ПолеНабора.Роль.Остаток Тогда
				Показатель.Группа = ПолеНабора.Роль.ГруппаОстатка;
				Показатель.ЭтоНачальныйОстаток = ПолеНабора.Роль.ТипОстатка = ТипОстаткаКомпоновкиДанных.НачальныйОстаток;
				Показатель.ЭтоКонечныйОстаток = ПолеНабора.Роль.ТипОстатка = ТипОстаткаКомпоновкиДанных.КонечныйОстаток;
			Иначе
				Показатель.Группа = СтрРазделить(ПолеНабора.ПутьКДанным, ".", Ложь)[1];
				Показатель.ЭтоПриход = СтрЗаканчиваетсяНа(ПолеНабора.Поле, "Приход");
				Показатель.ЭтоРасход = СтрЗаканчиваетсяНа(ПолеНабора.Поле, "Расход");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Показатели;
	
КонецФункции

Функция УчестьЕдиницуИзмеренияПоказателя(ДоступноеПоле)
	
	// Для количественных показателей необходимо учитывать настройки расчета итогов по единице измерения.
	// Если единица учитывается, тогда для группировки, с разными единицами измерения в записях,
	// не будет рассчитан итог по количеству, т.к. некорректно суммировать показатели с разными единицами.
	Если ДоступноеПоле.Родитель <> Неопределено И ДоступноеПоле.Родитель.Поле = Новый ПолеКомпоновкиДанных("Показатели.Количество") Тогда
		
		Возврат "
		|* ВЫБОР
		|	КОГДА &КоличественныеИтогиПоЕдИзм И КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АналитикаНоменклатуры.ЕдиницаОтчета) > 1 ТОГДА
		|		0
		|	ИНАЧЕ
		|		1
		|КОНЕЦ
		|";
		
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Процедура ОбработатьИтогиОсновнойАналитики(ПоляИтога, ДоступныеПоля, Показатели, ИспользуетсяОборотнаяАналитика)
	
	Для Каждого Показатель Из Показатели Цикл
		
		ПутьКДаннымПоказателя = Показатель.ПутьКДанным;
		
		ПолеИтога = ПоляИтога.Найти(ПутьКДаннымПоказателя);
		Если ПолеИтога = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДоступноеПолеПоказателя = ДоступныеПоля.НайтиПоле(Новый ПолеКомпоновкиДанных(ПутьКДаннымПоказателя));
		Если ДоступноеПолеПоказателя = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СформироватьВыражениеИтогаОсновнойАналитики(ДоступноеПолеПоказателя, Показатель, ПолеИтога, ИспользуетсяОборотнаяАналитика);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьВыражениеИтогаОсновнойАналитики(ДоступноеПоле, Показатель, ПолеИтога, ИспользуетсяОборотнаяАналитика)
	
	Если ИспользуетсяОборотнаяАналитика И Не Показатель.ЭтоНачальныйОстаток И Не Показатель.ЭтоКонечныйОстаток Тогда
		ШаблонПолученияИтога = "СУММА(Док_%1)";
		ПолеИтога.Выражение = СтрШаблон(ШаблонПолученияИтога, Показатель.Поле);
	КонецЕсли;
	
	ПолеИтога.Выражение = ПолеИтога.Выражение + УчестьЕдиницуИзмеренияПоказателя(ДоступноеПоле);
	
КонецПроцедуры

Процедура ДобавитьИтогиОстатковОборотнойАналитики(ПоляИтога, ДоступныеПоля, Показатели, ОборотнаяАналитика, КэшПолейГруппировкиИтога)
	
	Для Каждого Показатель Из Показатели Цикл
		
		Если Показатель.ЭтоПриход Или Показатель.ЭтоРасход Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппировкиПоляИтога = Новый Массив;
		Для Каждого ПолеНабора Из ОборотнаяАналитика.Поля Цикл
			
			ПутьКДаннымГруппировки = ПолеНабора.ПутьКДанным;
			
			ДоступноеПоле = ДоступныеПоля.НайтиПоле(Новый ПолеКомпоновкиДанных(ПутьКДаннымГруппировки));
			Если ДоступноеПоле = Неопределено
			 Или ДоступноеПоле.Родитель = Неопределено
			 Или ДоступноеПоле.Родитель.Поле <> Новый ПолеКомпоновкиДанных("АналитикаОборотов") Тогда
				Продолжить;
			КонецЕсли;
			
			СформироватьПоляГруппировкиИтогаОборотнойАналитики(ДоступноеПоле, ПутьКДаннымГруппировки, ГруппировкиПоляИтога, КэшПолейГруппировкиИтога);
			
		КонецЦикла;
		
		Если ГруппировкиПоляИтога.Количество() > 0 Тогда
			
			НовоеПолеИтога = ПоляИтога.Добавить();
			НовоеПолеИтога.ПутьКДанным = Показатель.ПутьКДанным;
			НовоеПолеИтога.Выражение = "0";
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НовоеПолеИтога.Группировки, ГруппировкиПоляИтога);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИтогиОборотовОборотнойАналитики(ПоляИтога, ДоступныеПоля, Показатели, ОборотнаяАналитика, КэшПолейГруппировкиИтога)
	
	Для Каждого Показатель Из Показатели Цикл
		
		Если Показатель.ЭтоНачальныйОстаток Или Показатель.ЭтоКонечныйОстаток Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДаннымПоказателя = Показатель.ПутьКДанным;
		ДоступноеПолеПоказателя = ДоступныеПоля.НайтиПоле(Новый ПолеКомпоновкиДанных(ПутьКДаннымПоказателя));
		Если ДоступноеПолеПоказателя = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ПолеНабора Из ОборотнаяАналитика.Поля Цикл
			
			ПутьКДаннымГруппировки = ПолеНабора.ПутьКДанным;
			ДоступноеПолеГруппировки = ДоступныеПоля.НайтиПоле(Новый ПолеКомпоновкиДанных(ПутьКДаннымГруппировки));
			Если ДоступноеПолеГруппировки = Неопределено
			 Или ДоступноеПолеГруппировки.Родитель = Неопределено
			 Или ДоступноеПолеГруппировки.Родитель.Поле <> Новый ПолеКомпоновкиДанных("АналитикаОборотов") Тогда
				Продолжить;
			КонецЕсли;
			
			ГруппировкиПоляИтога = Новый Массив;
			СформироватьПоляГруппировкиИтогаОборотнойАналитики(ДоступноеПолеГруппировки, ПутьКДаннымГруппировки, ГруппировкиПоляИтога, КэшПолейГруппировкиИтога);
			
			Если ГруппировкиПоляИтога.Количество() > 0 Тогда
				
				НовоеПолеИтога = ПоляИтога.Добавить();
				НовоеПолеИтога.ПутьКДанным = ПутьКДаннымПоказателя;
				
				СформироватьВыражениеИтогаОборотнойАналитики(ДоступноеПолеПоказателя, Показатель, ПутьКДаннымГруппировки, НовоеПолеИтога);
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НовоеПолеИтога.Группировки, ГруппировкиПоляИтога);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьВыражениеИтогаОборотнойАналитики(ДоступноеПоле, Показатель, ПутьКДаннымГруппировки, ПолеИтога)
	
	Если Показатель.ЭтоНачальныйОстаток Или Показатель.ЭтоКонечныйОстаток Тогда
		ПолеИтога.Выражение = "0";
	ИначеЕсли Показатель.ЭтоПриход Или Показатель.ЭтоРасход Тогда
		
		// Набор данных ОборотнаяАналитика состоит из классифицированных и неклассифицированных оборотов оборотных регистров накопления.
		// Классифицированные - это обороты с указанными ключевыми полями по оборотной аналитике.
		// Неклассифицированные - это продублированные обороты, но с ключевыми полями установленными в NULL.
		// Такая конструкция предназначена для получения детализации из регистра Себестоимость товаров, посредством соединения ключевых полей.
		// При этом, если в регистре Себестоимости есть записи с указанными значениями ключевых полей Оборотной аналитики,
		// они будут отражены в отчете по конкретному полю аналитики, в противном случае
		// (данные в регистре себестоимости товаров не классифицировались при формировании движений в разрезе оборотной аналитики),
		// данные по регистру Себестоимость будут свернуты в группу <Неклассифицированные обороты>.
		// Выражение ниже необходимо для исключения Классифицированных оборотов из Неклассифицированных.
		// Принцип расчета следующий:
		//  Ключевые поля оборотной аналитики упорядочены так, что NULL (Неклассифицированные обороты) будет находиться в конце
		//  (см. Выражение упорядочивания набора данных схемы компоновки).
		//  Для каждой группировки, в которой заполнено значение ключевого поля (Классифицированные обороты)
		//  будет выполняться только верхняя часть выражения.
		//  Когда вывод результата компоновки дойдет до NULL (Неклассифицированных оборотов), из результата вычисления итога,
		//  по данной группировке, будет вычтен результат предыдущих расчетов (Классифицированных оборотов).
		
		ШаблонПолученияИтога = "
		|(ВЫБОР
		|	КОГДА СУММА(Док_%2) ЕСТЬ NULL ТОГДА
		|		0
		|	КОГДА СУММА(Об_%2) > СУММА(Док_%2) ТОГДА
		|		СУММА(Док_%2)
		|	ИНАЧЕ
		|		СУММА(Об_%2)
		|КОНЕЦ
		|- ЕСТЬNULL(
		|	ВЫБОР
		|		КОГДА %1 ЕСТЬ NULL ТОГДА
		|			ВЫЧИСЛИТЬВЫРАЖЕНИЕ(""
		|				ВЫБОР
		|					КОГДА СУММА(Док_%2) ЕСТЬ NULL ТОГДА
		|						0
		|					КОГДА СУММА(Об_%2) > СУММА(Док_%2) ТОГДА
		|						СУММА(Док_%2)
		|					ИНАЧЕ
		|						СУММА(Об_%2)
		|				КОНЕЦ
		|				- СУММА(Док_%2)"",
		|				"""", ""Группировка"", ""Первая"", ""Текущая"")
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ
		|	, 0)
		|* (1 + 0 * %3))
		|";
		
		ПолеИтога.Выражение = СтрШаблон(ШаблонПолученияИтога, ПутьКДаннымГруппировки, Показатель.Поле, Показатель.ПутьКДанным);
		ПолеИтога.Выражение = ПолеИтога.Выражение + УчестьЕдиницуИзмеренияПоказателя(ДоступноеПоле);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПоляГруппировкиИтогаОборотнойАналитики(ДоступноеПоле, ПутьКДаннымГруппировки, Группировки, КэшПолейГруппировкиИтога)
	
	Если КэшПолейГруппировкиИтога = Неопределено Тогда
		КэшПолейГруппировкиИтога = Новый Соответствие;
	КонецЕсли;
	
	ПоляГруппировкиИтога = КэшПолейГруппировкиИтога.Получить(ПутьКДаннымГруппировки);
	Если ПоляГруппировкиИтога = Неопределено Тогда
		
		ПоляГруппировкиИтога = Новый Массив;
		ПоляГруппировкиИтога.Добавить(ПутьКДаннымГруппировки);
		
		ТипыПоляАналитикиОборотов = ДоступноеПоле.Тип.Типы();
		Для Каждого ТипПоляАналитикиОборотов Из ТипыПоляАналитикиОборотов Цикл
			
			МетаданныеПоля = Метаданные.НайтиПоТипу(ТипПоляАналитикиОборотов);
			Если МетаданныеПоля <> Неопределено И ОбщегоНазначения.ЭтоСправочник(МетаданныеПоля) И МетаданныеПоля.Иерархический Тогда
				
				ПоляГруппировкиИтога.Добавить(ПутьКДаннымГруппировки + " " + "Иерархия");
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		КэшПолейГруппировкиИтога.Вставить(ПутьКДаннымГруппировки, ПоляГруппировкиИтога);
		
	КонецЕсли;
	
	Для Каждого ПолеГруппировкиИтога Из ПоляГруппировкиИтога Цикл
		Группировки.Добавить(ПолеГруппировкиИтога);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИтогиАналитикиПоДокументам(ПоляИтога, ДоступныеПоля, Показатели, АналитикаПоДокументам)
	
	// Добавление полей итогов аналитики по документам
	Для Каждого ПолеНабора Из АналитикаПоДокументам.Поля Цикл
		
		ПутьКДаннымГруппировки = ПолеНабора.ПутьКДанным;
		
		Если ПутьКДаннымГруппировки <> "Документ" Тогда
			Продолжить;
		КонецЕсли;
		
		// Формирование полей итогов
		Для Каждого Показатель Из Показатели Цикл
			
			ПутьКДаннымПоказателя = Показатель.ПутьКДанным;
			
			ДоступноеПолеПоказателя = ДоступныеПоля.НайтиПоле(Новый ПолеКомпоновкиДанных(ПутьКДаннымПоказателя));
			Если ДоступноеПолеПоказателя = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НовоеПолеИтога = ПоляИтога.Добавить();
			НовоеПолеИтога.ПутьКДанным = ПутьКДаннымПоказателя;
			НовоеПолеИтога.Группировки.Добавить("Документ");
			
			СформироватьВыражениеИтогаАналитикиПоДокументам(ДоступноеПолеПоказателя, Показатель, НовоеПолеИтога);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьВыражениеИтогаАналитикиПоДокументам(ДоступноеПоле, Показатель, ПолеИтога)
	
	ШаблонПолученияИтога = "0";
	Если Показатель.ЭтоНачальныйОстаток Тогда
		
		// Для каждой записи набора данных АналитикаПоДокументам, показатели набора ОсновнаяАналитика будут одинаковыми,
		// т.к. аналитика по документам присоединяется к основной аналитике левым соединением.
		// Для текущей записи аналитики по документам берутся начальные остатки из основной аналитики,
		// прибавляются все предыдущие приходы аналитики по документам
		// и вычитаются все предыдущие расходы аналитики по документам.
		// В итоге получаются начальные остатки аналитики по документам для текущей записи.
		
		ШаблонПолученияИтога = "
		|СУММА(Показатели.%1.%1НачальныйОстаток)
		|+ ЕСТЬNULL(ВЫЧИСЛИТЬВЫРАЖЕНИЕ(""СУММА(Док_%1Приход)"",,,""Первая"", ""Предыдущая""), 0)
		|- ЕСТЬNULL(ВЫЧИСЛИТЬВЫРАЖЕНИЕ(""СУММА(Док_%1Расход)"",,,""Первая"", ""Предыдущая""), 0)
		|";
		
		ПолеИтога.Выражение = СтрШаблон(ШаблонПолученияИтога, Показатель.Группа);
		
	ИначеЕсли Показатель.ЭтоПриход Тогда
		
		ШаблонПолученияИтога = "
		|СУММА(Док_%1Приход) * (1 + 0 * СУММА(%2))
		|";
		
		ПолеИтога.Выражение = СтрШаблон(ШаблонПолученияИтога, Показатель.Группа, Показатель.ПутьКДанным);
		
	ИначеЕсли Показатель.ЭтоРасход Тогда
		
		ШаблонПолученияИтога = "
		|СУММА(Док_%1Расход) * (1 + 0 * СУММА(%2))
		|";
		
		ПолеИтога.Выражение = СтрШаблон(ШаблонПолученияИтога, Показатель.Группа, Показатель.ПутьКДанным);
		
	ИначеЕсли Показатель.ЭтоКонечныйОстаток Тогда
		
		// Для каждой записи набора данных АналитикаПоДокументам, показатели набора ОсновнаяАналитика будут одинаковыми,
		// т.к. аналитика по документам присоединяется к основной аналитике левым соединением.
		// Для текущей записи аналитики по документам берутся начальные остатки из основной аналитики,
		// прибавляются все предыдущие приходы, включая текущую запись, аналитики по документам
		// и вычитаются все предыдущие расходы, включая текущую запись, аналитики по документам.
		// В итоге получаются конечные остатки аналитики по документам для текущей записи.
		
		ШаблонПолученияИтога = "
		|СУММА(Показатели.%1.%1НачальныйОстаток)
		|+ ЕСТЬNULL(ВЫЧИСЛИТЬВЫРАЖЕНИЕ(""СУММА(Док_%1Приход)"",,,""Первая"", ""Текущая""), 0)
		|- ЕСТЬNULL(ВЫЧИСЛИТЬВЫРАЖЕНИЕ(""СУММА(Док_%1Расход)"",,,""Первая"", ""Текущая""), 0)
		|";
		
		ПолеИтога.Выражение = СтрШаблон(ШаблонПолученияИтога, Показатель.Группа);
		
	КонецЕсли;
	
	ПолеИтога.Выражение = ПолеИтога.Выражение + УчестьЕдиницуИзмеренияПоказателя(ДоступноеПоле);
	
КонецПроцедуры

#КонецОбласти // МодификацияРасчетаРесурсов

#Область Прочее

Процедура НастроитьПараметрыОтборыПоФункциональнымОпциям(КомпоновщикНастроек)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		ОбщегоНазначенияБольничнаяАптека.УдалитьЭлементОтбораИзВсехНастроекОтчета(КомпоновщикНастроек, "СтруктураПредприятия.Организация");
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтрольИспользованияАналитикиОборотов(КомпоновщикНастроек)
	
	Группировки = ОтчетыБольничнаяАптекаКлиентСервер.ПолучитьГруппировки(КомпоновщикНастроек);
	
	Для Каждого Группировка Из Группировки Цикл
		
		ПоляГруппировки = Группировка.Значение.ПоляГруппировки.Элементы;
		КоличествоПолейАналитикиОборотов = 0;
		
		Для Каждого ПолеГруппировки Из ПоляГруппировки Цикл
			
			Если Найти(Строка(ПолеГруппировки.Поле), "АналитикаОборотов") > 0 Тогда
				КоличествоПолейАналитикиОборотов = КоличествоПолейАналитикиОборотов + 1;
			КонецЕсли;
			
			Если КоличествоПолейАналитикиОборотов > 1 Тогда
				ВызватьИсключение НСтр("ru= 'Множественное использование полей аналитики оборотов в группировках не поддерживается.'");
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоПолейАналитикиОборотов >= 1 И ПоляГруппировки.Количество() > 1 Тогда
			ВызватьИсключение НСтр("ru= 'Совместное использование в группировках полей аналитики оборотов и других полей не поддерживается.'");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодключитьЗапрос(ДинамическийТекстЗапроса, ПодключаемыйЗапрос, ТипПодключения)
	
	Если ТипПодключения = ТипПодключенияПакет() Тогда
		ДинамическийТекстЗапроса = ДинамическийТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
		ДинамическийТекстЗапроса = ДинамическийТекстЗапроса + ПодключаемыйЗапрос;
	ИначеЕсли ТипПодключения = ТипПодключенияОператор() Тогда
		ДинамическийТекстЗапроса = ДинамическийТекстЗапроса + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС;
		ДинамическийТекстЗапроса = ДинамическийТекстЗапроса + СтрЗаменить(ПодключаемыйЗапрос, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
КонецПроцедуры

Функция ТипПодключенияПакет()
	Возврат "Пакет";
КонецФункции

Функция ТипПодключенияОператор()
	Возврат "Оператор";
КонецФункции

Функция ДанныеЗаголовковВалют()
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ИспользоватьНесколькоВалют = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют");
	
	СтруктураЗаголовков = Новый Структура;
	СтруктураЗаголовков.Вставить("ВалютаОтчета", СтрШаблон("(%1)", ?(ИспользоватьНесколькоВалют, ВалютаРегламентированногоУчета, "")));
	
	Возврат СтруктураЗаголовков;
	
КонецФункции

#КонецОбласти // Прочее

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
