Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не (Минута(Запись.ВремяВыполнения) = 30 ИЛИ Минута(Запись.ВремяВыполнения) = 0) Тогда 
			ТекстОшибки = "Задайте время выполнения кратное получасу!";
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
		ИначеЕсли Секунда(Запись.ВремяВыполнения) <> 0 Тогда 
			ТекстОшибки = "Задайте время выполнения кратное получасу!";
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
		КонецЕсли;		
	КонецЦикла;

КонецПроцедуры
