
Функция ПингGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.УстановитьТелоИзСтроки("ok");
	
	Возврат Ответ;
КонецФункции


Процедура ЗафиксироватьДанныеОбОплате(Структ,Рез)
	
 	//"Команда,ИДЗаявки,ИдПлатежногоПоручения,СуммаДокумент,ДатаПП,НомерПП,Проведен",

	СсылкаНаЗаявку=Документы.сок_ЗаявкаНаРасходованиеДенежныхСредств.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.ИДЗаявки));
	Элемент = СсылкаНаЗаявку.ПолучитьОбъект();
	Если Элемент=Неопределено Тогда
		Рез.ТелоОтвета = "Не обнаружена заявка на расходование денежных средств с идентифкаторм "+Структ.ИДЗаявки;
		Возврат;
	Иначе
		Стр=Элемент.Оплаты.Найти(Структ.ИдПлатежногоПоручения,"ИдентификторПП");
		Если Стр=Неопределено Тогда
			Если НЕ Структ.Проведен Тогда
				Рез.Ок=Истина;
				Возврат;
			КонецЕсли;	
			Стр=Элемент.Оплаты.Добавить(); 
			Стр.ИдентификторПП=Структ.ИдПлатежногоПоручения;
		Иначе	
			Если Стр.Сумма=Структ.СуммаДокумента И Стр.НомерПП=Структ.НомерПП И НачалоДня(Стр.ДатаПП)=НачалоДня(Структ.ДатаПП) Тогда
				Рез.Ок=Истина;
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
		Стр.Сумма=Структ.СуммаДокумента;
		Стр.НомерПП=Структ.НомерПП;
		Стр.ДатаПП=НачалоДня(Структ.ДатаПП);
		Если НЕ Структ.Проведен Тогда
			Элемент.Оплаты.Удалить(Элемент.Оплаты.Индекс(Стр));
		КонецЕсли;	
		Попытка
			Элемент.Записать(РежимЗаписиДокумента.Проведение);
			Рез.Ок=Истина;
		Исключение
			Рез.ТелоОтвета = "Не удалось записать в Аптеке документ "+Элемент.Ссылка;
		Конецпопытки;	
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ИзменитьСтатусЗаявки(ДанныеИзБитФинанс,Рез)
	СсылкаНаЗаявку=Документы.сок_ЗаявкаНаРасходованиеДенежныхСредств.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеИзБитФинанс.ИДЗаявки));
	Элемент = СсылкаНаЗаявку.ПолучитьОбъект();
	Если Элемент=Неопределено Тогда
		Рез.ТелоОтвета = "Не обнаружена заявка на расходование денежных средств с идентифкаторм "+ДанныеИзБитФинанс.ИДЗаявки;
		Возврат;
	Иначе
		Элемент.СостояниеЗаявки=ДанныеИзБитФинанс.СтатусЗаявки;
		Элемент.ОбменДанными.Загрузка=Истина;
		Если НЕ Элемент.Отправлена Тогда
			Элемент.НомерВБитФинанс=ДанныеИзБитФинанс.Номер;
			Элемент.Отправлена=Истина;
			Элемент.ДатаОтправки=ТекущаяДата();
		КонецЕсли;	
		Попытка
		       Элемент.Записать();
			   Рез.ТелоОтвета = "Ок. Статус изменен на "+Элемент.СостояниеЗаявки;
		  Исключение
		  Рез.ТелоОтвета = "Не удалось записать заявку при изменении статуса заявки "+СсылкаНаЗаявку+" "+ОписаниеОшибки();;
			   
		КонецПопытки;	   
	КонецЕсли;
КонецПроцедуры	

Функция ОбменPOST(Запрос)
	
	Структ = ЗначениеИзСтрокиВнутр(Запрос.ПолучитьТелоКакСтроку());
	Рез=Новый Структура("Ок,Ид,ТелоОтвета",Ложь,"","");
	Если ТипЗнч(Структ)=Тип("Массив") Тогда
		Масс=Структ;
	Иначе
		Масс=Новый Массив;
		Масс.Добавить(Структ);
	КонецЕсли;	
	Для Каждого Структ из Масс Цикл
		Если Структ.Команда="ПроведениеСписаниеСРасчетногоСчета" Тогда
			ЗафиксироватьДанныеОбОплате(Структ,Рез);
		ИначеЕсли Структ.Команда="ИзменениеСтатусаЗаявки" Тогда	
			ИзменитьСтатусЗаявки(Структ,Рез);
		КонецЕсли;
	КонецЦикла;
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ЗначениеВстрокуВнутр(Рез));
	Возврат Ответ;
	
КонецФункции

Функция ОбменGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки("Привет из Аптеки");
	Возврат Ответ;
	
КонецФункции


