
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		ЭтотОбъект.Состояние=Перечисления.сок_СостоянияФормулярныхСписков.Подготовлен;
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.сок_ФормулярныйСписок.Очистить();
	Если ЭтотОбъект.Состояние=Перечисления.сок_СостоянияФормулярныхСписков.Утвержден Тогда
		Для Каждого Стр из Товары Цикл
			Если НЕ Стр.Отменено Тогда
				Движение=Движения.сок_ФормулярныйСписок.Добавить();
				Движение.Активность=Истина;
				Движение.VENКлассификация=Стр.VENКлассификация;
				Движение.НеСнижаемыйОстатокВСтационаре=Стр.НеСнижаемыйОстатокВСтационаре;
				Движение.ДействующиеВеществаМНН=Стр.ДействующиеВеществаМНН;
				Движение.Организация=Организация;
				Движение.Период=ДатаНачала;
				Движение.Разрешен=Не Стр.Запрещен;
				Движение.Регистратор=Ссылка;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ ЭтотОбъект.Состояние=Перечисления.сок_СостоянияФормулярныхСписков.Подготовлен Тогда
		Если НЕ сок_Сервер.ЭтоСовсемПолныеПрава() Тогда
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		ТЗ=Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("ДействующиеВеществаМНН");
		ТЗ.Колонки.Добавить("VENКлассификация");
		Для Каждого Стр из Товары Цикл
			Масс=ТЗ.НайтиСтроки(Новый структура("ДействующиеВеществаМНН,VENКлассификация",Стр.ДействующиеВеществаМНН,Стр.VENКлассификация));
			Если Масс.Количество()=0 Тогда
				СтрТЗ=ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТЗ,Стр);
			Иначе
				ТекстСообщения="В строке "+Стр.НомерСтроки+" действующее вещество "+Стр.ДействующиеВеществаМНН+" классивфикация "+Стр.VENКлассификация+" повторяется. Проведение не возможно";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Ссылка,,,Отказ);
			КонецЕсли;	
		КонецЦикла;	
КонецПроцедуры
