#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	ИнтеграцияЭДО.ВыполнитьКонтрольОтраженияВУчетеПриЗаписиУчетногоДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСФайлами.УстановитьПометкуУдаленияПрисоединенныхФайловДокументов(ЭтотОбъект, Отказ, Ложь, Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли