
#Область ПрограммныйИнтерфейс

///
// Функция МетаданныеИспользуютсяПодсистемой
//      определяет использование подсистемы Архивирования по полному имени метаданных.
// Параметры:
//   ТипОбъекта - {Тип}
//      тип объекта, можно получить методом ТипЗнч
// Возврат:
//   {Булево}
//      Истина - если объект архивируется
///
Функция МетаданныеИспользуютсяПодсистемой(Знач ПолноеИмяМетаданных) Экспорт
	
	Если НЕ ТипЗнч(ПолноеИмяМетаданных) = Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданных);
	
	ИмяРеквизитаАрхивности_ = Архивирование.ОпределитьИмяРеквизита(МетаданныеОбъекта);
	
	Возврат ЗначениеЗаполнено(ИмяРеквизитаАрхивности_);
	
КонецФункции

///
// Функция ПолучитьСоставПоискаСсылок
//      возвращает массив ссылок на все использующие архивирование объекты.
// Возврат:
//   {Массив}
//      Массив полноых путей к метаданным, использущим подсистему архивирования
///
Функция ПолучитьМассивОбъектовПодсистемы() Экспорт
	
	МассивСсылок = Новый Массив();
	Для Каждого Справочник_ Из Метаданные.Справочники Цикл
		ИмяРеквизитаАрхивности_ = Архивирование.ОпределитьИмяРеквизита(Справочник_);
		Если ЗначениеЗаполнено(ИмяРеквизитаАрхивности_) Тогда
			МассивСсылок.Добавить(Справочник_.ПолноеИмя());
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСсылок;
	
КонецФункции


#КонецОбласти