#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

Функция ЗначениеПоУмолчанию() Экспорт
	
	НастройкиОбмена = Новый Структура;
	НастройкиОбмена.Вставить("АдресWSDL"             , "");
	НастройкиОбмена.Вставить("URIПространстваИмен"   , "http://www.localhost/ws");
	НастройкиОбмена.Вставить("ИмяСервиса"            , "ZipDataUpload");
	НастройкиОбмена.Вставить("ИмяТочкиПодключения"   , "ZipDataUploadSoap");
	НастройкиОбмена.Вставить("ИмяПользователя"       , "");
	НастройкиОбмена.Вставить("Пароль"                , "");
	
	Возврат Новый ХранилищеЗначения(Новый ФиксированнаяСтруктура(НастройкиОбмена));
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли