
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

// Добавляет в список команды отчетов по умолчанию
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - полное имя объекта для которого нужно добавить команды отчетов.
//  КомандыОтчетов - ТаблицаЗначений - Таблица команд для вывода в подменю. Для изменения.
//
Процедура ДобавитьОбщиеКоманды(ПолноеИмяОбъекта, КомандыОтчетов, НастройкиФормы) Экспорт
	
	
	
КонецПроцедуры

// Возвращает идентификатор подменю "Отчеты->Важное"
//
Функция ПодменюОтчетыВажное() Экспорт
	Возврат "Важное";
КонецФункции

// Возвращает идентификатор подменю "Отчеты->Обычное"
//
Функция ПодменюОтчетыОбычное() Экспорт
	Возврат "Обычное";
КонецФункции

// Возвращает идентификатор подменю "Отчеты->См.также"
//
Функция ПодменюОтчетыСмТакже() Экспорт
	Возврат "СмТакже";
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
