

#Область ПрограммныйИнтерфейс

// Заполняет при изменении данные физического лица по ссылке.
//
// Параметры:
//  ФизЛицо - СправочникСсылка - ссылка на элемент справочника, по которому получаются данные.
//  Сведения - см. МашиночитаемыеДоверенности.НовыеДанныеФизЛица
//
Процедура ПриИзмененииДанныеФизЛица(ФизЛицо, Сведения) Экспорт
	
	// БольничнаяАптека
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = "ДатаРождения, ИНН, Пол, СНИЛС, Наименование";
	СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФизЛицо, Реквизиты);
	ДанныеФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СтруктураДанных.Наименование);
	
	Сведения.ДатаРождения      = СтруктураДанных.ДатаРождения;
	Сведения.ИНН               = СтруктураДанных.ИНН;
	Сведения.Пол               = Строка(СтруктураДанных.Пол);
	Сведения.СтраховойНомерПФР = СтруктураДанных.СНИЛС;
	Сведения.ФИО               = СтруктураДанных.Наименование;
	Сведения.Фамилия           = ДанныеФИО.Фамилия;
	Сведения.Имя               = ДанныеФИО.Имя;
	Сведения.Отчество          = ДанныеФИО.Отчество;
	Сведения.Гражданство       = Справочники.СтраныМира.Россия;
	
	//Запрос = Новый Запрос("
	//|ВЫБРАТЬ ПЕРВЫЕ 2
	//|	ДокументыФизическихЛицСрезПоследних.ВидДокумента         КАК ВидДокумента,
	//|	ДокументыФизическихЛицСрезПоследних.Серия                КАК Серия,
	//|	ДокументыФизическихЛицСрезПоследних.Номер                КАК Номер,
	//|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи           КАК ДатаВыдачи,
	//|	ДокументыФизическихЛицСрезПоследних.СрокДействия         КАК СрокДействия,
	//|	ДокументыФизическихЛицСрезПоследних.КемВыдан             КАК КемВыдан,
	//|	ДокументыФизическихЛицСрезПоследних.КодПодразделения     КАК КодПодразделения
	//|ИЗ
	//|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	//|			,
	//|			Физлицо = &ФизЛицо
	//|				И ЯвляетсяДокументомУдостоверяющимЛичность) КАК ДокументыФизическихЛицСрезПоследних
	//|");
	//
	//Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	//
	//ДанныеДокументаФизЛица = Запрос.Выполнить().Выбрать();
	//
	//Если ДанныеДокументаФизЛица.Количество() = 1 Тогда
	//	
	//	// Если в базе есть только один документ, то вернем его данные.
	//	// Если документов больше чем один, то ничего не возвращаем т.к. непонятно, данные какого документа нужны.
	//	ДанныеДокументаФизЛица.Следующий();
	//	ЗаполнитьЗначенияСвойств(Сведения, ДанныеДокументаФизЛица);
	//	Сведения.КодФНС = ;
	//	
	//КонецЕсли;
	// Конец БольничнаяАптека
	
КонецПроцедуры

#КонецОбласти
