#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

Функция ЗначениеПоУмолчанию() Экспорт
	
	НастройкиОбмена = Новый Структура;
	НастройкиОбмена.Вставить("АдресСервисаМинздраваРФ"                             , "https://nsi.rosminzdrav.ru");
	НастройкиОбмена.Вставить("АдресРесурса"                                        , "port/rest");
	НастройкиОбмена.Вставить("ИдентификаторПользователя"                           , "");
	НастройкиОбмена.Вставить("ИдентификаторКлассификатора_СтруктурныеПодразделения", "1.2.643.5.1.13.13.99.2.114");
	НастройкиОбмена.Вставить("ИдентификаторКлассификатора_Отделения"               , "1.2.643.5.1.13.13.99.2.115");
	НастройкиОбмена.Вставить("ИдентификаторКлассификатора_Должности"               , "1.2.643.5.1.13.13.99.2.181");
	НастройкиОбмена.Вставить("ИдентификаторКлассификатора_Должности1002"           , "1.2.643.5.1.13.13.11.1002");
	
	Возврат Новый ХранилищеЗначения(Новый ФиксированнаяСтруктура(НастройкиОбмена));
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли