
Процедура ПередЗаписью(Отказ)
	Запрос_ = Новый Запрос(
		"ВЫБРАТЬ
		|	СправочникиФНСИ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СправочникиФНСИ КАК СправочникиФНСИ
		|ГДЕ
		|	СправочникиФНСИ.Синоним = &Синоним
		|	И СправочникиФНСИ.Ссылка <> &Ссылка"
	);
	
	Запрос_.УстановитьПараметр("Синоним", ЭтотОбъект.Синоним);
	Запрос_.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Результат_ = НЕ Запрос_.Выполнить().Пустой();
	
	Если Результат_ Тогда
		ВызватьИсключение(СтрШаблон("Карточка справочника %1 уже существует", ЭтотОбъект.Синоним));
	КонецЕсли;
КонецПроцедуры
