
&НаКлиенте
Процедура ЖурналПК(Команда)
	
	ФормаОтчёта = ПолучитьФорму("Отчет.Бит_ЖурналПриемочногоКонтроля.Форма");
	КомпоновщикНастроек = ФормаОтчёта.Отчет.КомпоновщикНастроек;
	
	СкладАптеки = сок_Сервер.ПолучитьСкладАптека();
	УстановитьПользовательскийОтборСКД(КомпоновщикНастроек, "Склад", СкладАптеки, ВидСравненияКомпоновкиДанных.Равно);
		
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "ЖурналПриемочногоКонтроля");
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки); 
	
	ОткрытьФорму("Отчет.Бит_ЖурналПриемочногоКонтроля.Форма", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьПользовательскийОтборСКД(КомпоновщикНастроек, ИмяОтбора, ЗначениеОтбора, ВидСравнения = Неопределено)
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	ПолеКД = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	
	Для Каждого Элем Из Настройки.Отбор.Элементы Цикл
		
		Если Элем.ЛевоеЗначение = ПолеКД Тогда
			ЭлементОтбора = Элем;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		Возврат;		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда	
		ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	 	ПользовательскийОтбор = ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
		ПользовательскийОтбор.Использование = (ЗначениеОтбора <> Неопределено);
		ПользовательскийОтбор.ВидСравнения = ?(ВидСравнения <> Неопределено, ВидСравнения, ВидСравненияКомпоновкиДанных.Равно); 
		ПользовательскийОтбор.ПравоеЗначение  = ЗначениеОтбора;
	КонецЕсли;

КонецПроцедуры

