
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Запись, ЭтотОбъект);
	
	Если Не Параметры.Ключ.Пустой() Тогда
		
		Если ЗначениеЗаполнено(ПолучитьКодКАТ(Запись.КАТ)) Тогда
			ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьКодКАТ(КАТ)
	
	Если ТипЗнч(КАТ) = Тип("СправочникСсылка.КЛП") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КАТ, "КодЕСКЛП");
	ИначеЕсли ТипЗнч(КАТ) = Тип("СправочникСсылка.РегистрЛекарственныхСредств") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КАТ, "НомерРЛС");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
