
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ПринадлежностьКСпискам);
	ОбъектМожноРедактировать = Параметры.ОбъектМожноРедактировать;
	
	Элементы.ФормаКомандаОК.Доступность = Не ТолькоПросмотр;
	
	Если Наркотические <> Перечисления.СпискиНаркотическихВеществ.Список2или3 Тогда
		Элементы.НаркотическоеВеществоСписок2или3.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ВНациональномКалендареПрививок.Доступность = ОбъектМожноРедактировать;
	Элементы.ВКалендареПрививокПоЭпидемическимПоказаниям.Доступность = ОбъектМожноРедактировать;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Модифицированность Тогда
		
		ПринадлежностьКСпискам = Новый Структура;
		ПринадлежностьКСпискам.Вставить("ПринадлежностьК7ВЗН"  , ПринадлежностьК7ВЗН);
		ПринадлежностьКСпискам.Вставить("БезрецептурныйОтпуск" , БезрецептурныйОтпуск);
		ПринадлежностьКСпискам.Вставить("ЖНВЛП"                , ЖНВЛП);
		ПринадлежностьКСпискам.Вставить("Наркотические"        , Наркотические);
		ПринадлежностьКСпискам.Вставить("СильнодействующиеИЯды", СильнодействующиеИЯды);
		ПринадлежностьКСпискам.Вставить("ВНациональномКалендареПрививок"             , ВНациональномКалендареПрививок);
		ПринадлежностьКСпискам.Вставить("ВКалендареПрививокПоЭпидемическимПоказаниям", ВКалендареПрививокПоЭпидемическимПоказаниям);
		
		Закрыть(ПринадлежностьКСпискам);
		
	Иначе
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
